import datetime
import random
import smtplib
import pandas
from flask import Flask, render_template, redirect, url_for, flash, request, abort
from flask_bootstrap import Bootstrap
from flask_ckeditor import CKEditor
from werkzeug.security import generate_password_hash, check_password_hash
from flask_sqlalchemy import SQLAlchemy
from flask_login import UserMixin, login_user, LoginManager, login_required, current_user, logout_user
from flask_wtf import FlaskForm
from sqlalchemy.orm import relationship
from wtforms import StringField, SubmitField, PasswordField
from wtforms.fields.html5 import EmailField
from wtforms.validators import DataRequired
from functools import wraps
import os
import json

app = Flask(__name__)
app.config['SECRET_KEY'] = os.environ.get("SECRET_KEY")
ckeditor = CKEditor(app)
Bootstrap(app)

app.config['SQLALCHEMY_DATABASE_URI'] = os.environ.get("DATABASE_URL", "sqlite:///sena-base.db")
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
db = SQLAlchemy(app)

admin = False
login_manager = LoginManager()
login_manager.init_app(app)

MY_EMAIL = os.environ.get("MY_EMAIL")
SENA_EMAIL = 'sivagangainagarajan@gmail.com'
MY_PASSWORD = os.environ.get("MY_PASSWORD")


@login_manager.user_loader
def load_user(user_id):
    return User.query.get(int(user_id))


def admin_only(f):
    @wraps(f)
    def decorated_function(*args, **kwargs):
        # If id is not 1 then return abort with 403 error
        if current_user.user_id != 1:
            return abort(403)
        # Otherwise continue with the route function
        return f(*args, **kwargs)

    return decorated_function


class User(UserMixin, db.Model):
    __tablename__ = "User"
    user_id = db.Column(db.Integer, primary_key=True)
    email = db.Column(db.String(100), unique=True)
    password = db.Column(db.String(100))
    username = db.Column(db.String(100))
    test = relationship("Test15", back_populates="test_author")
    test16 = relationship("Test16", back_populates="test_author")

    def get_id(self):
        return self.user_id


class Test15(db.Model):
    __tablename__ = "Test_15"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test")
    marks = db.Column(db.Integer)
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test16(db.Model):
    __tablename__ = "Test_16"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test16")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Admission(db.Model):
    __tablename__ = "New_Admission"
    user_id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(100))
    mobile_number = db.Column(db.Integer)
    email = db.Column(db.String(100), unique=True)


db.create_all()
db.session.commit()


class RegisterForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Register')


class LoginForm(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Login')


class AdmissionForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    number = StringField("Phone*", validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    submit = SubmitField('Submit')


class ChangeDetails(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    old_password = PasswordField('Old Password*', validators=[DataRequired()])
    new_password = PasswordField('New Password*', validators=[DataRequired()])
    submit = SubmitField('Submit')


student_mails = {
    "mgopalakrishnan075@gmail.com": ["Gopal", 2000],
    "nivir6558@gmail.com": ["Nivetha", 7000],
    "jaya26jj@gmail.com": ["Christy", 5000],
    "srjamuna1003@gmail.com": ["jamuna", 7000],
    "satheshpandian1997@gmail.com": ["Satheshpandian", 4000],
    "lakshmiraja412@gmail.com": ["Rajalaskhmi", 5000],
    "tamilarasanbe9597@gmail.com": ["Anitha", 1000],
    "rajeshkannan6341@gmail.com": ["Rajesh kannan", 3000],
    "jaishreeramgp@gmail.com": ["Yogapriya", 3000],
    "irudhayasubiksha2001@gmail.com": ["Subiksha", 0],
    "abinayaabi257@gmail.com": ["Abi", 1000],
    "shanthirasu1991@gmail.com": ["Shanthi", 0],
    "pradee1296@gmail.com": ["Pradeepa", 5000],
    "jeniferj0204@gmail.com": ["Janifer", 7000],
    "krish47457@gmail.com": ["Krishna", 0],
    "naveenaryan440@gmail.com": ["Naveen", 0],
    "veerasurya250899@gmail.com": ["Suriya", 3000],
    "amin2svg@gmail.com": ["Amin", 3000],
    "jjprincy06@gmail.com": ["Jeba Josepin Princy", 0],
    "jancybetsia20@gmail.com": ["Jancy", 0],
    "cottonpanju9@gmail.com": ["Panju", 2000],
    "rameswariv1999@gmail.com": ["Rameshwari", 2000],
    "vimaladharmar2002@gmail.com": ["Vimala", 1000],
    "devahi1993@gmail.com": ["Devahi", 0],
    "sarojiniganesan96@gmail.com": ["Sarojini", 0],
    "gangadha91@gmail.com": ["Gangadharan", 0],
    "krishnannk498@gmail.com": ["Kamatchi", 0],
    "indhuindhumathi141@gmail.com": ["Indhumathi", 4000],
    "jamespurysh@gmail.com": ["Purushothaman", 0],
    "sivagangainagarajan@gmail.com": ["Nagarajan", 0],
    "matheshsethu22@gmail.com": ["Mathesh", 4000],
    "nagarajnkarthika@gmail.com": ["Karthika", 2000],
    "keviraj482@gmail.com": ["Yogesh", 2000],
    "christyjeslina98@gmail.com": ["Christy", 3500],
    "vhnu778@gmail.com": ["Vishnu", 7000],
    "krish.16491@gmail.com": ["Krishnaveni", 7000]
    

}

verified_emails = [mail.strip() for mail in student_mails.keys()]

exam_sites = {

    "15": ["June 14, 2021 10:00:00", "June 14, 2021 13:30:00"],
    "16": ["June 23, 2021 10:00:00", "June 23, 2021 17:30:00"]

}

sl_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
         31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58,
         59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
         87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
         112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133,
         134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
         156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177,
         178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199,
         200]

ques = ['ஒவ்வொரு புராணமும் ஏதோ ஒரு உண்மையைக் கூற விழைகிறது என்று குறிப்பிடுபவர் யார்?', '“பண்பாடு என்பது, பொதுவாக '
                                                                                        'நாகரிகத்தில் அடங்கியதாகும். '
                                                                                        'காலப்போக்கில் மக்கள் தம் '
                                                                                        'வளர்ச்சியின் மனநல ஆக்கமே '
                                                                                        'பண்பாடாக பெயர் பெறுகின்றது” '
                                                                                        'எனக் கூறியவர் யார் ?',
        '"culture" என்னும் சொல்லின் மூலச் சொல்லான "cultura" எம்மொழிச்சொல்?', '“ மனித வாழ்க்கையை பிரதிபலித்துக் '
                                                                             'காட்டும் காலக் கண்ணாடியே இலக்கியம். '
                                                                             'ஆதலால், காலத்தின் கோலத்தை அந்தந்த கால '
                                                                             'இலக்கியங்களில் காணலாம்” என கூறியவர் '
                                                                             'யார்?', 'சமண நூல்கள் எவ்வாறு '
                                                                                      'அழைக்கப்படுகின்றன?',
        'பாமரரின் பாடல்களை குறிப்பிட தொல்காப்பியர் பயன்படுத்திய வார்த்தை?', '1907 இல் எச்.எஸ்.ஆல்காட் அவர்களின் '
                                                                            'மறைவுக்குப் பிறகு பிரம்மஞான சபையின் உலக '
                                                                            'அளவிலான தலைவராக தேர்ந்தெடுக்கப்பட்டவர் '
                                                                            'யார்?', '“பழங்கால பண்பாட்டின் எச்சமே('
                                                                                     'culturalsurvival) '
                                                                                     'நாட்டுப்புறவியல்"என்பது யாருடைய '
                                                                                     'கருத்து ஆகும்?',
        "புராணக் கதைகள்,தங்களை உருவாக்கிய மக்களைப் பற்றியும் பயன்படுத்துவோரை பற்றியும் கூறுகிறது' என்றவர் யார்?\n",
        '1802 ஆம் ஆண்டு சென்னை மாகாணத்தை உருவாக்கியவர் யார் ?', 'பெரியார், நீதிக்கட்சியை,திராவிடர் கழகம் எனப் பெயர் '
                                                                'மாற்றம் செய்யும் தீர்மானத்தினை சேலத்தில் '
                                                                'நிறைவேற்றியது எப்போது?', 'சென்னை மாகாணத்தை தமிழ்நாடு '
                                                                                          'என பெயர் மாற்றம் செய்ய, '
                                                                                          'யாருடைய இடைவிடாத '
                                                                                          'முயற்சியின் காரணமாக '
                                                                                          'அனைத்து கட்சிகளின் '
                                                                                          'கூட்டமைப்பு ஒரு பொது வேலை '
                                                                                          'நிறுத்தத்திற்கு அறைகூவல் '
                                                                                          'விடுத்தது ?', 'இந்தி பேசாத '
                                                                                                         'மாநிலங்கள் '
                                                                                                         'விரும்புகின்ற வரை இந்தி திணிப்பு இருக்காது அது வரை ஆங்கிலமே இணைப்பு மொழியாக இருக்கும் என்று உறுதி மொழியினை வழங்கியவர் யார்?', "ஒன்றே குலம் ஒருவனே தேவன்' என்பது யாருடைய கூற்று?", 'எச்சொல்லில் இருந்து மருவி நாகரிகம் என்னும் சொல் உருவானது ?', 'தவறான இணை எது?', 'தவறான இணை எது?', 'Language is the vehicle of communication என்று கூறியவர் யார்?', 'உலக அளவில் பொருட்களை வாங்கும் திறன் அடிப்படையில் எந்த இடத்தில் இந்தியா உள்ளது?', 'தமிழகத்தில் கொண்டாடப்படும் பொங்கல் விழா வட இந்தியாவில் எப்பெயரில் கொண்டாடப்படுகிறது?', 'தேசிய இளைஞர் தினவிழா என்று கொண்டாடப்படுகிறது?', 'பின்வரும் கூற்றுகளை ஆராய்க:\n1.இந்தியாவில் சுதேச அரசுகளை தோற்றுவித்தவர்கள் முகலாயர்கள் ஆவர்.\n2. முகலாயர்களுக்கு பிறகு சுதேச அரசுகளை ஆங்கிலேயர்களும் கொண்டிருந்தனர்.', 'குண்டு முழங்கி மரியாதை செய்யும் முறையை கடைப்பிடிக்காதவர்கள் யார்?', 'சுதந்திரத்திற்கு முன்னர் இந்தியாவில் இருந்த சுதேச அரசுகளின் எண்ணிக்கை என்ன?', 'பிரிட்டிஷ் கிழக்கிந்திய நிறுவனத்தால் குண்டு முழங்கும் மரியாதை வழங்கப்பட்ட சுதேச அரசுகளின் எண்ணிக்கை என்ன?', 'குண்டு முழங்கும் மரியாதை பெற்ற அரசுகளில் அம்மரியாதைக்கு உட்பட்டவர் யார்?', 'மிதவாத தேசியவாதிகள் மற்றும் முஸ்லிம் லீக்கின் ஆதரவைப் பெறும் நோக்கிலும் தீவிர தேசியவாதிகளை தனிமைப்படுத்தும் நோக்கிலும் பிரிட்டிஷார் 1909இல் நிறைவேற்றியது எதை?', 'மின்டோ மார்லி சீர்திருத்தம் வேறு எவ்வாறு அழைக்கப்பட்டது?', 'மின்டோ மார்லி சீர்திருத்தம் யாருக்கான தனித் தொகுதியை வழங்கியது?', 'காங்கிரஸ் கட்சியில் ஏற்கனவே உறுப்பினராக இருந்த முகமது அலி ஜின்னா முஸ்லீம் லீகில் இணைந்து ஆண்டு என்ன?', 'காங்கிரஸ்,முஸ்லிம் லீக்,தன்னாட்சி இயக்கம் ஆகியன 1916 ஆம் ஆண்டு தங்களுடைய வருட மாநாடுகளை எங்கு நடத்தின?', '“தன்னாட்சி என்பது நாட்டில் மக்களால் தேர்ந்தெடுக்கப்பட்ட உறுப்பினர்களை கொண்ட சபைகள் மூலமாகவும் அவர்கள் சபைக்கு கடமைப்பட்டவர்கள் ஆகவும் விளங்க நடைபெறும் ஆட்சி ஆகும்” என்று குறிப்பிட்டவர் யார்?', 'தன்னாட்சி இயக்கத்துக்கான பின்னணி என்ன?', 'மேற்கத்திய இந்தியாவில், யாருடைய தலைமையில் தன்னாட்சி இயக்கம் (ஹோம்ரூல்)', '1916இல் இந்துக்கள் மற்றும் முஸ்லிம்களிடையே கையெழுத்தான ஒப்பந்தம் எது?', 'அன்னிபெசன்ட் அம்மையார் ஆல் 1914இல் தொடங்கப்பட்ட வாராந்திரி எது?', 'பின்வருவனவற்றுள் அன்னிபெசன்ட் அம்மையாரின் முழக்கம் எது ?', 'தன்னாட்சி குறித்த தனது கொள்கையை, அன்னிபெசன்ட் அம்மையார் தான் எங்கு நிகழ்த்திய உரையில் வெளிப்படுத்தினார்?', 'முதல் உலகப்போரில், நேச நாடுகளுக்கு எதிராக முக்கூட்டு நாடுகளுக்கு ஆதரவாக துருக்கி சுல்தான் களமிறங்கி எந்நாட்டை தாக்கினார்?', 'மார்ச் 1920இல் கிலாபத் இயக்கத்தின் கோரிக்கைகளை பாரிஸ் தூதாண்மை அதிகாரிகளிடம் சமர்ப்பித்தவர் யார்?', 'கிலாபத் இயக்கத்தின் கோரிக்கைகளில் சேராதது எது?', 'எப்பகுதியில் இருந்த முஸ்லிம்கள் கிலாப்(எதிர்ப்பு) என்ற அர்த்தம் உடைய உருது மொழி வார்த்தையை நிர்வாகத்துக்கு எதிரான பொது கிளர்ச்சியின் அடையாளமாக பயன்படுத்தினார்கள்?', 'முதல் உலகப்போருக்கு பின்னர் உலகம் முழுவதும் பரவிய _____ தொற்று நோயின் பிடியில் இந்தியாவும் சிக்கிக்கொண்டு தவித்தது .', '1918ல் இந்தியாவிலேயே முதல் முறையாக அமைக்கப்பட்ட தொழிற்சங்கமான “மதராஸ் தொழில் சங்கத்தை” நிறுவியவர் யார் ?', 'சோகன் சிங் பக்னாவை தலைவராகக் கொண்டு சான் பிரான்சிஸ்கோவில் வசித்துவந்த லாலா ஹர்தயாள் 1913 இல் நிறுவிய அமைப்பு எது?', 'பசுபிக் பிரதேச இந்துஸ்தான் எனும் அமைப்பு கதார் கட்சி என்று அழைக்கப்பட்டது.கதார் என்ற உருதுமொழி சொல்லின் பொருள் என்ன ?', "1937இல் 'culture' என்னும் சொல்லுக்கு இணையாக 'பண்பாடு' என்னும் தமிழ்ச் சொல்லை டி.கே.சிதம்பரநாதனார் பயன்படுத்தியதாக", 'பண்பாட்டைப் பற்றி “பண்பெனப்படுவது பாடறிந்து ஒழுகுதல்” என்று குறிப்பிடும் நூல் எது?', '“பண்பாடு அல்லது கலாச்சாரம் என்பது, சமயம், பாரம்பரியம்,பொருளாதாரம் ஆகியவற்றைக் கொண்டு நிர்ணயிக்கப்படுகிறது ”என்று கூறியவர் யார்?', '“நான்கு வருணமுறை”தோன்றிய காலம் என்ன?', 'பின்வரும் கூற்றுகளை ஆராய்க:\n1.புறநானூற்றின் வழியாக 38 வகை அணிகலன்கள் இருந்ததை நாம் அறிகிறோம்.\n2. புறநானூற்றின் வழியாக 67 வகை உணவுகள் இருந்ததையும் நாம் அறிகிறோம்', 'தமிழர் திருமண முறைகளைப் பற்றி அறிந்து கொள்ளமுடியும் தனி இலக்கிய நூல் எது?', 'தவறான இணை எது ?\n1.பொதுமை நோக்கம் - புறநானூறு\n2. அன்பின் சிறப்பு - நற்றினை\n3. விருந்தோம்பும் பண்பு - ஐங்குறுநூறு\n4. மார்கழி நோன்பு - கலித்தொகை', '“இலக்கியங்கள், காலம் காட்டும் கண்ணாடிகள் ஆக விளங்க, நாட்டுப்புற இலக்கியங்கள் சமுதாய வளர்ச்சியை காட்டும் கண்ணாடிகள் ஆக விளங்குகின்றன ”என்று கூறியவர் யார்?', 'கொடுக்கப்பட்டவர்களில் தென்னிந்திய நல உரிமை கூட்டமைப்பினை உருவாக்கியவர் யார்?', 'எந்த ஆண்டு நடைபெற்ற சென்னை மாகாண தேர்தலில் நீதிக்கட்சி போட்டியிட்டு முதன்முதலில் வெற்றிபெற்று ஆட்சி அமைத்தது?', "'தட்சிண பிரதேச' கோரிக்கையை கடுமையாக எதிர்த்தவர்களில் சேராதவர் யார் ?", 'சென்னை மாகாணத்தை தமிழ்நாடு என பெயர் மாற்றம் செய்ய கோரி ஜூலை 27, 1956 அன்று சாகும்வரை உண்ணாநோன்பினை துவங்கியவர் யார்?', 'இந்திய பண்பாட்டின் இயல்புகளில் சேராதது எது ?', '“மேன்மையான சிந்தனைகள் எல்லாப் பகுதிகளிலிருந்தும் நம்மிடம் வரட்டும்” என்று கூறும் வேதம் எது?', 'எண்ணற்ற அதிசயங்களை தன்னகத்தே கொண்டது இந்தியா என்று கூறும் புகழ் மிக்க வரலாற்று அறிஞர் யார்?', 'கி.மு ஐந்தாம் நூற்றாண்டிலேயே இந்தியா பல இனங்களையும் அதிக மக்கள் தொகையையும் பெற்றிருந்தது என்று குறிப்பிடும் வரலாற்று அறிஞர் யார் ?', 'இந்தியாவை பல “இனங்களின் அருங்காட்சியகம்” என்று குறிப்பிட்டுள்ளவர் யார்?', 'இந்திய அரசியலமைப்பில் அட்டவணை படுத்தப்பட்டுள்ள 22 மொழிகளில், மிகவும் பழமையான மொழியான தமிழ் எவ்விடத்தில் வைக்கப்பட்டுள்ளது?', 'அரசியல் மற்றும் பண்பாட்டு ஒற்றுமை இந்திய தேசத்தை வலிமைமிக்க தேசமாக்கியது என்றவர் யார்?', 'பின்வருவனவற்றுள் எது வட திராவிட மொழி?', '21 குண்டுகளை முழங்கும் உரிமை பெற்று இருந்த சுதேச அரசுகளில் சேராதவர் யார்?', 'திவான் ஷா நவாஸ் பூட்டோ பாகிஸ்தானோடு என்று இணைந்தார்?', 'தன்னாட்சி இயக்கத்தை ஹோம்ரூல் தொடங்கியவர் யார்?', 'சுதந்திர இந்தியாவில் முதல் மொழிவழி மாநிலமாக உருவாக்கப்பட்ட மாநிலம் எது ?', 'ஆந்திர மாநிலம் அமைக்கக் கோரி சாகும்வரை உண்ணாவிரதப் போராட்டம் மேற்கொண்டவர் யார் ?', 'பின்வருவனவற்றுள், மொழிவாரி தனிமாநில கோரிக்கைகளை பரிசீலிக்க, ஜவஹர்லால் நேருவால் அமைக்கப்பட்ட குழு எது?', '“காங்கிரஸ் (இந்திய தேசத்திற்குள் வாழும்) ஒவ்வொரு குழுவின் சுதந்திரத்திற்கும் துணை நிற்பதோடு அந்த குழுக்களின் தனிப்பட்ட வாழ்வு, கலாச்சாரம் போன்றவற்றை மேம்படுத்த தேசத்திற்குள் மொழி மற்றும் கலாச்சார அடிப்படையில் மாகாணங்களை அமைக்கவும் துணை செய்யும்” என்று எந்த தேர்தல் அறிக்கையில் குறிப்பிட்டிருந்தது?', 'பட்டாபி சீதாராமையா ஆந்திரா மாகாணத்திற்கான கோரிக்கையை அரசமைப்பு நிர்ணயசபையில் முன்வைத்த நாள் எது?', '1948, ஜூன் 17 இல் அரசமைப்பு நிர்ணயசபை தலைவர் ராஜேந்திர பிரசாத் அமைத்த மூவர் ஆணையம் எவ்வாறு அழைக்கப்பட்டது?', '1916 லக்னோ மாநாட்டில், தீவிர தேசியதன்மை கொண்டவர்களை வரவேற்ற காங்கிரஸ் தலைவர் யார்?', 'தேசியவாதிகளின் நடவடிக்கைகள் பற்றிய தகவல்களை ரகசியமாக சேகரிப்பதற்காக 1903இல் குற்ற உளவுத்துறையை(CID) உருவாக்கியவர் யார்?', 'இந்திய பாதுகாப்பு ஒழுங்குமுறைகள் சட்டம் முதன் முதலாக எந்த வழக்கு விசாரணையின்போது பயன்பட்டது?', 'முதல் உலகப் போர் முடிவுற்றபின், இந்திய பாதுகாப்பு ஒழுங்குமுறைகள் சட்டத்தின் அடிப்படை கூறுகளுடன் புதிதாக உருவாக்கப்பட்ட சட்டம் எது?', 'லக்னோ ஒப்பந்தம் வேறு எவ்வாறு அழைக்கப்பட்டது?', 'வெளிநாட்டினரின் நுழைவுக்கு கட்டுப்பாடுகளை விதிக்கும் வெளிநாட்டினர் அவசரச் சட்டம் ஆங்கில அரசால் இயற்றப்பட்ட ஆண்டு என்ன?', 'முதல் உலகப்போரின்போது தேசியவாத மற்றும் புரட்சிகர நடவடிக்கைகளை கட்டுப்படுத்தும் நோக்கில் அவசர கிரிமினல் சட்டம் இயற்றப்பட்ட சட்டம் எது ?', 'ஆங்கில அரசால் கொண்டுவரப்பட்ட அடக்குமுறை சட்டங்களிலேயே மிகக்கொடுமையானது எது?', 'இந்திய தேசிய இயக்கத்தில் பெரும் தாக்கத்தை ஏற்படுத்தியது எது?', 'முதல் உலகப்போரில் துருக்கியின் தோல்வி மற்றும் செவ்ரஸ் உடன்படிக்கையின் விளைவாக தோன்றிய இயக்கம் எது ?', 'அயர்லாந்தைச் சேர்ந்த அன்னிபெசன்ட் அம்மையார் பிரிட்டனில் இருந்தபோது பங்காற்றிய இயக்கங்களில் சேராதது எது ?', 'அன்னிபெசன்ட் அம்மையார் ஆல் இந்துக்கல்லூரி எங்கு நிறுவப்பட்டது?', 'பின்வருவனவற்றுள், அன்னிபெசன்ட் அம்மையாரின் அறிவிப்பு எது?', 'மதராஸில் அன்னிபெசன்ட் அம்மையாரின் தன்னாட்சி இயக்கம் மிகவும் பிரபலம் அடைந்ததை அடுத்து, இந்த இயக்கத்தின் கூட்டங்களில் கலந்துகொள்ள யாருக்கு தடை விதிக்கப்பட்டது?', 'பெசன்ட் அம்மையாருக்கு ஆதரவாக நைட்ஹுட் (knighthood) என்ற அரச பட்டத்தை துறந்தவர் யார் ?', 'யாருடைய உத்தரவின் பேரில் ஜம்னாதாஸ்,துவாரகாதாஸ் மற்றும் ஷங்கர்லால் பன்கர் ஆகியோர் பெசன்ட் மற்றும் இதர தலைவர்களை சிறைபிடித்த நடவடிக்கைகளை ரத்து செய்யக்கோரி ஓராயிரம் நபர்களிடம் கையெழுத்து வாங்கி பெசன்ட் அம்மையார் சிறைபிடிக்கப்பட்ட இடத்துக்கு பேரணியாக சென்றனர்?', 'பிரிட்டிஷ் அரசின் கீழ் இந்தியா தன்னாட்சி பெறுவது அல்லது கனடா, ஆஸ்திரேலியா ஆகியவற்றின் வழியில் தன்னாட்சிப் பகுதி தகுதியை பெறுவது ஆகியவற்றுக்காக பிரிட்டிஷ் நாடாளுமன்ற உறுப்பினர்களின் ஆதரவை கோருவதற்காக, தன்னாட்சி இயக்கம் எவ்வாறு பெயர் மாற்றம் செய்யப்பட்டது?', 'இந்திய காமன்வெல்த் லீகை, இந்திய லீக் என்று 1929இல் பெயர் மாற்றம் செய்தவர் யார்?', 'முதல் உலகப் போருக்குப் பிறகு துருக்கியின் நிலையை பலவீனப்படுத்த முடிவு செய்த பிரிட்டன் எந்த ஒப்பந்தத்தில் கையெழுத்திட்டது ?', 'கிலாபத் இயக்கம் அலி சகோதரர்கள் துவங்கப்பட்ட ஆண்டு என்ன?', 'கிலாபத் இயக்கத்தில் தன்னை இணைத்துக் கொண்ட முஸ்லிம் தலைவர்களில் சேராதவர் யார்?', 'முழுமையான இந்திய இஸ்லாமிய அரசியல் மேம்பாட்டுக்கான வழியை திறக்க “முழுமையான இஸ்லாமிய அடையாளம் பயன்பட்டது” என்று கிலாபத் இயக்கம் பற்றி கூறியவர் யார் ?', 'இந்திய தேசியம் என்ற தேசிய நீரோட்டத்தில் முஸ்லிம்களை இணைக்கும் காரணியாக விளங்கியதால் கிலாபத் இயக்கத்திற்கு ஆதரவு தெரிவித்ததுடன், இந்து-முஸ்லீம் ஒற்றுமையை பலப்படுத்த இதனை ஒரு வாய்ப்பாக கருதியவர் யார் ?', 'மலபாரை சேர்ந்த மாப்பிள்ளைகள், கிலாபத் இயக்கத்தை யாருக்கு எதிரான கிளர்ச்சி ஆக உருமாற்றம் செய்தனர்?', 'கிலாபத் இயக்கத்தின் தொடர்பில் ஒத்துழையாமை இயக்கத்தை காந்தியடிகள் தொடங்கியபோது, காந்தியடிகள் திரும்ப ஒப்படைத்த பதக்கம் எது?', 'கடந்த ஒரு மாத காலமாக நடந்த நிகழ்வுகளை பார்க்கும்போது கிலாபத் இயக்க விஷயத்தில் ஏகாதிபத்திய அரசு நேர்மையற்ற, நியாயமற்ற வகையிலும் மற்றும் கிரிமினல் போலவும் நடந்துகொண்டதுடன், தங்கள் நேர்மையற்ற தன்மையை பாதுகாக்க தவறுக்கு மேல் தவறு செய்தன. இத்தகைய அரசு மீதான மதிப்பையோ அல்லது அன்பையோ என்னால் இருப்பு வைக்க இயலவில்லை.” என்று கூறியவர் யார்?', '1917ஆம் ஆண்டின் ___ புரட்சியின் வெற்றி இந்திய தொழிலாளர்களின் மீது தாக்கத்தை ஏற்படுத்தியது', 'பக்கிங்காம், பெரம்பூர் கர்நாடிக் மில் ஆகியவற்றின் தொழிலாளர்கள் மோசமாக நடத்தப்பட்டதன் காரணமாக உருவாக்கப்பட்ட தொழிற்சங்கம் எது?', '1920 அக்டோபர் 30 இல் 1,40,854 உறுப்பினர்களைக் கொண்ட 64 தொழிற்சங்கங்களை சேர்ந்த பிரதிநிதிகள் பம்பாயில் ஒன்றுகூடி யார் தலைமையில் அகில இந்திய தொழிற்சங்க காங்கிரசை(AITUC) நிறுவினர்?', '“பண்படுவது பண்பாடு. பண்படுதல் என்பது சீர்படுதல் அல்லது திருந்துதல். திருந்திய நிலத்தை பண்பட்ட அல்லது பண்படுத்தப்பட்ட நிலம் என்றும், திருந்திய தமிழை பண்பட்ட செந்தமிழ் என்றும், திருந்திய உள்ளத்தை பண்பட்ட உள்ளம் என்றும் சொல்வது வழக்கம்.” என கூறியவர் யார்?', 'பின்வரும் கூற்றுகளை ஆராய்க:\n1.வேதங்கள் மற்றும் பிராமணங்கள் ஆகியவை அக்கால ஞானிகள்,துறவிகள் ஆகியோரின் தத்துவப் பார்வை பற்றி எடுத்துரைக்கின்றன. \n2. ஆரண்யங்கள், உபநிடதங்கள் ஆகியவை ஆசிரியர்களின் வழிபாடு, நம்பிக்கைகள் பற்றி எடுத்துரைக்கின்றன.\n', 'பதினெண் கீழ்க்கணக்கு நூல்களில், எத்தனை நூல்கள் அறக்கருத்துக்களை வலியுறுத்துகின்றன?', 'அறக்கருத்துக்களை வெளிப்படுத்தும் நூலான“நாலடியார்” யாரால் பாடப்பட்டது?', 'தவறான இணை எது?\n1. சுத்த பீடகம் - பௌத்தத் துறவிகளுக்கான சட்டதிட்டங்கள்\n2. விநய பீடகம் - புத்தரின் தத்துவங்கள்\n3. அபிதம்ம பீடகம் - புத்தரின் அறிவுரைகள்', 'தமிழ் நாட்டில் பௌத்த சமயம் பரவி இருந்ததை நாம் எக்காப்பியத்தின் மூலம் அறியலாம் ?', 'கதைப்பாடலுக்கு தமிழில் வழங்கப்பட்ட பெயர் என்ன?', "சோற்றுக்குமுன் உப்பு, பேச்சுக்குமுன் ___ 'என்பது பழங்கால வழக்கில் இருந்தது?", 'மொழிவாரி மாகாணங்கள் ஆணையம் தமது அறிக்கையை சமர்ப்பித்த நான் எது?', 'நாடாளுமன்ற சட்டத்தின் மூலம்\n1. எந்த மாநிலத்தின் நிலப்பகுதியையும் அதிகரிக்கலாம்\n2. எந்த மாநிலத்தின் நிலப்பகுதியையும் குறைக்கலாம்\n3. எந்த மாநிலத்தின் எல்லையையும் மாற்றியமைக்கலாம்.\nஎன்று தெரிவிக்கும் இந்திய அரசமைப்பு உறுப்பு எது?', 'இந்திய நாட்டிற்கு பெருமையும் சிறப்பும் சேர்க்கும் இன்றியமையாத பண்பாட்டுச் சிறப்பு கூறுகளில் சேராதது எது?', 'இந்திய பண்பாட்டின் ஆணிவேராக விளங்குவது எது?', 'தவறான இணை எது?\n1. தர்மம் - அறம் அல்லது ஈகை\n2.அகிம்சை - கொல்லாமை\n3.அகிம்சை - எண்ணம்,சொல், செயல் ஆகியவற்றால் பிறருக்கு துன்பம் செய்யாமை\n4.கருணை -  இரக்கம்', '“யாதும் ஊரே யாவரும் கேளிர்” என கணியன் பூங்குன்றனார் வலியுறுத்துவது எதை?\n', 'இந்தியாவின் தேசிய நதியாக கங்கை அறிவிக்கப்பட்ட ஆண்டு எது ?', 'புவியியலாளர்கள் இந்தியாவை எந்நாட்டுடன் ஒப்பிடுகின்றனர்?', 'அஸ்ஸாம் நேபாள எல்லையில் வாழும் இந்திய இனம் எது?', 'தோடர்கள், இருளர்கள், குறும்பர்கள் போன்ற பழங்குடி இன மக்கள் காணப்படும் மாநிலம் எது?', '2011 ஆம் ஆண்டின் கணக்கெடுப்பின்படி,இந்தியாவில் எத்தனைக்கும் மேற்பட்ட மொழிகள் பேசப்பட்டு வந்தன ?', 'சமஸ்கிருதம் மற்றும் வட மொழிகளை எழுத பயன்படுத்தப்பட்ட எழுத்து வடிவம் என்ன?', 'வடகிழக்கு இந்தியாவில் அதிகம் பேசப்படும் மொழி எது?', 'பின்வருவனவற்றுள் இந்தியாவினுள் தோன்றாத மதம் எது?', 'பின்வரும் கூற்றுகளை ஆராய்க:\n1. இந்தியா வடக்கு தெற்காக 2933 கிலோ மீட்டர் நீளத்தை கொண்டது\n2.இந்தியா கிழக்கு மேற்காக 3214 கிலோ மீட்டர் அகலத்தை  கொண்டது .', "சிந்து நதி பாயும் பகுதி என்பதால், இந்தியத் துணைக்கண்டத்தை 'சிந்து' என்று முதன்முதலில் அழைத்தவர்கள் யார்?", 'யார் எழுதிய "The Secret Way"என்ற நூலை தமிழில் இரகசிய வழி என்ற பெயரில் மனோன்மணியம் சுந்தரனார் மொழிபெயர்த்துள்ளார்?', 'கூற்று: முதல் உலகப்போரில் தன்னை ஆதரித்த முஸ்லிம் லீக்கை பிரிட்டிஷார் சந்தேகக்கண்கொண்டு பார்த்தனர்.\nகாரணம்: துருக்கியின் சுல்தான் முதல் உலகப்போரில் மைய நாடுகளை ஆதரித்தார்.', 'பின்வரும் கூற்றுகளை ஆராய்க:\n1. பழமொழியும் பொன்மொழியும் ஒன்றே\n2. சிறந்த கருத்தைச் சொல்வது பழமொழி.\n3. உயர்ந்த பண்பாட்டை வலியுறுத்துவது பொன்மொழி', 'பின்வருவனவற்றுள், தன்னாட்சி இயக்கத்தின்  இரட்டை குறிக்கோள்களில் சேராதது எது?', 'ஏப்ரல் 1916இல் எங்கு நடந்த பம்பாய் மாகாண மாநாட்டில் திலகரின் தன்னாட்சி இயக்கம் நிறுவப்பட்டது?', "தன்னாட்சி இயக்கம் வீழ்ச்சி அடைய காரணம் என்ன?\n1. 'Indian unrest' என்ற புத்தகத்தின் ஆசிரியர் வேலன்டைன் சிரோலிக்கு எதிராக தாம் கொடுத்த அவதூறு வழக்கை நடத்துவதற்காக செப்டம்பர் 1918இல் திலகர் பிரிட்டனுக்கு சென்றதால்\n2. உத்தேசிக்கப்பட்ட மாண்டேகு செம்ஸ்போர்டு சீர்திருத்தங்களை அன்னிபெசன்ட் ஏற்றுக்கொண்டதால்", 'பின்வரும் கூற்றுகளை ஆராய்க:\n1. நீதி கட்சியானது பெரியார் ஈ.வே. ராமசாமி தலைமையில் சுயமரியாதை இயக்கமாக மாறியது\n2. இந்த இயக்கம் தமிழ் மக்களின் பண்பாடு மற்றும் அரசியல் வாழ்வில் பெரும் தாக்கத்தை ஏற்படுத்தியது\n3. தென்னிந்தியாவில் தமிழ் தேசியவாதம் தேய்வதற்கு இவ்வியக்கம் காரணமானது.', "பெரியார், 'திராவிட நாடு' மாநாட்டினை நடத்தி “திராவிட நாடு” கோரிக்கையை முன்வைத்த ஆண்டு என்ன ?", 'திராவிட கருத்தாக்கத்துக்கு எதிர்நிலையில் இருந்த தென்னிந்தியாவை களமாகக் கொண்டு, ராஜகோபாலச்சாரி உருவாக்கிய நிலைகருத்தின் பெயர் என்ன?', 'அனைத்து தமிழர்களும் தட்சிணப்பிரதேச அமைப்பை எதிர்த்து முதலமைச்சருக்கு தந்தி அனுப்புங்கள் என்று அறைகூவல் விடுத்தவர் யார்?', 'மாநில மறுசீரமைப்பு ஆணையம் தனது இறுதி அறிக்கையை சமர்ப்பித்த ஆண்டு என்ன ?', 'புதிய சென்னை மாநிலம் உருவாக்கப்பட்ட நாள் என்ன?', 'லக்னோ ஒப்பந்தத்தின் கீழ் காங்கிரஸ் மற்றும் முஸ்லிம் லீகை ஒன்றிணைப்பதில் முக்கிய பங்காற்றியவர்கள் யார்?', 'கூற்று: லக்னோ ஒப்பந்தத்தின் தலைமை சிற்பியான ஜின்னாவை “இந்து -  முஸ்லிம் ஒற்றுமையின் தூதர்” என்று சரோஜினி அம்மையார் அழைத்தார் .\nகாரணம்: லக்னோ  ஒப்பந்தத்தின் போது ஜின்னா குறிப்பிடத்தக்க பங்காற்றினார்.', 'முழுமையான சுதந்திரம் வேண்டும் என்று முதன்முதலில் கோரிக்கையை எழுப்பியவர்கள் யார்?', 'ஆங்கிலேயர்களின் அடக்குமுறை சட்டங்கள் மற்றும் அவை இயற்றப்பட்ட ஆண்டுகள் கொடுக்கப்பட்டுள்ளன.அவற்றில் தவறான இணை எது ?', 'புறநானூற்றின் வழியாக அறியப்படும் ஆடை வகைகள் எத்தனை?', 'எப்போரின் போது உதியன் சேரலாதன் என்னும் மன்னன்,வீரர்களுக்கு உணவு கொடுத்ததாக புறநானூறு கூறுகிறது?', 'அம்மானை எனும் சொல் முதன்முதலாக கையாளப்பட்ட நூல் எது?', 'கூற்று:பண்பாடு என்பது நிகழ்வு தன்மை அற்றதாய் விளங்குகிறது\nகாரணம்: கால மாற்றத்திற்கு ஏற்ப புதிதாக உருவாக்கிக்கொள்ளப்படும் வாழ்வியல் பண்புகளை, பண்பாடு புறக்கணிக்கிறது.', 'பின்வரும் கூற்றுகளை ஆராய்க:\n1. புற வளர்ச்சி என குறிப்பிடப்படும் நாகரிகம், மாறும் தன்மையுடையது\n2.அக வளர்ச்சியாகிய பண்பாடு என்றும் மாறாதது.', 'சத்தியம் என்பது எம்மூன்றை உள்ளடக்கியது?', 'நாகரிகம் என்பது ____', 'பின்வரும் கூற்றுகளை ஆராய்க:\n1. நாகரிகம் ஒரு முறையான மற்றும் சீரான வளர்ச்சியைக் கொண்டது.\n2. பண்பாட்டு வளர்ச்சி வேகமானது.', 'பண்பாட்டுக்கல்வியின் பயன்களில் சேராதது எது?', 'இந்தியாவில், ஒரு லட்சத்திற்கும் அதிகமானோர் பேசும் மொழிகள் எத்தனை உள்ளன?', 'சில சுதேச அரசுகள் எவ்வித குண்டு மரியாதையையும் பெறாமல் இருந்ததற்கான காரணங்களில் தவறாக கொடுக்கப்பட்டுள்ளது எது?', 'பல சுதேச அரசுகள் இந்தியாவுடன் இணைய ஒப்புதல் அளித்தாலும் தனித்து இருக்க விரும்பிய சுதேச அரசர் யார்?', 'இந்திய ஒருங்கிணைப்பு காலத்தில், ஹைதராபாத் நிஜாமின் மீது செல்வாக்குச் செலுத்திய மிதவாத தலைவர் யார்?', 'மொழி அடிப்படையில் மாநிலங்களை மறுசீரமைக்கும் பணிகள் அரசால் தொடங்கப்பட்ட ஆண்டு என்ன?', 'பம்பாய் மறுசீரமைப்புச் சட்டம் 1960இன் படி உருவாக்கப்பட்ட மாநிலம் எது?', 'இந்திய அரசமைப்பினால் 1956ஆம் ஆண்டு எத்தனை மொழிகள் அங்கீகரிக்கப்பட்டிருந்தன ?', 'பிராமணரல்லாதோர் இயக்கம் தொடங்கப்பட்டதன் காரணம் என்ன ?', 'தமிழகத்தில்,___ மூலம் நீதிக் கட்சியை விட காங்கிரஸ் பலம் வாய்ந்ததாக மாறியது.', 'முதல் உலகப் போரின்போது பிரிட்டிஷாரின் நலனுக்கு ஆதரவாக செயல்பட்டவர்கள் யார் ?', 'தன்னாட்சி இயக்கத்தின் காலம் என்ன?', '1893 இல் எதன் உறுப்பினராக, அன்னிபெசன்ட் அம்மையார் இந்தியாவிற்கு வந்தார் ?', 'எந்நாட்டின் தன்னாட்சி இயக்கத்தின் அடிப்படையில் இந்தியாவில் தன்னாட்சி இயக்கத்தை துவக்கப்போவதாக அன்னிபெசன்ட் அறிவித்தார்?', 'தன்னாட்சி நிறுவனங்கள் மற்றும் பொறுப்பான அரசு என்பதே இந்தியாவில் பிரிட்டிஷ் ஆட்சியின் குறிக்கோள் என்று 1917 ஆகஸ்ட் 20-ல் அறிவித்த வெளியுறவு அமைச்சர் யார்?', 'சட்டமன்றம் மற்றும் உள்ளாட்சி தேர்தல்களில் இஸ்லாமியருக்கு எத்தனை சதவீதம் இடங்களை மின்டோ மார்லி சீர்திருத்தம் வழங்கியது?', 'இந்திய பாதுகாப்பு ஒழுங்குமுறைகள் சட்டம்,சந்தேகத்திற்கு இடமானவர்கள்மீது வழக்குத் தொடர யாருக்கு அனுமதி அளித்தது?', 'பின்வரும் கூற்றுகளை ஆராய்க:\n1.கலீபாவின் அதிகாரத்தை துண்டாடுவது இஸ்லாம் மீதான பெரும் தாக்குதலுக்கு கருதப்பட்டது\n2. உலகம் முழுவதும் உள்ள முஸ்லீம்கள் கலீபா மீது அனுதாபம் கொண்டவர்கள் அதனால் பிரிட்டனின் நடவடிக்கையை எதிர்க்க முடிவு செய்தனர்.\n3. இதன் விளைவாக மௌலானா முகமது அலி, மௌலானா சவுகத் அலி என்ற முஸ்லீம் சகோதரர்கள் கிலாபத் இயக்கத்தைத் தொடங்கினர்', 'பண்பாட்டைப் பற்றி “பண்புடையார்ப் பட்டுண்டு உலகு” என குறிப்பிடும் நூல் எது?', 'பின்வருவனவற்றுள் பண்பாடு உடையோரை குறிப்பிடாத சொல் எது?', 'பின்வருவனவற்றுள் வேதம் அல்லாதது எது?', 'பௌத்த சமய இலக்கியங்கள் எம்மொழிகளில் எழுதப்பட்டன?', 'பின்வருவனவற்றுள் எதன் காலத்தையும் தன்மையையும் அளவிடமுடியாது?', 'ஒரு பள்ளி விழாவில் ஒரு வரிசையில் 30 மாணவர்கள் வீதம் 16 வரிசையில் மாணவர்கள் நிற்க வைக்கப்பட்டனர். ஒரு வரிசையில் 24 மாணவர்கள் வீதம் நிற்க வைக்கப்பட்டால் எத்தனை வரிசை அமையும்?', '52 / x= √169/289 எனில் x- ன் மதிப்பு காண்க?', '√110 1/4=?', '(272^2 - 128^2 ) - இன் வர்க்கமூலம் காண்க ?', '384 - ஐ எந்த எண்ணால் வகுத்தால் அவ்வெண் முழு வர்க்கமாகும் ?', '200 உடன் எந்த எண்ணை பெருக்கினால் அவ்வெண் முழு வர்க்கமாகும்?', 'எந்த எண்ணுடன் 7/2-ஐ பெருக்கினால் 21/ 4 கிடைக்கும்?', '5929 - இன் வர்க்கமூலம் காண்க ?', 'இரு விகிதமுறு எண்களின் கூடுதல் 17/4 அவற்றுள் ஒரு எண் 5/2 எனில், மற்றொரு எண்ணை காண்க?', 'எந்த எண்ணுடன் 5/6-ஐ கூட்டினால் 49/30 கிடைக்கும்?', '12 செ.மீ..,13 செ.மீ .., 23 செ.மீ.., ஆகியவற்றை முறையே பக்க அளவுகளாக கொண்ட 12 சதுரங்களின் மொத்த பரப்பளவை காண்க?', '1+2+3......+ P =171எனில் , 1^3+2^3+3^3 +.......+ P^3\n- இன் மதிப்பு காண்க?', '16^3+ 17^3+........+35^3 என்ற தொடரின் கூடுதலை காண்க?', '4/7 -இல் இருந்து எந்த எண்ணை கழித்தால் 1/8 கிடைக்கும் ?', 'பின்வரும்  தொடரின் கூடுதல் எவ்வளவு?\n51 + 52 + ......... 99 + 100', 'ஓர் எண்ணில் மூன்றில் ஒரு பங்கின் இரண்டில் ஒரு பங்கின் ஐந்தின் ஒரு பங்கு 15 எனில் அவ்வெண்ணை காண்க?', '1+2+3......+45 என்ற தொடரின் கூடுதலை காண்க?', '11 செ.மீ..,12 செ.மீ .., 13 செ.மீ.......24 செ.மீ, ஆகியவற்றை முறையே பக்க அளவுகளாக கொண்ட 14 சதுரங்களின் மொத்த பரப்பளவை காண்க?', 'ஒரு கார் 1 லிட்டர் பெட்ரோலில் 20 கி.மீ  ஓடுகிறது.அந்த கார்\n2 3/4 லிட்டர் பெட்ரோலில் கடக்கும் தூரம் எவ்வளவு?', '11^3+12^3+13^3......+28^3 என்ற தொடரின் கூடுதலை காண்க?', '31+33+.....+53 வரையுள்ள தொடரின் கூடுதலை காண்க?', 'ஒரு வாகன ஓட்டுனர் 3.2 மணி நேரத்தில் 135.04 கி.மீ தொலைவை கடக்கிறார். அவருடைய வேகத்தை கண்டுபிடி?', 'இரு விகிதமுறு எண்களின் பெருக்கற்பலன் 6 அவற்றுள் ஒரு எண் 14/3 எனில், மற்றொரு எண்ணை காண்க?', 'எந்த எண்ணுடன் 5/6-ஐ கூட்டினால் 49/30 கிடைக்கும்?', 'கீழ்க்கண்டவற்றில் பகா காரணிகளை காண்க?\n(i) 24 =2×3×4\n(ii) 54= 2×3×9\n(iii) 56= 7×2× 2×2\n(iv) 70 =2×5×7']

a = ['A) மாக்ஸ்முல்லர்', 'A)அ.முத்துலிங்கம்', 'A) பாரசீகம்', 'A) மேத்யூ அர்னால்டு', 'A)ஜைன சித்தாந்தங்கள்', 'A) பக்காத்தி',
     'A) ஜார்ஜ் அருண்டேல்', 'A) வில்லியம் ஜான் தாமஸ்', 'A) மாக்ஸ்முல்லர்', 'A)ரிப்பன் பிரபு', 'A) 1941', 'A)மா.பொ.சிவஞானம்', 'A) லால்பகதூர் சாஸ்திரி', 'A) அப்பர்', 'A)நகரியம்', 'A) பஞ்சாப் - பருத்தி', 'A) சோட்டா நாகபுரி பீடபூமி - கனிம வளங்கள்', 'A) அபெர் குரோம்பி', 'A) 2வது', 'A) மகர நாராயணி', 'A) ஜூன் 12', 'A) 1 மட்டும் சரி', 'A) ஆங்கிலேயர்கள்', 'A) 643', 'A) சுமார் 117 முதல் 120 வரை', 'A) அரசின் தலைவர்', 'A) மாண்டேகு செம்ஸ்போர்டு சீர்திருத்தம்', 'A) இந்திய அரசுச் சட்டம் 1909', 'A) இந்திய அரசுச் சட்டம் 1909', 'A) 1910', 'A) பம்பாய்', 'A) அன்னிபெசன்ட் அம்மையார்', 'A) முதல் உலகப்போர்', 'A) பிபின் சந்திர பால்', 'A) லக்னோ ஒப்பந்தம்', 'A) காமன்வீல்', 'A)இங்கிலாந்தின் கடினமான தருணம் இந்தியாவின் கடினமான தருணம்', 'A) பம்பாய்', 'A) அமெரிக்கா', 'A) மௌலானா முகமது அலி', 'A) துருக்கியின் சுல்தான் கலீபாவாக இடையூறின்றி தொடரவேண்டும்', 'A) மகாராஷ்டிரா', 'A)பிளேக்', 'A)ம.சிங்காரவேலர்', 'A) பசிபிக் பிரதேச இந்துஸ்தான்', 'A)புரட்சி', 'A) வண்ணநிலவன்', 'A) நற்றிணை', 'A) விவேகானந்தர்', 'A) முன் வேதகாலம்', 'A)1 மட்டும் சரி', 'A) அகநானூறு', 'A)1ம் 2ம் மட்டும்', 'A) திருக்குறளாளர் வீ.முனிசாமி', 'A) சர்.பிட்டி.தியாகராயர்', 'A) 1918', 'A)பக்தவச்சலம்', 'A) மா.போ.சிவஞானம்', 'A)நிலைக்காத தன்மை', 'A) யஜீர்', 'A) இராமச்சந்திர குஹா', 'A)இராமச்சந்திர குஹா', 'A) மாக்ஸ்முல்லர்', 'A) 1', 'A) ராமச்சந்திர குஹா', 'A) கோலாமி', 'A) குவாலியர் மன்னர் சிந்தியா', 'A) ஆகஸ்ட் 15, 1947', 'A) சர்தார் வல்லபாய் பட்டேல்', 'A)கர்நாடகா', 'A)பொட்டி ஸ்ரீராமுலு', 'A) ராஜமன்னார் குழு', 'A) 1947', 'A) 31 ஆகஸ்ட் 1946', 'A) மொழிவாரி எதிர்ப்பு ஆணையம்', 'A) அம்பிகா சரண் மஜூம்தார்', 'A) வெல்லெஸ்லி பிரபு', 'A) கிலாபத் இயக்கம்', 'A) சுதந்திர தடை சட்டம்', 'A) காங்கிரஸ் - லீக் ஒப்பந்தம்', 'A) 1911', 'A)இந்திய பாதுகாப்பு ஒழுங்குமுறைகள் சட்டம்', 'A) ரௌலட் சட்டம்', 'A) பிரெஞ்சுப் புரட்சி', 'A)கிலாபத் இயக்கம்', 'A)அயர்லாந்தின் தன்னாட்சி இயக்கம்', 'A) வாரணாசி', 'A) இந்தியாவின் விசுவாசத்தின் விலை இந்தியாவின் விடுதலை', 'A)பொதுமக்களுக்கு', 'A)சர்.எஸ்.மனோன்மணியம்', 'A) காந்தியடிகள்', 'A) இந்திய லீக்', 'A) வி.கே.கிருஷ்ணமேனன்', 'A)சூயஸ் கால்வாய் உடன்படிக்கை', 'A) 1916', 'A) முகமது அலி ஜின்னா', 'A)லோகாண்டே', 'A)அபுல் கலாம் ஆசாத்', 'A) ஆங்கிலேயர்களுக்கு எதிரான', 'A) கெய்சர்-இஹிந்த் தங்கப்பதக்கம்', 'A)காந்தியடிகள்', 'A) போல்ஷ்விக்', 'A) மதராஸ் தொழிற்சங்கம்', 'A) பிபின் சந்திரபால்', 'A) மா.பொ. சிவஞானம்', 'A) 1 மட்டும் சரி', 'A) 18', 'A) பௌத்த பிக்குகள்', 'A) 1மட்டும் தவறு', 'A)நீலகேசி', 'A) காப்பு', 'A) பாடல்', 'A) 1948 அக்டோபர் 30', 'A) 12', 'A) ஆன்மீக அடிப்படை', 'A) ஆன்மீக அடிப்படை', 'A)1 மட்டும்', 'A) சமத்துவம்', 'A) 2005', 'A) அமெரிக்கா', 'A) திராவிடர்', 'A) கர்நாடகா', 'A) 780', 'A) தேவநாகரி', 'A) இந்தி', 'A) பௌத்தம்', 'A)1 மட்டும் சரி', 'A)ஆங்கிலேயர்கள்', 'A) கானிங் பிரபு', 'A)கூற்றும் காரணமும் சரி; காரணம் சரியான விளக்கமே', 'A) 1 மட்டும் சரி', 'A) பிரிட்டிஷ் ஆட்சியில் இந்தியாவில் தன்னாட்சியை ஏற்படுத்துவது', 'A) பெல்காம்', 'A) 1மட்டும்', 'A) 1 மட்டும் சரி', 'A) 1937', 'A) ஆரிய சமாஜம்', 'A) சத்தியமூர்த்தி', 'A) 1956', 'A) 1,  நவம்பர்1956', 'A) ஜின்னா - திலகர்', 'A)கூற்றும் காரணமும் சரி மேலும் காரணம் கூற்றுக்கான சரியான விளக்கம் ஆகும்', 'A) தன்னாட்சி இயக்கத்தினர்', 'A)பத்திரிக்கைகள்(குற்றங்களுக்கு தூண்டும்) சட்டம் - 1908', 'A) 10', 'A)வெண்ணிப்போர்', 'A) சிந்தாமணி', 'A)கூற்றும் காரணமும் சரி; காரணம் சரியான விளக்கமே', 'A)1 மட்டும் சரி', 'A) உண்மை, வாய்மை, மெய்மை', 'A)அகத்தேவைகளின் வளர்ச்சி', 'A) 1 மட்டும் சரி', 'A) வாழ்வின் உறுதிப்பொருள்களை அறியச்செய்தல்', 'A) 23', 'A) சில சுதேச அரசுகள் இந்த முழங்கும் முறையை ஏற்றுக் கொள்ளவில்லை', 'A) ஜூனாகத் நவாப்', 'A) ரவி போன்ஸ்லே', 'A) 1920', 'A) பஞ்சாப்', 'A) 12', 'A)சாதிபிரிவினை', 'A) உப்பு சத்தியாகிரகம்', 'A)மிதவாத தேசியவாதிகள்', 'A) 1914 - 1918', 'A)ஆரிய சமாஜம்', 'A) நியூசிலாந்து', 'A) மின்டோ', 'A) 12 %', 'A) உள்ளூர் அரசு நியமித்த மூன்று ஆணையர்கள் அடங்கிய சிறப்பு தீர்ப்பாயங்களுக்கு', 'A)1 மட்டும் தவறு', 'A) நற்றிணை', 'A)சான்றோர்', 'A) ரிக்', 'A) பாலி,பிராமி', 'A) பண்பாடு', 'A) 20', 'A) 52', 'A) 10.25', 'A) 144', 'A) 4', 'A) 2', 'A) 9/2', 'A) 53', 'A) 3 /4', 'A) 1/5', 'A) 2722 செ.மீ^2', 'A) 27241', 'A) 362600', 'A) 25/56', 'A) 3577', 'A) 380', 'A) 1015', 'A) 4212 ச.செ.மீ', 'A) 25 கி.மீ', 'A) 141711', 'A) 308', 'A) 39.2 கி.மீ/மணி', 'A) 5/7', 'A) 1/5', 'A) i மற்றும் ii சரி']

b = ['B) ஈபி டெய்லர்', 'B) செ. வைத்தியலிங்கம்', 'B)கிரேக்கம்', 'B) சி.சி. நார்த்', 'B)ஆகம சித்தாந்தங்கள்', 'B) மரைக்காயர்',
     'B)அன்னிபெசன்ட் அம்மையார்', 'B)மேத்யூ அர்னால்டு', 'B)ஈ. பி.டெய்லர்', 'B) வெல்லெஸ்லி பிரபு', 'B) 1942', 'B) மறைமலை அடிகள்', 'B) நரேந்திர மோடி', 'B)மாணிக்கவாசகர்', 'B) நாகரியம்', 'B) மேற்கு வங்காளம் - நெல்', 'B) மாளவ பீடபூமி - பருப்புவகைகள்', 'B)ஜோசப் வெலிங்டன்', 'B)3வது', 'B)மகர சங்கராந்தி', 'B) மார்ச் 12', 'B) 2 மட்டும் சரி', 'B)டேனியர்கள்', 'B) 782', 'B)சுமார் 117 முதல் 127 வரை', 'B)அரசின் ஆட்சியாளர்', 'B)மின்டோ மார்லி சீர்திருத்தம்', 'B) இந்திய கவுன்சில் சட்டம் 1909', 'B) இந்திய கவுன்சில் சட்டம் 1909', 'B) 1911', 'B) பூனே', 'B) கிரண்பேடி அம்மையார்', 'B) முதல் உலக போரில் இந்தியாவின் பங்கெடுப்பு', 'B)அன்னிபெசன்ட் அம்மையார்', 'B) சூரத் ஒப்பந்தம்', 'B) யங் இந்தியா', 'B)இங்கிலாந்தின் கடினமான தருணம் இந்தியாவின் வாய்ப்புக்கான தருணம்', 'B) லாகூர்', 'B) பிரிட்டன்', 'B)மௌலானா சௌகத் அலி', 'B)இஸ்லாமிய புனித தலங்கள் சுல்தானிடம் ஒப்படைக்கப்பட்டு அவர் அதனை கட்டுப்படுத்த வேண்டும்', 'B)கல்கத்தா', 'B)காலரா', 'B) பி.பி.வாடியா', 'B) ஆப்பிரிக்க பிரதேச இந்துஸ்தான்', 'B)கிளர்ச்சி', 'B) கி.ராஜநாராயணன்', 'B)திருக்குறள்', 'B)இராமகிருஷ்ணர்', 'B)இடை வேதகாலம்', 'B)2 மட்டும் சரி', 'B) புறநானூறு', 'B) 2ம் 3ம் மட்டும்', 'B) பேராசிரியர் ச.வைத்தியலிங்கம்', 'B)தந்தை பெரியார்', 'B) 1921', 'B) அச்சுதமேனன்', 'B)மறைமலை அடிகள்', 'B)நெகிழும் தன்மை', 'B) அதர்வண', 'B) ராகுல சாங்கிருத்தியாயன்', 'B) ராகுல சாங்கிருத்தியாயன்', 'B) வின்டர் நீட்ஸ்', 'B) 22', 'B) சர்தார் வல்லபாய் பட்டேல்', 'B)பர்ஜி', 'B) பரோடா மகாராஜா கேக்வார்', 'B) ஆகஸ்ட் 15, 1948', 'B) அன்னிபெசன்ட் அம்மையார்', 'B) தமிழ்நாடு', 'B)அல்லையா சாரு', 'B) எஸ்.ஏ.டாங்கே குழு', 'B) 1945', 'B) 31 ஆகஸ்ட் 1947', 'B)மொழிவாரி மாகாணங்கள் ஆணையம்', 'B) லாலா ஹர்தயாள்', 'B)லிட்டன் பிரபு', 'B) லக்னோ சதித்திட்ட வழக்கு', 'B)பட்டய சட்டம்', 'B)காங்கிரஸ் - தன்னாட்சி இயக்கம் ஒப்பந்தம்', 'B) 1912', 'B)பிரிட்டிஷ் பாதுகாப்பு சட்டம்', 'B)மின்டோ-மார்லி சட்டம்', 'B) ரஷிய புரட்சி', 'B) ஃபேபியன் இயக்கம்', 'B) யக்னிக் இயக்கம்', 'B) பாட்னா', 'B) இந்தியாவின் விசுவாசத்தின் விலை இந்தியாவின் சுமை', 'B)மிதவாதிகளுக்கு', 'B)சர்.எஸ்.சுந்தரமூர்த்தி', 'B)நேரு', 'B) இந்தியா பிரிட்டிஷ் லீக்', 'B)வி.கே.அர்ஜுனமேனன்', 'B)செவ்ரஸ் உடன்படிக்கை', 'B) 1919', 'B)மௌலானா அபுல் கலாம் ஆசாத்', 'B)சசிபாத பானர்ஜி', 'B) காந்தி அடிகள்', 'B) இந்துக்களுக்கு எதிரான', 'B) ஜூலு போர் வெள்ளிப்பதக்கம்', 'B) ரவீந்திரநாத் தாகூர்', 'B)பூர்ஷ்விக் ', 'B) பாம்பே தொழிற்சங்கம் ', 'B) பாலகங்காதர திலகர்', 'B) மறைமலை அடிகளார்', 'B) 2 மட்டும் சரி', 'B) 11', 'B) சமண முனிவர்கள்', 'B) 2 மட்டும் சரி', 'B) குண்டலகேசி', 'B)அம்மானை', 'B)உண்மை', 'B) 1949 அக்டோபர் 30', 'B) 3', 'B) மனிதநேயம்', 'B)மனிதநேயம்', 'B) 2 மட்டும்', 'B) சகோதரத்துவம்', 'B) 2006', 'B) நேபாளம்', 'B)ஆரியர்', 'B)அஸ்ஸாம்', 'B) 880', 'B)பிராமி', 'B)சமஸ்கிருதம்', 'B) சமணம்', 'B) 2 மட்டும் சரி', 'B) ரோமானியர்கள்', 'B)ரிப்பன் பிரபு', 'B)கூற்றும் காரணமும் சரி; காரணம் சரியான விளக்கமல்ல', 'B) 2 மட்டும் சரி', 'B) தாய்நாடு பற்றிய பெருமை உணர்வை இந்திய மக்களிடையே ஏற்படுத்துவது', 'B) தானே', 'B)2 மட்டும்', 'B)2 மட்டும் சரி', 'B) 1938', 'B) திராவிட சமாஜம்', 'B) அச்சுதமேனன்', 'B) 1950', 'B) 30  நவம்பர்1956', 'B)திலகர் - அன்னிபெசன்ட்', 'B) கூற்றும் காரணமும் சரி ஆனால் காரணம் கூற்றுக்கான சரியான விளக்கமல்ல', 'B) மிதவாத காங்கிரசார்', 'B) வெடிபொருள்கள் சட்டம் - 1908', 'B) 20', 'B)தலைக்கோட்டை போர்', 'B)வளையாபதி', 'B)கூற்றும் காரணமும் சரி; காரணம் சரியான விளக்கமல்ல', 'B) 2 மட்டும் சரி', 'B)உண்மை, வாய்மை,தர்மம்', 'B)புறத் தேவைகளின் வளர்ச்சி', 'B) 2 மட்டும் சரி', 'B) வாழ்வியல் பொய்களை அறியச்செய்தல்', 'B) 33', 'B)சில சுதேச அரசுகள் இம்முறையை தங்களுக்கான மரியாதைக்குறைவாக கருதினர்', 'B)காஷ்மீர் அரசர்', 'B)காசிம் ரஸ்வி ', 'B) 1922', 'B)மகாராஷ்டிரம்', 'B) 15', 'B)மொழிவாரிதேசியவாதம்', 'B) ஒத்துழையாமை இயக்கம்', 'B) தீவிர தேசியவாதிகள்', 'B) 1915 - 1919', 'B)பிரார்த்தனை சமாஜம்', 'B)இங்கிலாந்து', 'B)மவுண்ட்பேட்டன் பிரபு', 'B) 20 %', 'B)ஆங்கிலேய அரசு நியமித்த 5 ஆணையர்கள் அடங்கிய சிறப்பு தீர்ப்பாயங்களுக்கு', 'B) 2 மட்டும் தவறு', 'B)திருக்குறள்', 'B)பெருஞ்செல்வர்', 'B)ஆசிவகம் ', 'B)பிராகிருதம், பிராமி', 'B)நாகரிகம்', 'B) 22', 'B) 58', 'B) 10.5', 'B) 200', 'B) 6', 'B) 4', 'B) 7/2', 'B) 63', 'B) 5 /4', 'B) 2/5', 'B) 3218 செ.மீ^2', 'B) 28341', 'B) 373500', 'B) 24/56', 'B) 3775', 'B) 450', 'B) 1025', 'B) 4313 ச.செ.மீ', 'B) 35 கி.மீ', 'B) 151611', 'B) 410', 'B) 40.2 கி.மீ/மணி', 'B) -6/7', 'B) 2/5', 'B) i மற்றும் iii சரி']

c = ['C)சிசி நார்த்', 'C) வ. செ. ஐ. ஜெயபாலன்', 'C) லத்தீன்', 'C) ஈ. பி.டெய்லர்', 'C)ஞான சித்தாந்தங்கள்', 'C)நாச்சி',
     'C) A.O.ஹீயூம்', 'C)வால்டேர்', 'C) சி.சி. நார்த்', 'C)காரன்வாலிஸ்', 'C) 1943', 'C) விருதுநகர் சங்கரலிங்கனார்', 'C) நரசிம்மராவ்', 'C)அறிஞர்அண்ணா', 'C)நகரம்', 'C)கேரளா - வாசனைப்பொருட்கள்', 'C) தக்காண பீடபூமி - எண்ணெய் வித்துக்கள்', 'C)சோபர்ஸ் ராய்', 'C)4வது', 'C) சிம்ம நாராயணி', 'C)நவம்பர் 14', 'C)இரண்டும் சரி', 'C)போர்த்துகீசியர்கள்', 'C) 565', 'C) சுமார் 110 முதல் 127 வரை', 'C) இளவரசர்கள்', 'C) ரவுலட் சட்டம்', 'C)இவையிரண்டும்', 'C)இவையிரண்டும்', 'C) 1912', 'C) லக்னோ', 'C)திலகர்', 'C)இவையிரண்டும்', 'C)லாலா லஜபதிராய்', 'C)பம்பாய் ஒப்பந்தம்', 'C)காமன் வெல்த்', 'C) இங்கிலாந்தின் வாய்ப்புக்கான தருணம் இந்தியாவின் வாய்ப்புக்கான தருணம்', 'C)லார்ட்ஸ்', 'C)ரஷ்யா', 'C)மௌலானா அபுல் கலாம் ஆசாத்', 'C) சுல்தானிடம் போதுமான பகுதிகள் தரப்பட்டு இசுலாமிய மதத்தை பாதுகாக்க வழிவகை செய்யப்பட வேண்டும்', 'C)உத்திரபிரதேசம்', 'C) போலியோ', 'C)சி.ஆர்.தாஸ்', 'C)அமெரிக்க பிரதேச இந்துஸ்தான்', 'C)தலையீடு', 'C)பேரா.எஸ்.வையாபுரியார்', 'C)புறநானூறு', 'C)வள்ளலார்', 'C)பின் வேதகாலம்', 'C)இரண்டும் சரி', 'C) குறுந்தொகை', 'C) 3ம் 4ம் மட்டும்', 'C) பேராசிரியர் க.அன்பழகன்', 'C)மறைமலை அடிகள்', 'C) 1920', 'C) ஏ.கே.கோபாலன்', 'C)விருதுநகர் சங்கரலிங்கனார்', 'C)நடைமுறை வாழ்விற்கு பயன்படுதல்', 'C) சாமம்', 'C)ஏ.எல்.பாஷம்', 'C) ஏ.எல்.பாஷம்', 'C) டாக்டர்.வின்சென்ட் ஆர்தர் ஸ்மித்', 'C) 15', 'C) ஜவஹர்லால் நேரு', 'C) மால்தோ', 'C)பாட்னா மகாராஜா', 'C) ஆகஸ்ட் 14, 1947', 'C) கிருஷ்ணம்மாள் ஜகன்னாதன்', 'C)ஆந்திரப் பிரதேசம்', 'C) அல்லூரி சீதாராமையா', 'C) பசல் அலி குழு', 'C) 1952', 'C) 31 ஆகஸ்ட் 1945', 'C) ஜெ.வி.பி ஆணையம்', 'C) மௌலானா முகமது அலி', 'C)கர்சன் பிரபு', 'C) கராச்சி சதித்திட்ட வழக்கு', 'C)இரட்டை ஆட்சிமுறை சட்டம்', 'C) காங்கிரஸ் - லீக் - தன்னாட்சி ஒப்பந்தம்', 'C) 1914', 'C) ஆங்கில அரசு பாதுகாப்பு ஒழுங்குமுறை சட்டம்', 'C)1935 சட்டம்', 'C)இவை இரண்டும்', 'C)யக்னிக் இயக்கம்', 'C) ஃபேபியன் சோஷலிசவாதிகள் இயக்கம்', 'C)லக்னோ', 'C) இந்திய விடுதலையின் விலை இந்தியாவின் விசுவாசம்', 'C) மாணவர்களுக்கு', 'C)சர்.எஸ்.சுந்தரலிங்கம்', 'C)வல்லபாய் பட்டேல்', 'C) இந்தியா காமன்வெல்த் லீக்', 'C) வி.கே.அச்சுதமேனன்', 'C) கிலாபத் உடன்படிக்கை', 'C) 1931', 'C)M.A.அன்சாரி, ஷேக் சௌகத் அலி சித்திக்', 'C)கெயில் மினால்டின்', 'C)சர்தார் வல்லபாய் பட்டேல்', 'C)கம்யூனிஸ்டுகளுக்கு எதிரான', 'C) போயர் போர் வெள்ளிப்பதக்கம்', 'C)பக்கிம் சந்திர சாட்டர்ஜி', 'C)சீனப்புரட்சி', 'C)இந்திய தொழிற்சங்கம்', 'C) லாலா லஜபதிராய்', 'C)குன்றக்குடி அடிகளார்', 'C) இரண்டும் சரி', 'C) 12', 'C)இந்து துறவிகள்', 'C) 3 மட்டும் தவறு', 'C)வளையாபதி', 'C) சிலம்பு', 'C) புறம்பேசாமை', 'C) 1948 டிசம்பர் 10', 'C) 14', 'C)சகிப்புத்தன்மையும் நல்லிணக்கமும்', 'C)சகிப்புத்தன்மையும் நல்லிணக்கமும்', 'C) 3 மட்டும்', 'C)A & B', 'C) 2007', 'C) இங்கிலாந்து', 'C) இரானிய இனம்', 'C) திரிபுரா', 'C) 980', 'C)பிராகிருதம்', 'C) அசாமி', 'C) சீக்கிய மதம்', 'C) இரண்டும் சரி', 'C) கிரேக்கத்தினர்', 'C)லிட்டன் பிரபு', 'C) கூற்று சரி;காரணம் தவறு', 'C) 3 மட்டும் சரி', 'C)காலனி ஆதிக்க அவலத்தை இந்தியர்களிடையே பரப்புவது', 'C) தாராவி', 'C)A & B', 'C) 3 மட்டும் தவறு', 'C) 1939', 'C)தட்சிணப்பிரதேசம்', 'C) ஏ.கே.கோபாலன்', 'C) 1953', 'C) 1  நவம்பர்1955', 'C)லாலா ஹர்தயாள் & ஜின்னா', 'C)கூற்று சரி காரணம் தவறு', 'C)புரட்சிகர தேசியவாதிகள்', 'C)இந்திய பத்திரிக்கைகள் சட்டம் - 1908', 'C) 30', 'C)பாரதப்போர்', 'C)சிலப்பதிகாரம்', 'C) கூற்று சரி;காரணம் தவறு', 'C)இரண்டும் சரி', 'C)உண்மை, தர்மம், மெய்மை', 'C) A & B', 'C) இரண்டும் சரி', 'C) சரியான நெறிமுறைகளைப் பின்பற்ற செய்தல்', 'C) 43', 'C)சில சுதேச அரசுகளின் ஆட்சி மாறின. ஆனால் தங்களது அரச பட்டங்களையும் ஓய்வூதியத்தையும் பயன்படுத்தினர்.', 'C)ஐதராபாத் நிஜாம்', 'C)முகமது கான்', 'C) 1925', 'C)குஜராத்', 'C) 18', 'C)வர்க்கப் போராட்டம்', 'C)வெள்ளையனே வெளியேறு இயக்கம்', 'C) முஸ்லிம் லீக்', 'C) 1914 - 1919', 'C)பக்தி சமாஜம்', 'C)அயர்லாந்து', 'C)மாண்டேகு ', 'C) 25 %', 'C) உள்ளூர் அரசு நியமித்த 5 ஆணையர்கள் அடங்கிய சிறப்பு தீர்ப்பாயங்களுக்கு', 'C) 3 மட்டும் சரி', 'C)புறநானூறு', 'C)ஒழுக்கம் உடையோர்', 'C)யஜுர்', 'C)பாலி, பிராகிருதம்', 'C)இவையிரண்டும்', 'C) 29', 'C) 62', 'C) 11.5', 'C) 240', 'C) 8', 'C) 6', 'C) 5/2', 'C) 77', 'C) 7/4', 'C) 3/5', 'C) 3576 செ.மீ^2', 'C) 29241', 'C) 382500', 'C) 22/58', 'C) 3757', 'C) 480', 'C) 1035', 'C) 4414 ச.செ.மீ', 'C) 45 கி.மீ', 'C) 161811', 'C) 504', 'C) 41.2 கி.மீ/மணி', 'C) 8/7', 'C) 3/5', 'C) ii மற்றும் iii சரி']

d = ['D) ரூத் பெனிடிக்ட்', 'D)தோப்பில் முகமது மீரான்', 'D) பிரெஞ்சு', 'D) ஜி.ஈ. ட்ரெவெலியான்', 'D) பிரப சித்தாந்தங்கள்',
     'D) பண்ணத்தி', 'D) துவாரகாதாஸ்', 'D)ரூத் பெனிடிக்ட்', 'D) ரூத் பெனிடிக்ட்', 'D) டல்ஹவுசி பிரபு', 'D) 1944', 'D)திரு.வி.கல்யாணசுந்தரம்', 'D) ஜவஹர்லால் நேரு', 'D)திருமூலர்', 'D)ஊர்', 'D) மத்திய பிரதேசம் - பருப்பு வகைகள்', 'D) ஏதுமில்லை', 'D)சாம் ஆண்டர்சன்', 'D)1வது', 'D)சிம்ம சங்கராந்தி', 'D)ஜனவரி 12', 'D)இரண்டும் தவறு', 'D) பிரெஞ்சுக்காரர்கள்', 'D) 243', 'D) சுமார் 110 முதல் 125 வரை', 'D) இவர் அனைவரும்', 'D) ஏதுமில்லை', 'D)ஏதுமில்லை', 'D)ஏதுமில்லை', 'D) 1913', 'D) சூரத்', 'D)யாரும் இல்லை', 'D) ஏதுமில்லை', 'D) திலகர்', 'D) தானே ஒப்பந்தம்', 'D) யங் சொசைட்டி', 'D)இங்கிலாந்தின் வாய்ப்புக்கான தருணம் இந்தியாவின் கடினமான தருணம்', 'D) பிரிஸ்பேன்', 'D)ஜெர்மனி', 'D) M.A.அன்சாரி', 'D)உலக முஸ்லிம்களின் தலைவராக துருக்கியின் சுல்தான் செயல்படவேண்டும்', 'D)டெல்லி', 'D)இன்ஃப்ளூயன்சா', 'D)இவர் அனைவரும்', 'D) அனைத்துலக இந்துஸ்தான்', 'D) தன்னாட்சி', 'D) திருக்குறளாளர் வி. முனிசாமி', 'D) கலித்தொகை', 'D)இராமானுஜர்', 'D)நவீன வேதகாலம்', 'D)இரண்டும் தவறு', 'D) கலித்தொகை', 'D) அனைத்தும்', 'D) பேராசிரியர் சு.சக்திவேல்', 'D) சங்கரலிங்கனார்', 'D) 1923', 'D)பெரியார்', 'D)திரு.வி.கல்யாணசுந்தரம்', 'D) அனுபவ அறிவு', 'D) ரிக்', 'D)ஹெரோடோட்டஸ்', 'D)ஹெரோடோட்டஸ்', 'D) ராமச்சந்திர குகா', 'D) 22', 'D)மகாத்மா காந்தி', 'D) முண்டா', 'D) ஜம்மு காஷ்மீர் மகாராஜா', 'D) ஆகஸ்ட் 14, 1948', 'D) முத்துலட்சுமி அம்மையார்', 'D) மகாராஷ்டிரம்', 'D)மல்லூரி ஜோத்பாய்', 'D) ஜே.வி.பி குழு', 'D) 1956', 'D) 31 ஆகஸ்ட் 1948', 'D)தர் ஆணையம்', 'D) மௌலானா சவுகத் அலி', 'D)காரன்வாலிஸ் பிரபு', 'D) லாகூர் சதித்திட்ட வழக்கு', 'D) ரவுலட் சட்டம்', 'D)ஏதும் இல்லை', 'D) 1916', 'D)பிரிட்டிஷ் பாதுகாப்பு ஒழுங்குமுறை சட்டம்', 'D)இவற்றுள் எதுவுமில்லை', 'D)ஏதுமில்லை', 'D)தன்னாட்சி இயக்கம்', 'D) குடும்பக்கட்டுப்பாட்டு இயக்கம்', 'D) பூனே', 'D) இந்திய விடுதலையின் விலை இந்தியாவின் விசுவாசத்தின் சம்பளம்', 'D)அரசு அதிகாரிகளுக்கு', 'D) சர்.எஸ்.சுப்ரமணியம்', 'D)திலகர்', 'D) ஏதுமில்லை', 'D) வி.கே.கோபாலகிருஷ்ணன்', 'D)ஏதுமில்லை', 'D) 1921', 'D)சையது அதுல்லா ஷா புகாரி', 'D)சர்வான் சந்திரபால்', 'D) ஜவஹர்லால் நேரு', 'D)நிலப்பிரபுக்களுக்கு எதிரான', 'D)இவை அனைத்தையும்', 'D) அன்னிபெசன்ட் அம்மையார்', 'D) பிரஞ்சு புரட்சி', 'D) பொதுவுடைமை தொழிற்சங்கம்', 'D)காந்தியடிகள்', 'D)தேவநேயபாவாணர்', 'D)இரண்டும் தவறு', 'D) 14', 'D)வேதகால ஞானிகள்', 'D)அனைத்தும் தவறு', 'D) மணிமேகலை ', 'D) தத்தை', 'D)பழமொழி', 'D)1949 டிசம்பர் 10', 'D) 51', 'D)வர்ணாசிரம முறை', 'D) மதச்சார்பின்மை', 'D) ஏதுமில்லை', 'D)ஏதுமில்லை', 'D) 2008', 'D) இத்தாலி ', 'D) மங்கோலிய இனம்', 'D) தமிழ்நாடு', 'D) 1080', 'D)பாலி - பிராமி', 'D)ஒடியா', 'D) கன்பூசியஸ் மதம்', 'D)இரண்டும் தவறு', 'D) பாபிலோனியர்கள்', 'D)மவுண்ட்பேட்டன் பிரபு', 'D)கூற்று காரணம் இரண்டும் தவறு', 'D)அனைத்தும் தவறு', 'D) ஏதுமில்லை', 'D)பூனா', 'D)ஏதும் இல்லை', 'D)அனைத்தும் சரி', 'D) 1940', 'D) ஏதுமில்லை', 'D) பெரியார்', 'D) 1955', 'D) 30 நவம்பர்  1955', 'D) லாலா ஹர்தயாள் & திலகர்', 'D) கூற்றும் காரணமும் தவறு', 'D)இவர் அனைவரும்', 'D)தேசத்துரோக கூட்டங்கள் தடுப்புச் சட்டம் - 1911', 'D) 40', 'D)வில்லிபாரதப்போர்', 'D) குண்டலகேசி ', 'D)கூற்று காரணம் இரண்டும் தவறு', 'D)இரண்டும் தவறு', 'D)தர்மம், வாய்மை, மெய்மை', 'D)ஏதுமில்லை', 'D)இரண்டும் தவறு', 'D) இயற்கையோடு இணைந்து வாழ செய்தல்', 'D) 55', 'D) தவறானது ஏதுமில்லை', 'D)இவர் அனைவரும்', 'D)சாத்வி சட்டர்ஜி', 'D) 1927', 'D)டெல்லி', 'D) 22', 'D)இவை அனைத்தும்', 'D) இவை அனைத்தும்', 'D)இவை அனைத்தும்', 'D) 1916 - 1918', 'D) பிரம்ம ஞான சபை', 'D)பாரிஸ்', 'D)பெர்கின்சன்', 'D) 30 %', 'D)ஆங்கிலேய அரசு நியமித்த 3 ஆணையர்கள் அடங்கிய சிறப்பு  தீர்ப்பாயங்களுக்கு', 'D) அனைத்தும் சரி', 'D)கலித்தொகை', 'D) மாசற்ற காட்சிகளை உடையோர்', 'D)சாமம்', 'D) பிராகிருதம், சமஸ்கிருதம்', 'D) ஏதுமில்லை', 'D) 45', 'D) 68', 'D) 19.5', 'D) 256', 'D) 10', 'D) 8', 'D) 3/2', 'D) 87', 'D) 9/4', 'D) 4/5', 'D) 3818 செ.மீ^2', 'D) 29441', 'D) 291500', 'D) 20/57', 'D) 3570', 'D) 520', 'D) 1045', 'D) 4515 ச.செ.மீ', 'D) 55 கி.மீ', 'D) 171911', 'D) 525', 'D) 42.2 கி.மீ/மணி', 'D) 9/7', 'D) 4/5', 'D) iii மற்றும் iv சரி']

correct_answer = ['A) மாக்ஸ்முல்லர்', 'B) செ. வைத்தியலிங்கம்', 'C) லத்தீன்', 'D) ஜி.ஈ. ட்ரெவெலியான்', 'B)ஆகம சித்தாந்தங்கள்',
                  'D) பண்ணத்தி', 'B)அன்னிபெசன்ட் அம்மையார்', 'A) வில்லியம் ஜான் தாமஸ்', 'B)ஈ. பி.டெய்லர்', 'B) வெல்லெஸ்லி பிரபு', 'D) 1944', 'A)மா.பொ.சிவஞானம்', 'D) ஜவஹர்லால் நேரு', 'D)திருமூலர்', 'C)நகரம்', 'A) பஞ்சாப் - பருத்தி', 'B) மாளவ பீடபூமி - பருப்புவகைகள்', 'A) அபெர் குரோம்பி', 'C)4வது', 'B)மகர சங்கராந்தி', 'D)ஜனவரி 12', 'B) 2 மட்டும் சரி', 'B)டேனியர்கள்', 'C) 565', 'A) சுமார் 117 முதல் 120 வரை', 'D) இவர் அனைவரும்', 'B)மின்டோ மார்லி சீர்திருத்தம்', 'C)இவையிரண்டும்', 'D)முஸ்லிம்கள்', 'D) 1913', 'C) லக்னோ', 'A) அன்னிபெசன்ட் அம்மையார்', 'C)இவையிரண்டும்', 'D) திலகர்', 'A) லக்னோ ஒப்பந்தம்', 'A) காமன்வீல்', 'B)இங்கிலாந்தின் கடினமான தருணம் இந்தியாவின் வாய்ப்புக்கான தருணம்', 'A) பம்பாய்', 'C)ரஷ்யா', 'A) மௌலானா முகமது அலி', 'D)உலக முஸ்லிம்களின் தலைவராக துருக்கியின் சுல்தான் செயல்படவேண்டும்', 'C)உத்திரபிரதேசம்', 'D)இன்ஃப்ளூயன்சா', 'B) பி.பி.வாடியா', 'A) பசிபிக் பிரதேச இந்துஸ்தான்', 'B)கிளர்ச்சி', 'C)பேரா.எஸ்.வையாபுரியார்', 'D) கலித்தொகை', 'A) விவேகானந்தர்', 'C)பின் வேதகாலம்', 'B)2 மட்டும் சரி', 'A) அகநானூறு', 'B) 2ம் 3ம் மட்டும்', 'D) பேராசிரியர் சு.சக்திவேல்', 'A) சர்.பிட்டி.தியாகராயர்', 'C) 1920', 'A)பக்தவச்சலம்', 'C)விருதுநகர் சங்கரலிங்கனார்', 'A)நிலைக்காத தன்மை', 'D) ரிக்', 'C)ஏ.எல்.பாஷம்', 'D)ஹெரோடோட்டஸ்', 'C) டாக்டர்.வின்சென்ட் ஆர்தர் ஸ்மித்', 'D) 22', 'C) ஜவஹர்லால் நேரு', 'C) மால்தோ', 'C)பாட்னா மகாராஜா', 'A) ஆகஸ்ட் 15, 1947', 'B) அன்னிபெசன்ட் அம்மையார்', 'C)ஆந்திரப் பிரதேசம்', 'A)பொட்டி ஸ்ரீராமுலு', 'C) பசல் அலி குழு', 'B) 1945', 'A) 31 ஆகஸ்ட் 1946', 'B)மொழிவாரி மாகாணங்கள் ஆணையம்', 'A) அம்பிகா சரண் மஜூம்தார்', 'C)கர்சன் பிரபு', 'D) லாகூர் சதித்திட்ட வழக்கு', 'D) ரவுலட் சட்டம்', 'A) காங்கிரஸ் - லீக் ஒப்பந்தம்', 'C) 1914', 'A)இந்திய பாதுகாப்பு ஒழுங்குமுறைகள் சட்டம்', 'A) ரௌலட் சட்டம்', 'B) ரஷிய புரட்சி', 'A)கிலாபத் இயக்கம்', 'B) யக்னிக் இயக்கம்', 'A) வாரணாசி', 'A) இந்தியாவின் விசுவாசத்தின் விலை இந்தியாவின் விடுதலை', 'C) மாணவர்களுக்கு', 'D) சர்.எஸ்.சுப்ரமணியம்', 'A) காந்தியடிகள்', 'C) இந்தியா காமன்வெல்த் லீக்', 'A) வி.கே.கிருஷ்ணமேனன்', 'B)செவ்ரஸ் உடன்படிக்கை', 'B) 1919', 'A) முகமது அலி ஜின்னா', 'C)கெயில் மினால்டின்', 'B) காந்தி அடிகள்', 'D)நிலப்பிரபுக்களுக்கு எதிரான', 'D)இவை அனைத்தையும்', 'A)காந்தியடிகள்', 'A) போல்ஷ்விக்', 'A) மதராஸ் தொழிற்சங்கம்', 'C) லாலா லஜபதிராய்', 'D)தேவநேயபாவாணர்', 'C) இரண்டும் சரி', 'B) 11', 'B) சமண முனிவர்கள்', 'D)அனைத்தும் தவறு', 'D) மணிமேகலை', 'B)அம்மானை', 'D)பழமொழி', 'C) 1948 டிசம்பர் 10', 'B) 3', 'D)வர்ணாசிரம முறை', 'A) ஆன்மீக அடிப்படை', 'D) ஏதுமில்லை', 'B) சகோதரத்துவம்', 'D) 2008', 'D) இத்தாலி', 'D) மங்கோலிய இனம்', 'D) தமிழ்நாடு', 'A) 780', 'A) தேவநாகரி', 'C) அசாமி', 'D) கன்பூசியஸ் மதம்', 'D)இரண்டும் தவறு', 'C) கிரேக்கத்தினர்', 'C)லிட்டன் பிரபு', 'A)கூற்றும் காரணமும் சரி; காரணம் சரியான விளக்கமே', 'D)அனைத்தும் தவறு', 'C)காலனி ஆதிக்க அவலத்தை இந்தியர்களிடையே பரப்புவது', 'A) பெல்காம்', 'C)A & B', 'C) 3 மட்டும் தவறு', 'C) 1939', 'C)தட்சிணப்பிரதேசம்', 'D) பெரியார்', 'D) 1955', 'A) 1, நவம்பர்1956', 'B)திலகர் - அன்னிபெசன்ட்', 'A)கூற்றும் காரணமும் சரி மேலும் காரணம் கூற்றுக்கான சரியான விளக்கம் ஆகும்', 'C)புரட்சிகர தேசியவாதிகள்', 'C)இந்திய பத்திரிக்கைகள் சட்டம் - 1908', 'A) 10', 'C)பாரதப்போர்', 'C)சிலப்பதிகாரம்', 'D)கூற்று காரணம் இரண்டும் தவறு', 'C)இரண்டும் சரி', 'A) உண்மை, வாய்மை, மெய்மை', 'B)புறத் தேவைகளின் வளர்ச்சி', 'D)இரண்டும் தவறு', 'B) வாழ்வியல் பொய்களை அறியச்செய்தல்', 'B) 33', 'D) தவறானது ஏதுமில்லை', 'D)இவர் அனைவரும்', 'B)காசிம் ரஸ்வி', 'D) 1927', 'C)குஜராத்', 'A) 12', 'D)இவை அனைத்தும்', 'B) ஒத்துழையாமை இயக்கம்', 'C) முஸ்லிம் லீக்', 'D) 1916 - 1918', 'D) பிரம்ம ஞான சபை', 'C)அயர்லாந்து', 'C)மாண்டேகு', 'C) 25 %', 'A) உள்ளூர் அரசு நியமித்த மூன்று ஆணையர்கள் அடங்கிய சிறப்பு தீர்ப்பாயங்களுக்கு', 'D) அனைத்தும் சரி', 'B)திருக்குறள்', 'B)பெருஞ்செல்வர்', 'B)ஆசிவகம்', 'C)பாலி, பிராகிருதம்', 'A) பண்பாடு', 'A) 20', 'D) 68', 'B) 10.5', 'C) 240', 'B) 6', 'A) 2', 'D) 3/2', 'C) 77', 'C) 7/4', 'D) 4/5', 'D) 3818 செ.மீ^2', 'C) 29241', 'C) 382500', 'A) 25/56', 'B) 3775', 'B) 450', 'C) 1035', 'D) 4515 ச.செ.மீ', 'D) 55 கி.மீ', 'C) 161811', 'C) 504', 'D) 42.2 கி.மீ/மணி', 'D) 9/7', 'D) 4/5', 'D) iii மற்றும் iv சரி']


report15 = pandas.read_csv('report15.csv')


@app.route("/", methods=["GET", "POST"])
def home():
    warning = request.args.get("warn")

    if current_user.is_authenticated:
        completed = Test15.query.filter_by(examinee_id=current_user.user_id).first()

        if request.args.get("fee"):
            name = request.args.get("name")
            bending = request.args.get("bending")
            logged_in = request.args.get("logged_in")

            return render_template("index.html", fee=True, name=name, bending=bending, logged_in=logged_in,
                                   completed=completed)

        else:
            if completed:
                completed = Test15.query.filter_by(examinee_id=current_user.user_id).first()
                return render_template("index.html", warning=warning, completed=completed)

            else:
                return render_template("index.html", warning=warning)

    else:
        return render_template("index.html", warning=warning)


@app.route("/register", methods=['GET', 'POST'])
def register():
    form = RegisterForm()
    errors = []

    if form.validate_on_submit():
        hash_and_salted_password = generate_password_hash(
            request.form.get('password'),
            method='pbkdf2:sha256',
            salt_length=8
        )

        new_user = User(
            email=request.form.get('email'),
            username=request.form.get('name'),
            password=hash_and_salted_password,
        )

        if User.query.filter_by(email=request.form.get('email').lower()).first():
            return redirect(url_for('login', msg="You've already been registered. Please Login!"))

        elif User.query.filter_by(username=request.form.get('name')).first():
            errors.append('The username has already been taken')
            return render_template("register.html", errors=errors, form=form)

        else:
            errors.clear()

            if request.form.get('email') in verified_emails:

                db.session.add(new_user)
                db.session.commit()

                login_user(new_user)

                # redirect to the home page with fee details.
                return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                        bending=student_mails[request.form.get('email')][1]))

            else:
                return redirect(url_for('home', warn="You are not authorised to use this website."))

    return render_template("register.html", form=form)


@app.route("/login", methods=['GET', 'POST'])
def login():
    form = LoginForm()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        password = request.form.get('password')

        # Find user by email entered.
        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, password):
            login_user(user)
            errors.clear()

            # checking the user's payment details
            # redirect to the home page with fee details.
            return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                    bending=student_mails[request.form.get('email')][1]))

        else:
            errors.append('Incorrect Password! Try Again')
            return render_template("login.html", errors=errors, form=form)

    msg = request.args.get("msg")
    return render_template("login.html", form=form, errors=errors, msg=msg)


@app.route("/exam", methods=["GET", "POST"])
def exam():
    global attended
    test_no = request.args.get("test_no")
    opentime = exam_sites[request.args.get("test_no")][0]
    closetime = exam_sites[request.args.get("test_no")][1]

    if test_no == "15":
        attended = Test15.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "16":
        attended = Test16.query.filter_by(examinee_id=current_user.user_id).first()

    if attended is None:
        return render_template("exam.html", opentime=json.dumps(opentime), closetime=json.dumps(closetime),
                               sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d, correct_answer=correct_answer,
                               answers=[], test_no=test_no)
    else:
        return redirect(url_for("home", warn="You have already committed this exam. Check the results instead."))


@app.route('/evaluate', methods=["GET", "POST"])
def evaluate():

    global new_examinee
    answers = []
    final_result = []
    marks = 0

    for i in range(0, 200):
        user_answer = request.form[f'answers{i}']

        if user_answer is None:
            answers.append("None")

        else:
            answers.append(user_answer)

    for j in range(len(correct_answer)):

        if answers[j] == correct_answer[j]:
            marks += 1
            final_result.append("Correct")

        else:
            final_result.append("Wrong")

    # return f"{final_result, answers, correct_answer}"

    st_answers = '#||#'.join(answers)
    f_result = "#||#".join(final_result)

    actual_time = datetime.datetime.now()
    s_time = actual_time.strftime('%Y-%m-%d %H:%M:%S.%f')

    new_examinee = Test16(
        test_author=current_user,
        user_answers=st_answers,
        marks=marks,
        final_result=f_result,
        date=s_time[:-7],
        examinee_name=current_user.username
    )

    db.session.add(new_examinee)
    db.session.commit()

    return redirect(url_for('home', warn="You have successfully completed the exam. Click results to see results."))


@app.route("/result", methods=["GET", "POST"])
def result():
    test_no = request.args.get("test_no")

    if test_no == "15":
        attended_student = Test15.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

        return render_template("results.html", answers=answers, marks=marks, sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d,
                               correct_answer=correct_answer, final_result=final_result, time=time)

    elif test_no == "16":
        attended_student = Test16.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

        return render_template("results.html", answers=answers, marks=marks, sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d,
                               correct_answer=correct_answer, final_result=final_result, time=time)


@app.route("/dashboard")
def dashboard():
    all_record = Test16.query.all()

    return render_template("dashboard.html", all_record=all_record)


@app.route("/change_details", methods=["GET", "POST"])
def change_password():
    form = ChangeDetails()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        old_password = request.form.get('old_password')
        new_password = request.form.get('new_password')

        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, old_password):

            if User.query.filter_by(email=email).first():
                old = User.query.filter_by(email=email).first()
                pass_to_update = User.query.get(old.user_id)

                hash_and_salted_password = generate_password_hash(
                    new_password,
                    method='pbkdf2:sha256',
                    salt_length=8
                )

                pass_to_update.password = hash_and_salted_password

                db.session.commit()

                logout_user()
                return redirect(url_for('login', msg="Your password has been changed successfully. "
                                                     "Please Login with your new password."))

        else:
            errors.append("Please check your password.")
            return render_template("change_details.html", form=form, errors=errors)

    return render_template("change_details.html", form=form, errors=errors)


@app.route('/logout')
@login_required
def logout():
    logout_user()
    return redirect(url_for('home'))


@app.route("/admission", methods=["GET", "POST"])
def new_admission():
    form = AdmissionForm()

    if form.validate_on_submit():
        new_member = Admission(
            name=form.name.data,
            mobile_number=form.number.data,
            email=form.email.data,
        )

        db.session.add(new_member)
        db.session.commit()

        verification_code = random.randint(2000, 10000)

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=request.form.get('email'),
                                msg=f"Subject:WELCOME TO SENA CAREER INSTITUTE\n\nWelcome {request.form.get('name')}!"
                                    f" Happy to see you with us. Thanks for supporting us! Keep rocking! "
                                    f"Here is our Educators' number: 8610642720".encode('utf-8'))

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=MY_EMAIL,
                                msg=f"Subject:NEW ADMISSION\n\n{request.form.get('name')} has made an "
                                    f"admission sign up on Sena site Here is details {request.form.get('name')},"
                                    f" {request.form.get('number')}, {request.form.get('email')}!")

        return redirect(url_for('home'))

    return render_template("register.html", form=form, admission=True)


if __name__ == '__main__':
    app.run(debug=True)
