import datetime
import random
import smtplib
import pandas
from flask import Flask, render_template, redirect, url_for, flash, request, abort
from flask_bootstrap import Bootstrap
from flask_ckeditor import CKEditor
from werkzeug.security import generate_password_hash, check_password_hash
from flask_sqlalchemy import SQLAlchemy
from flask_login import UserMixin, login_user, LoginManager, login_required, current_user, logout_user
from flask_wtf import FlaskForm
from sqlalchemy.orm import relationship
from wtforms import StringField, SubmitField, PasswordField
from wtforms.fields.html5 import EmailField
from wtforms.validators import DataRequired
from functools import wraps
import os
import json

app = Flask(__name__)
app.config['SECRET_KEY'] = os.environ.get("SECRET_KEY")
ckeditor = CKEditor(app)
Bootstrap(app)

app.config['SQLALCHEMY_DATABASE_URI'] = os.environ.get("DATABASE_URL", "sqlite:///sena-base.db")
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
db = SQLAlchemy(app)

admin = False
login_manager = LoginManager()
login_manager.init_app(app)

MY_EMAIL = os.environ.get("MY_EMAIL")
SENA_EMAIL = 'sivagangainagarajan@gmail.com'
MY_PASSWORD = os.environ.get("MY_PASSWORD")


@login_manager.user_loader
def load_user(user_id):
    return User.query.get(int(user_id))


def admin_only(f):
    @wraps(f)
    def decorated_function(*args, **kwargs):
        # If id is not 1 then return abort with 403 error
        if current_user.user_id != 1:
            return abort(403)
        # Otherwise continue with the route function
        return f(*args, **kwargs)

    return decorated_function


class User(UserMixin, db.Model):
    __tablename__ = "User"
    user_id = db.Column(db.Integer, primary_key=True)
    email = db.Column(db.String(100), unique=True)
    password = db.Column(db.String(100))
    username = db.Column(db.String(100))
    # test = relationship("Test15", back_populates="test_author")
    # test16 = relationship("Test16", back_populates="test_author")
    # test17 = relationship("Test17", back_populates="test_author")
    # test18 = relationship("Test18", back_populates="test_author")
    # test19 = relationship("Test19", back_populates="test_author")
    test20 = relationship("Test20", back_populates="test_author")
    test21 = relationship("Test21", back_populates="test_author")
    test22 = relationship("Test22", back_populates="test_author")
    test23 = relationship("Test23", back_populates="test_author")

    def get_id(self):
        return self.user_id


# class Test15(db.Model):
#     __tablename__ = "Test_15"
#     user_id = db.Column(db.Integer, primary_key=True)
#     examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
#     test_author = relationship("User", back_populates="test")
#     marks = db.Column(db.Integer)
#     user_answers = db.Column(db.String())
#     final_result = db.Column(db.String())
#     date = db.Column(db.String(250), nullable=False)


# class Test16(db.Model):
#     __tablename__ = "Test_16"
#     user_id = db.Column(db.Integer, primary_key=True)
#     examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
#     test_author = relationship("User", back_populates="test16")
#     marks = db.Column(db.Integer)
#     examinee_name = db.Column(db.String())
#     user_answers = db.Column(db.String())
#     final_result = db.Column(db.String())
#     date = db.Column(db.String(250), nullable=False)


# class Test17(db.Model):
#     __tablename__ = "Test_17"
#     user_id = db.Column(db.Integer, primary_key=True)
#     examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
#     test_author = relationship("User", back_populates="test17")
#     marks = db.Column(db.Integer)
#     examinee_name = db.Column(db.String())
#     user_answers = db.Column(db.String())
#     final_result = db.Column(db.String())
#     date = db.Column(db.String(250), nullable=False)


# class Test18(db.Model):
#     __tablename__ = "Test_18"
#     user_id = db.Column(db.Integer, primary_key=True)
#     examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
#     test_author = relationship("User", back_populates="test18")
#     marks = db.Column(db.Integer)
#     examinee_name = db.Column(db.String())
#     user_answers = db.Column(db.String())
#     final_result = db.Column(db.String())
#     date = db.Column(db.String(250), nullable=False)


# class Test19(db.Model):
#     __tablename__ = "Test_19"
#     user_id = db.Column(db.Integer, primary_key=True)
#     examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
#     test_author = relationship("User", back_populates="test19")
#     marks = db.Column(db.Integer)
#     examinee_name = db.Column(db.String())
#     user_answers = db.Column(db.String())
#     final_result = db.Column(db.String())
#     date = db.Column(db.String(250), nullable=False)


class Test20(db.Model):
    __tablename__ = "Test_20"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test20")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test21(db.Model):
    __tablename__ = "Test_21"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test21")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test22(db.Model):
    __tablename__ = "Test_22"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test22")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test23(db.Model):
    __tablename__ = "Test_23"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test23")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Admission(db.Model):
    __tablename__ = "New_Admission"
    user_id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(100))
    mobile_number = db.Column(db.Integer)
    email = db.Column(db.String(100), unique=True)


db.create_all()
db.session.commit()


class RegisterForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Register')


class LoginForm(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Login')


class AdmissionForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    number = StringField("Phone*", validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    submit = SubmitField('Submit')


class ChangeDetails(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    old_password = PasswordField('Old Password*', validators=[DataRequired()])
    new_password = PasswordField('New Password*', validators=[DataRequired()])
    submit = SubmitField('Submit')


student_mails = {
    "mgopalakrish''075@gmail.com": ["Gopal", 2000],
    "nivir6558@gmail.com": ["Nivetha", 7000],
    "jaya26jj@gmail.com": ["Christy", 5000],
    "srjamuna1003@gmail.com": ["jamuna", 7000],
    "satheshpandian1997@gmail.com": ["Satheshpandian", 4000],
    "lakshmiraja412@gmail.com": ["Rajalaskhmi", 5000],
    "tamilarasanbe9597@gmail.com": ["Anitha", 1000],
    "rajeshkan''6341@gmail.com": ["Rajesh kan''", 3000],
    "jaishreeramgp@gmail.com": ["Yogapriya", 3000],
    "irudhayasubiksha2001@gmail.com": ["Subiksha", 0],
    "abinayaabi257@gmail.com": ["Abi", 1000],
    "shanthirasu1991@gmail.com": ["Shanthi", 0],
    "pradee1296@gmail.com": ["Pradeepa", 5000],
    "jeniferj0204@gmail.com": ["Janifer", 7000],
    "krish47457@gmail.com": ["Krishna", 0],
    "naveenaryan440@gmail.com": ["Naveen", 0],
    "veerasurya250899@gmail.com": ["Suriya", 3000],
    "amin2svg@gmail.com": ["Amin", 3000],
    "jjprincy06@gmail.com": ["Jeba Josepin Princy", 0],
    "jancybetsia20@gmail.com": ["Jancy", 0],
    "cottonpanju9@gmail.com": ["Panju", 2000],
    "rameswariv1999@gmail.com": ["Rameshwari", 2000],
    "vimaladharmar2002@gmail.com": ["Vimala", 1000],
    "devahi1993@gmail.com": ["Devahi", 0],
    "sarojiniganesan96@gmail.com": ["Sarojini", 0],
    "gangadha91@gmail.com": ["Gangadharan", 0],
    "krish''nk498@gmail.com": ["Kamatchi", 0],
    "indhuindhumathi141@gmail.com": ["Indhumathi", 4000],
    "jamespurysh@gmail.com": ["Purushothaman", 0],
    "sivagangainagarajan@gmail.com": ["Nagarajan", 0],
    "matheshsethu22@gmail.com": ["Mathesh", 4000],
    "nagarajnkarthika@gmail.com": ["Karthika", 2000],
    "keviraj482@gmail.com": ["Yogesh", 2000],
    "christyjeslina98@gmail.com": ["Christy", 3500],
    "valarmathi9415@gmail.com": ["Valarmathi", 2000],
    "mohanpothumponnuk2001@gmail.com": ["Mohan", 7000],
    "sobanasobana377@gmail.com": ["Sobana", 7000],
}

verified_emails = [mail.strip() for mail in student_mails.keys()]

exam_sites = {

    "15": ["June 14, 2021 10:00:00", "June 14, 2021 13:30:00"],
    "16": ["June 21, 2021 10:00:00", "June 21, 2021 13:30:00"],
    "17": ["June 28, 2021 10:00:00", "June 28, 2021 22:30:00"],
    "18": ["July 05, 2021 10:00:00", "July 05, 2021 13:30:00"],
    "19": ["July 12, 2021 10:00:00", "July 12, 2021 13:30:00"],
    "20": ["July 19, 2021 10:00:00", "July 19, 2021 14:00:00"],
    "21": ["July 26, 2021 10:00:00", "July 26, 2021 14:00:00"],
    "22": ["August 02, 2021 13:00:00", "August 02, 2021 19:00:00"],
    "23": ["August 09, 2021 07:00:00", "August 09, 2021 14:00:00"],

}

sl_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
         31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58,
         59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
         87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
         112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133,
         134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
         156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177,
         178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200]

ques = ['தமிழ் மறுமலர்ச்சி செயல்பாடுகளுக்கு அடியுரமாய் விளங்கிய வகைகளை தேர்க:\r\n1. அச்சு இயந்திரத்தின் அறிமுகம்\r\n'
        '2. திராவிட மொழிகளின் மீது மேற்கொள்ளப்பட்ட மொழியியல் ஆய்வுகள்\r\n3. தமிழில் எழுதப்பட்ட பக்தி இலக்கியங்களின் வளர்ச்சி\r\n'
        '4. தமிழை ஆதரித்த சமண சமயத்தின் எழுச்சி\r\n',
        'அச்சு இயந்திரத்தின் வருகைக்குப் பின்னர் வந்த தொடக்க ஆண்டுகளில் _________ சார்ந்த நூல்களை வெளியிடும் முயற்சிகளே பெருமளவில் மேற்கொள்ளப்பட்டன.\r\n', 'ஐரோப்பிய மொழிகள் தவிர்த்து அச்சில் ஏறிய மொழிகளில் முதல் மொழி _________ மொழியாகும்\n\n', 'மிக முன்னதாக 1578இல் தம்பிரான் வணக்கம் எனும் தமிழ் புத்தகம் எங்கு வெளியிடப்பட்டது?\r\n', '1709-இல் முழுமையான அச்சகம் யாரால் தரங்கம்பாடியில் நிறுவப்பட்டது?\r\n', 'தொடக்க காலத் தமிழ் இலக்கிய நூல்களில் ஒன்றான திருக்குறள் முதன்முதலில் அச்சிடப்பட்டு வெளியானது எப்போது?\n', 'பத்தொன்பதாம் நூற்றாண்டில் தமிழ் அறிஞரான சி.வை.தாமோதரனார் பனை ஓலைகளில் கையால் எழுத பெற்றிருந்த பல தமிழ் இலக்கண, இலக்கிய நூல்களை பதிப்பித்தார். அவற்றில் சேராதது எது?\r\n\r\n', 'தமிழறிஞர் மீனாட்சி சுந்தரனாரின் மாணவரான உ.வே.சாமிநாதர், வெளியிட்ட செவ்வியல் தமிழ் இலக்கிய நூல்களில் சேராதது எது?\r\n', 'தென்னிந்திய மொழிகள் தனிப்பட்ட மொழிக்குடும்பத்தைச் சார்ந்தவை, அவை இந்தோ-ஆரிய குடும்ப மொழிகளோடு தொடர்பில்லாதவை எனும் கோட்பாட்டை முதன் முதலில் உருவாக்கியவர் யார்?\r\n', ' F.W.எல்லிஸ் புனித ஜார்ஜ் கோட்டையில் எவ்வாண்டு கல்லூரியை நிறுவினார்?\r\n', 'எல்லிஸ் அவர்களின் கோட்பாட்டை 1856இல் கால்டுவெல் தனது எந்நூலில் விரிவுபடுத்தினார்?\n\n', 'பின்வரும் கூற்றுக்களை ஆராய்க:\r\n1. பத்தொன்பதாம் நூற்றாண்டைச் சேர்ந்த அறிவார்ந்த தமிழர்கள் தமிழ்/திராவிட/சமத்துவம் மற்றும் சமஸ்கிருதம்/ஆரியம்/பிராமணியம் ஆகிய இரண்டுக்கும் இடையே உள்ள அடிப்படை வேறுபாடுகளை அடையாளம் கண்டுகொண்டனர்.\r\n2. அவர்கள் தமிழ் மொழியே திராவிடர்களின் மொழி என்றும் தமிழர்கள் பிராமணர்கள் அல்ல என்றும் அவர்களின் சமூக வாழ்வில் சாதிகள் இல்லை, பாலின் வேறுபாடில்லை, சமத்துவம் நிலவியது என வாதிட்டனர்.\r\n3. இச்சிந்தனைகள் பி.சுந்தரனார் ஆல் எழுதப்பெற்ற நூற்றொகை விளக்கம் என்னும் நாடக நூலில் இடம் பெற்றுள்ள தமிழ் மொழி வாழ்த்து பாடலில் மெய்ப்பிக்கப்பட்டுள்ளது\r\n', 'பின்வரும் கூற்றுகளில் ஒன்று மட்டும் சரியான வாக்கியம் அது என்ன\n', 'தமிழ் மொழி ஒரு செம்மொழி என்றும், எனவே சென்னை பல்கலைக்கழகம் தமிழை ஒரு வட்டார மொழி என அழைக்கக்கூடாது என முதன் முதலாக வாதாடியவர் யார்?\r\n', 'தமிழின் மீது சமஸ்கிருதம் கொண்டு இருந்த செல்வாக்கை அடையாளம் கண்டதால் வி. கோ.சூரியநாராயண சாஸ்திரி தமது பெயரை எவ்வாறு மாற்றிக் கொண்டார்?\n', 'தமிழ் மொழி இயல் தூய்மை வாதத்தின் தந்தை என அழைக்கப்படுபவர் யார்?\n\n', 'தனித்தமிழ் இயக்கத்தை (தூய தமிழ் இயக்கம்) உருவாக்கியவர் என கருதப்படுபவர் யார்?\r\n', ' பின்வருபவர்களில் மறைமலை அடிகளாரின் ஆசிரியர் யார்?\r\n', 'மறைமலை அடிகளார் பின்வரும் எந்தெந்த சங்க இலக்கிய நூல்களுக்கு விளக்கவுரை எழுதியுள்ளார்?\r\n', 'மறைமலை அடிகளார், தான் இளைஞராக இருந்தபோது எப்பத்திரிகையில் பணிபுரிந்தார்?\r\n', 'மறைமலை அடிகளார், தமிழாசிரியராக பல ஆண்டுகள் பணிபுரிந்த கல்லூரி எது?\r\n', 'மறைமலை அடிகளார் பற்று கொண்டிருந்த இயக்கம்?\n', 'தனித்தமிழ் இயக்கம் தொடங்கப்பட்டது எப்போது?\r\n', 'மறைமலை அடிகள் மற்றும் தனித்தமிழ் இயக்கத்தை பற்றிய கூற்றுகளில் ஒன்று மட்டும் தவறு. அது எது?\r\n', '_______ என்ற தனது பெயரை, மறைமலை அடிகளார் தூய தமிழில் மறைமலை அடிகள் என மாற்றிக் கொண்டார்.\r\n', 'மறைமலை அடிகள் உடைய ஞானசாகரம் என்ற பத்திரிகை எவ்வாறு பெயர் மாற்றம் செய்யப்பட்டது?\r\n', 'மறைமலையடிகள் உடைய சமரச சன்மார்க்க சங்கம் எனும் நிறுவனம் எவ்வாறு பெயர் மாற்றம் செய்யப்பட்டது?\r\n', 'தமிழ் சொற்களுக்குள் புகுந்துவிட்ட சமஸ்கிரத சொற்களுக்கு இணையான பொருள் தரக்கூடிய தமிழ் சொற்கள் அடங்கிய அகராதி ஒன்றை தொகுத்தவர் யார்?\r\n', '1867இல் சீவக சிந்தாமணி 1898இல் மணிமேகலை ஆகிய இரண்டும் முழுமையாக அச்சிடப்பட்டு வெளியிடப்பட்ட பின்னணியில் மிக முக்கியமான ஆளுமையாக இருந்தவர் யார்?\r\n\r\n', 'அயோத்திதாசரின் இயற்பெயர் என்ன?\r\n', 'பண்டித அயோத்திதாசர் ஆற்றிய சமூக பணிகளில் சேராதது எது??\r\n\r\n', 'பண்டித அயோத்திதாசர் இன் வாழ்நாள் காலம் என்ன??\r\n', 'அயோத்திதாசர் பிறந்த ஊர்?\r\n', 'அயோத்திதாசர் புலமை பெற்ற மொழிகளில் சேராதது எது??\r\n', 'அயோத்திதாசர் பற்றிய கூற்றுகளில் தவறானது தேர்ந்தெடுக்க\r\n', 'ஒடுக்கப்பட்டோரின் கோவில் நுழைவுக்கு ஆதரவாக குரல் எழுப்புவதற்காக பண்டிதர் அயோத்திதாசர் நிறுவிய அமைப்பு எது?\r\n\r\n', ' திராவிட கழகம் என்னும் அமைப்பை 1882ல் நிறுவியவர் யார்?\r\n\r\n', 'அயோத்திதாசர் திராவிட பாண்டியன் என்னும் இதழைத் தொடங்கி ஆண்டு எது?\r\n', 'அயோத்திதாசர் திராவிட மகாஜன சபை எந்த ஆண்டு\r\nநிறுவினார்??\r\n\r\n', 'திராவிட மகாஜன சபையின் முதல் மாநாடு நடைபெற்ற இடம் எது??\r\n\r\n', '1907இல் அயோத்திதாசர் தொடங்கிய வாராந்திர பத்திரிக்கை எது??\r\n\r\n', 'அயோத்திதாசர் இலங்கை சென்று பௌத்தத்தைத் தழுவிய ஆண்டு என்ன??\n\n', 'பவுத்த மதத்தின் வழியே பகுத்தறிவின் அடிப்படையிலான சமத்துவத்தை கட்டமைப்பதற்கான அயோத்திதாசர் ______ என்னும் அமைப்பை நிறுவினார்??\r\n\r\n', 'அயோத்திதாசர் சாக்கிய பௌத்த சங்கத்தை எங்கு நிறுவினார்??\r\n\r\n\r\n', 'அயோத்திதாசர் யாரை உண்மையான பௌத்தர்கள் என வாதிட்டார்?\r\n', ' மக்கள் தொகை கணக்கெடுப்பின்போது ஒடுக்கப்பட்டவர்கள் எவ்வாறு பதிவு செய்யுமாறு வற்புறுத்தினார்?\r\n', 'அயோத்திதாசரின் கொள்கைகளை -------- தமிழகம் பகுதிகள் அதிக எண்ணிக்கையில் மக்கள் பின்பற்றினர்\r\n', 'அயோத்திதாசரின் கொள்கைகள் சார்ந்த இயக்கத்தில் முக்கிய பங்கு வகித்தது சேராதவர்?\n\n', 'ஒரு பைசா தமிழன் பின்னர் பெயரில் வெளிவந்தது?\r\n', 'சித்த மருத்துவ ஆராய்ச்சிக்கான தேசிய மையம் அயோத்திதாசரின் பெயரால் அமைக்கப்பட வேண்டும் என முயற்சி செய்தவர் யார்?\r\n', ' யார் கடும் போராட்டங்களை நடத்திய பின் பிரதமர் மன்மோகன் சிங் அவர்களால் செப்டம்பர் 3 2005 அன்று தேசிய சித்த மருத்துவ ஆராய்ச்சி மையம் அயோத்திதாசரின் பெயரால் தொடங்கப்பட்டது?\r\n', 'அயோத்திதாசப் பண்டிதரின் படைப்புகள் எப்போதும் நாட்டுடைமை ஆக்கப்பட்டன?\n', 'அயோத்திதாசர்க்கு இந்திய அரசால் அஞ்சல் தலை வெளியிடப்பட்டது எப்போது?\n', 'ரெட்டைமலை சீனிவாசன் 1859 ஆம் ஆண்டு எங்கு பிறந்தார்?\r\n', 'தாத்தா இரட்டைமலை சீனிவாசனின் தன்னலமற்ற சேவைக்காக அவருக்கு வழங்கப்பட்ட பட்டம் எது?\r\n', 'இரட்டைமலை சீனிவாசன் அங்கு வழங்கப்பட்ட பட்டங்கள் மற்றும் ஆண்டுகளில் தவறான இணை எது?\r\n', 'இரட்டைமலை சீனிவாசனின் சுயசரிதை நூல் எது?\r\n', 'இரட்டைமலை சீனிவாசனின் சுயசரிதை நூல் வெளியிடப்பட்ட ஆண்டு என்ன?\r\n', 'இரட்டை மலை ஸ்ரீனிவாசன் ஆதிதிராவிட மகாஜன சபை எனும் அமைப்பை உருவாக்கிய ஆண்டு என்ன?\r\n', 'பின்வருவனவற்றுள் ரெட்டைமலை சீனிவாசன் பற்றிய கூற்றுகளை தவறாக கொடுக்கப்பட்டுள்ளது எது?\r\n\r\n', ' ரெட்டைமலை சீனிவாசன் சென்னை மாகாண சட்டசபை உறுப்பினராக தேர்ந்தெடுக்கப்பட்ட ஆண்டு என்ன?\r\n', 'பின்வருவனவற்றில் ரெட்டைமலை சீனிவாசன் கலந்து கொண்ட மாநாடு எது?\r\n', 'சென்னை மாகாணத்தில் ஒடுக்கப்பட்ட வகுப்பில் இருந்து சட்ட மேலவைக்கு தேர்ந்தெடுக்கப்பட்ட முதல் உறுப்பினர் யார்?\r\n', 'எம்சி ராஜா சென்னை மாகாண சட்ட மேலவை உறுப்பினராக பணியாற்றிய காலம் என்ன?\r\n', 'எம்சி ராஜா சென்னை சட்டசபையில் நீதிக்கட்சியில் ------ஆக செயல்பட்டார்?\r\n\r\n', 'எம்சி ராஜா ஒடுக்கப்பட்டவர்கள் ஐ அழைக்க எந்த வார்த்தையை பயன்படுத்த பரிந்துரைத்தார்?\r\n\r\n', 'எம்சி ராஜா 1928-ல் உருவாக்கிய அமைப்பு எது?\r\n', ' தொடக்கத்தில் தனித் தேர்தல் தொகுதி வேண்டும் எனக் கூறிய என் சி ராஜா இதற்குப் பின்னர் அன் நிலைப்பாட்டினை மாற்றிக்கொண்டு கூட்டுத் தொகுதி முறையை ஆதரித்தார்?\r\n', 'ராமலிங்க சுவாமிகள் அல்லது இராமலிங்க அடிகள் எவ்வாறு பிரபலமாக அறியப்பட்டார்?\r\n', 'ராமலிங்க அடிகளின் வாழ்நாள் காலம் என்ன?\r\n', 'ராமலிங்க அடிகளார் சிதம்பரத்திற்கு அருகே ----- ஊரில் பிறந்தார்?\r\n', 'தந்தையாரின் மறைவுக்குப் பின்னர் ராமலிங்க அடிகளின் குடும்பம் ----- எங்கிருந்து அவருடைய சகோதரரின் இல்லத்திற்கு குடிபெயர்ந்தது?\r\n', 'இராமலிங்க அடிகளைப் பற்றிய பின்வரும் கூற்றுகளில் சரியானது எது?\r\n\r\n', 'வள்ளலார் சமரச வேத சன்மார்க்க சங்கம் எனும் அமைப்பை நிறுவிய ஆண்டு என்ன?\r\n', 'சமரச வேத சன்மார்க்க சங்கம் பின்னாளில் எவ்வாறு பெயர் மாற்றம் செய்யப்பட்டது?\n', 'அயோத்திதாசரின் இயற்பெயர்', 'மதராஸ் நேடிவ் அசோசியேஷன் தொடங்கப்பட்ட வருடம்', 'மதராஸ் நேடிவ் அசோசியேஷன் யாரால் தொடங்கப்பட்டது?', 'சென்னை மாகாணம் எப்போது ஒருங்கிணைக்கப்பட்டது ?', 'மதராஸ் மாகாணத்தில் சீர்திருத்த இயக்கங்களுக்கான தொடக்கம் எது?', 'திராவிடம் என்னும் வார்த்தை எதை குறிக்கிறது ?', '“திராவிடன்” என்ற வார்த்தையை அறிஞர்களால் எதற்கு பயன்படுத்தப்பட்டது?', '‘தென்னிந்திய மொழிகளின் ஒப்பிலக்கணம்’ நூலை இயற்றியவர்', 'இந்திய கலாச்சாரம் ஒரே மாதிரியான தன்மையை கொண்டதல்ல என்பது யாரால் எடுத்து சொல்லப்பட்டது?', 'ஜேம்ஸ் பிரின்சிபே இந்திய கலாச்சாரம்\u200c பற்றி ஆராய்ச்சி நடத்திய வருடம்', 'எல்லிஸ் தென்னிந்திய மொழி ஆராய்ச்சி நடத்திய வருடம்', 'திருக்குறள் முதல் முறையாக அச்சுப் பதிப்பில் மீட்டுருவாக்கம் செய்யப்பட்டது எப்போது?', 'மெஸ்டன் தீர்ப்பு', 'பிராமணர்கள் சதவீதத்தை உறுதிப்படுத்திய கணக்கெடுப்பு நிகழ்த்தப்பட்ட வருடம்', '1913-ல் புள்ளியியல் விவரத்தை அளித்த செயற்குழு உறுப்பினர்', 'அயோத்திதாசர் டோலர் இன மக்களை ஒன்றிணைத்து ஆதிசங்கரரின் கோட்பாடுகள் கொண்டு உருவாக்கிய சங்கம்', 'பஞ்சம சிறுவர்களுக்கான பள்ளி முதன்முதலில் யாரால் தொடங்கப்பட்டது?', 'சாக்கிய புத்த சங்கம் நிறுவப்பட்ட ஆண்டு', 'ஆத்வைத சங்கம் நிறுவப்பட்ட ஆண்டு', 'அயோத்திதாசரின் வாரப் பத்திரிகை', 'பஞ்சமர் மகாஜன சபை நிறுவப்பட்ட ஆண்டு', 'அயோத்திதாசரால் தொடங்கப்பட்ட திராவிடர் கழகம் நிறுவப்பட்ட ஆண்டு', 'அயோத்திதாசர் யாருடன் இணைந்து திராவிட பாண்டியன் இதழை தொடங்கினார்?', 'பிராமணர் அல்லத சங்கம் யாரால் தொடங்கப்பட்டது?', 'நான்-பிராமின் அசோசியேஷன் தொடங்கப்பட்ட ஆண்டு', 'மதராஸ் ஐக்கிய உருவாக்கப்பட்ட ஆண்டு', 'மதராஸ் ஐக்கிய கழகம் யாரால் தொடங்கப்பட்டது', 'மதராஸ் ஐக்கிய கழகம், மதராஸ் திராவிடச் சங்கமாக பெயர் மாற்றம் பெற்றது எப்போது?', '‘ திராவிட இல்லம்’ என்ற விடுதி எந்த வருடத்தில் இருந்து நடத்தப்பட்டது?', 'கடலடி தந்தி', 'தென்னிந்திய விடுதலை கூட்டமைப்பு தொடங்கப்பட்ட வருடம்', 'நீதிக்கட்சியின் ஆங்கிலப் பத்திரிகை', 'நீதிக்கட்சியின் ஆங்கிலப் பத்திரிக்கை தொடங்கப்பட்ட வருடம்', 'மாண்டேகு செம்ஸ்போர்டு சீர்திருத்தச் சட்டம் உருவாக்கப்பட்ட வருடம்', '1901-1911 வரை மதராஸ் பல்கலைக்கழகத்தில் பட்டம் பெற்றவர்களில் பெரும்பான்மையானோர் எந்த சமூக பிரிவை சேர்ந்தவர்கள்', '1919 சட்டம் எவ்வகையான ஆட்சி முறையை அறிமுகப்படுத்தியது', 'சுதந்திரம் அடையாத இந்தியாவில் முதல் ஜனநாயகத் தேர்தல் எந்த வருடம் நடத்தப்பட்டது?', '1920 தேர்தலில் பங்கு பெறாத கட்சி', 'காங்கிரஸ் முதல் தேர்தலில் பங்கு பெறுவதற்கான காரணம் என்ன?', 'தன்னாட்சி இயக்கம் தொடங்கப்பட்ட ஆண்டு', 'செப்டம்பர் 1916 தன்னாட்சி இயக்கத்தை வழிநடத்தியவர்', 'நீதிக்கட்சி தொடர்ச்சியாக அதிகாரத்தில் இருந்ததாக கருதப்படும் வருடங்கள்', 'பெரியார் காங்கிரஸில் இருந்து விலகி சுயமரியாதை இயக்கத்தை தோற்றுவித்த ஆண்டு', 'நீதிக்கட்சியின் தலைவராக பெரியார் எப்பொழுது நியமிக்கப்பட்டார்', 'நீதிக் கட்சியை திராவிடர் கழகமாக யாருடைய தலைமையில் பெயர் மாற்றப்பட்டது?', 'நீதிக்கட்சி திராவிடர் கழகமாக பெயர் மாற்றம் பெற்றது எப்போது?', 'முதல் இந்தி எதிர்ப்புப் போராட்டம்', 'பிராமணரல்லாதோர் அறிக்கை எந்த இயக்கத்தின் கொள்கை கோட்பாடு கருதப்படும்', 'பிராமணரல்லாதோர் அறிக்கை வெளியிடப்பட்ட ஆண்டு', 'பிரதிநிதிகள் நிரப்பப்பட வேண்டிய 98 இடங்களில் நீதிக்கட்சி எத்தனை இடங்களை பிடித்து ஆட்சி அமைத்தது?', '1920இல் நீதிக்கட்சியின் ஆட்சியில் முதல் முதல்வராக பதவியேற்றவர்', '1926ல் சுயேட்சை வேட்பாளராக களம் கண்டு முதல்வராக பதவி ஏற்றவர் யார்?', '1937 ல் நீதிக் கட்சியின் சார்பாக கடைசி முதல்வராக பணியாற்றியவர்', 'மதராஸ் நகர திட்ட சட்டம்', 'சென்னை பஞ்சாயத்து சட்டம்', 'முதல்முறையாக வகுப்புவாரி இட ஒதுக்கீட்டுக்கு தீர்மானமும் பெண்களுக்கான வாக்குரிமை தீர்மானமும் முன்வைக்கப்பட்ட ஆண்டு', 'இந்தியாவிலேயே முதல்முறையாக மதிய உணவு திட்டம் யாருடைய ஆட்சியில் நிறைவேற்றப்பட்டது?', 'மதிய உணவுத்திட்டம் நீதிக்கட்சியின் சார்பில் நிறைவேற்றப்பட்ட ஆண்டு', 'மதிய உணவு திட்டம் முதல் முதலில் எந்தப் பள்ளியில் நிறைவேற்றப்பட்டது?', 'இந்து அறநிலையத்துறை சட்டத்திற்கான தீர்மானம் முன்வைக்கப் பட்ட ஆண்டு', 'பெண்களுக்கான வாக்குரிமை எப்போது வழங்கப்பட்டது?', 'முதல் பெண் சட்ட மேலவை உறுப்பினராக நியமிக்கப்பட்டவர்', 'முதல் சட்ட மேலவை துணைத் தலைவராக நியமிக்கப்பட்ட பெண்', 'நேரடித் தேர்தலின் மூலம் 1937 ல் வெற்றி பெற்று சட்டப்பேரவை உறுப்பினர் பொறுப்பில் அமர்ந்த முதல் பெண்', 'முத்துலட்சுமி அவர்களின் முன்னெடுப்பு காரணமாக தேவதாசி ஒழிப்புச் சட்டம் நிறைவேற்றப்பட்டது எந்த ஆண்டு?', 'மதராஸ் மாகாணத்தின் பொதுப் பணியாளர் தேர்வாணையம் அமைக்கப்பட்ட ஆண்டு', 'ஆந்திரா பல்கலைக்கழகம்', 'எந்த குழுவினரின் பரிந்துரையின் பேரில் அண்ணாமலை பல்கலைக்கழகம் தொடங்கப்பட்டது?', 'அண்ணாமலைப் பல்கலைக்கழகம்', 'சாதிவாரி இட ஒதுக்கீட்டின் தந்தை என்று அழைக்கப்படுபவர்', 'சாதிவாரி இட ஒதுக்கீடு முறையாக அறிமுகப்படுத்தப்பட்ட ஆண்டு', 'அனைவருக்கும் கல்விச் சட்டம்', 'எந்த தலைவரின் முன்னெடுப்பில் இந்தியாவிலேயே முதல்முறையாக ஒடுக்கப்பட்ட மாணவர்களுக்கான விடுதி வசதி அமைக்கப்பட்டது?', 'பள்ளர்\u200c, பறையர் என்ற பெயர்கள் நீதிக்கட்சியின் முன்னெடுப்பின் காரணமாக இவ்வாறாக அரசு கோப்புகளில் இயற்றப்பட்டன?', 'திராவிடர் விடுதி நிர்மாணிக்கப்பட்ட ஆண்டு', 'மிஸ் இந்தியா 2020 வென்றவர் யார்? எந்த மாநிலம்சார்ந்தவர்?', 'மத்திய அரசானது CBI அமைப்பின் இடைக்கால இயக்குனராக __________என்பவரை நியமித்துள்ளது', 'வாழ்வாதார எளிமையாக்கல் குறியீடு-2020ல் மில்லியன்+ பிரிவில் சிறப்பாக செயல்பட்டு கொண்ட நகரமாக ________ நகரம் உருவெடுத்தது', 'வாழ்வாதார எளிமையாக்கல் குறியீடு-2020 ல் மில்லியனுக்கு குறைவான மக்கள் உள்ள பிரிவில்________ நகரம் முதலிடத்தை பிடித்துள்ளது', 'இந்திய ரயில்வேயின்___________ நடமாடும் ரயில் ரேடியோ தகவல் (MTRC) முறையை அறிமுகப்படுத்தியுள்ளது', 'எந்த நாடுஉலகின் முதலாவது வாத்தலகி சரணாலயத்தில் திறக்க உள்ளது', 'எந்த ஊரில் மூன்றாம் உலகத் திருக்குறள் மாநாடு நடத்தப்பட்டது', 'ஐக்கிய நாடுகள் அமைப்பான எந்த வருடத்தை சர்வதேசப் சிறுதானிய ஆண்டாக ஒருமனதாக அறிவித்துள்ளது', 'DRDO ஆல் உருவாக்கப்பட்ட திட எரிபொருள் குழாய் ராம்ஜெத் தொழில்நுட்பம்(. Solid Fuel Ducted Ramjet Technology) எந்த எரிபொருளினால் இயங்குகிறது', 'இந்தியாவின் மற்றும் ஆசியாவின் முதலாவது தேசிய ஓங்கில் ஆராய்ச்சி மையமானது எந்தப் பல்கலைக் கழக வளாகத்தில் கங்கைக்கரையில் அமைய இருக்கின்றது', 'உலகில் உள்ள நான்கு நன்னீர் டால்பின் இனங்களில்\n1. கங்கை நதி\n2.யாங்சேநதி\n3. சிந்து நதி\n\n', 'ஒரு ஓவரில் 6சிக்ஸர் அடித்த மூன்றாவது மட்டை பந்து வீரர்', '2021ம் ஆண்டுநடத்தப்பட்ட கோல்டன் குளோப் விருது எத்தனையாவது விருது விழா', 'NADMP ன் என்பதன் முழு வடிவம் என்ன', 'இந்திய கடல்சார் துறையை சீரமைக்கும் நோக்குடன் சமீபத்தில் வெளியிட்ட உத்தி இது', 'அரோமா திட்டத்தின் ஒரு பகுதியாக ஜம்முவில் பயிரிடப்படுகிற மூலிகை எது?', 'பன்னாட்டு பெண்கள் நாள் கொண்டாடப்படுகிற தேதிஎது', 'பின்வரும் எந்த உச்சிமாநாட்டில் சாகர் மந்தன் வணிக கடல்சார் தனம் விழிப்புணர்வு மையம் தொடங்கப்பட்டது', 'கீழ்க்காணும் எந்த PSLVஐ பயன்படுத்தி “சிந்து நேத்ரா” என்ற செயற்கைக் கோள் அண்மையில் வெற்றிகரமாக ஏவப்பட்டது', 'பாலைவனக்கொடி( DESERT FLAG) என்னும்பன்னாட்டளவிலானபயிற்சியை நடத்தும் நாடு எது', 'ஒரு பொருளில் நேர் மின்னோட்டம் தோன்றுவதற்கு காரணம்', 'சீப்பினால் தலை முடியை கோதுவதால்', 'மின் விசைக்கோடுகள் நேர் மின்னோட்டத்தில்______,\n எதிர் மின்னோட்டம்__________.\n', 'ஒரு மின்னூட்டதிற்கு அருகில் மின்னழுத்தம் என்பது ஓர்லகு நேர் மின்னூட்டம் ஒன்றை அதன் அருகில் கொண்டு வர செய்யப்படும்_____ அளவாகும்', 'மின்னோட்டத்தின் வெப்ப விளைவு _______ என அழைக்கப்படும்', 'மின்முலாம் பூசுதல் எதற்கு எடுத்துக்காட்டு', 'ஒரு கம்பியின் மின்தடை எதை பொறுத்து அமையும்', 'இந்தியாவின் மாறு மின்னோட்டத்தின் அதிர்வெண்', 'பொருத்துக\n1. மின்னூட்டம்–  அ)ஓம்\n2. மின்னழுத்த வேறுபாடு – ஆ)ஆம்பியர் \n3. மின்புலம் – இ) கூலும் \n4. மின்தடை – ஈ)நியூட்டன் கூடும்-1\n5. மின்னோட்டம் -உ)வோல்ட்\n', 'சரியா தவறா\n1. மின்னியல் நடுநிலை என்பது சுழி மின்னூட்டம் அல்லது சமமான அளவு நேர் மற்றும் எதிர் மின்னூட்டம் உள்ளதைக் குறிக்கும்.\n2. ஒரு மின்சுற்றில் அம்மீட்டர் பக்க இணைப்பில் இணைக்கப்படும்\n3.ஒரு மின்சுற்றில் வோல்ட்மீட்டர் பக்க இணைப்பில் இணைக்கப்படும்\n4. மின்பகுதிரவத்தினுள்ஆனோடு எதிர்மின் கூறி உடையது\n5. மின்னூட்டம் காந்த விளைவை ஏற்படுத்தும்\n6. மின் உருகு இழை ஜூலை விளைவின் அடிப்படையில் செயல்படுகிறது', 'எலக்ட்ரான்கள்_______மின் அழுத்தத்தில் இருந்து_____ மின் அழுத்தத்திற்கு இயங்கும்', 'அமெரிக்க ஐக்கிய நாடுகளில் வீடுகளுக்கு அளிக்கப்படும் மின்சாரம் ________அதிர்வெண் கொண்ட மாறு மின்னோட்டம்', 'ஒரு வினாடியில் கடந்து செல்லும் மின்னூட்டங்களின் மதிப்பே ____என்கிறோம்', 'ஒரு மின்சுற்றில் இரு புள்ளிகளுக்கு இடையே உள்ள மின்னழுத்த வேறுபாடு அதன் வழியே பாயும் மின்னோட்டத்தின் நேர் தகவில் இருக்கும்', 'வீட்டு உபயோக மின்பொருட்கள் எவ்வாறு இணைக்கப்படுகின்றன', 'ஜூல் வெப்ப விலையின் அடிப்படையில் வேலை செய்யும் கருவிகள்', 'எலக்ட்ரான் மின்னூட்டத்தின் மதிப்பு e= ?', '12 கூலும் மின்னூட்டம் ஐந்து வினாடி நேரம் ஒரு மின் விளக்கின் வழியாக பாய்கிறது எனில் அதன் வழியே செல்லும் மின்னோட்டத்தின் அளவு என்ன', '10 கூலும் மின்னோட்டத்தை ஒரு மீன் தொட்டியில் உள்ள இரண்டு புள்ளிகளுக்கு இடையே நகர்த்த செய்யப்படும் வேலை 100 J எனில் புள்ளிகளுக்கு இடையே உள்ள மின்னழுத்த வேறுபாடு என்ன', '30V மின்னழுத்த வேறுபாடு கொண்ட ஒரு கடத்தியின் முனைகளுக்கு இடையே 2A மின்னோட்டம் செல்கிறது எனில் அதன் மின்தடையை காண்க', '5Ω, 3Ω, & 2Ω மின்தடை மதிப்புகள் கொண்ட மூன்று மின்தடையாக்கி கள் 10V மீன்கள் அத்துடன் தொடரிணைப்பு இணைக்கப்பட்டுள்ளது தொகுபயன் மின்தடை மற்றும் மின் சுற்றில் பாயும் மின்னோட்டத்தைகாண்க', '5Ω மின்தடை கொண்ட மின் சூடு ஏற்றி ஒரு மின் மூலத்துடன் இணைக்கப்படுகிறது 6A மின்னோட்டம் ஆனது இந்த சூடு ஏற்றி வழியாக பாய்கிறது எனில் 5 நிமிடங்களில் உருவாகும் வெப்பத்தின் அளவை காண்க', 'மின்சுற்றில் 5Ω, 10Ω, 20Ω, மின்தடை உடைய R1,R2, R3 10V மின்னழுத்தம் உடைய மின்சுற்றில் பக்க இணைப்பில் இணைக்கப்பட்டுள்ளது. ஒவ்வொரு மின்தடை வழியாக செல்லும் மின்னோட்டம் என்ன', 'மின்சுற்றில் 5Ω, 10Ω, 20Ω, மின்தடை உடைய R1,R2, R3 10V மின்னழுத்தம் உடைய மின்சுற்றில் பக்க இணைப்பில் இணைக்கப்பட்டுள்ளது. மின்சுற்றில் பாயும் மொத்தமின்னோட்டம் என்ன', 'மின்சுற்றில் 5Ω, 10Ω, 20Ω, மின்தடை உடைய R1,R2, R3 10V மின்னழுத்தம் உடைய மின்சுற்றில் பக்க இணைப்பில் இணைக்கப்பட்டுள்ளது. மின்சுற்றில் உள்ள மொத்த மின்தடை என்ன', 'ஒரு வினாடியில் கடந்து செல்லும் மின்னூட்டங்களின் மதிப்பே ____என்கிறோம்', 'மின்னோட்டத்தை அளவிடும் கருவி', 'மின்னழுத்த வேறுபாட்டை அளவிடும் கருவி', 'மின்னோட்டம் மற்றும்அதன் திசையை கண்டறிய உதவும் கருவி', '_________ என்பது மிக உயர்ந்த மின்தடை எண் கொண்ட ஒரு கடத்தியாகும்.இதன் மதிப்பு 1.5x 10^-6. எனவே இது சலவை பெட்டி &மின் சூடேற்றி போன்ற வெப்பமேற்றும் சாதனங்களில் பயன்படுத்தப்படுகிறது']

a = ['A)1ம் 3ம் மட்டும்', 'A)சமயம்', 'A) பிராகிருதம்', 'A) தஞ்சை', 'A) சி.வை.தாமோதரனார்', 'A) 1835', 'A)தொல்காப்பியம்',
     'A)திருக்குறள், குண்டலகேசி, வளையாபதி', 'A) எஃப்.டபிள்யூ.எல்லிஸ்', 'A)1816', 'A)திராவிட அல்லது தென்னிந்திய மொழிகளின் ஒப்பிலக்கணம்', 'A) 1ம் 3ம் சரி', 'A)தமிழ் மறுமலர்ச்சி பிராமணியத்தின் பண்பாட்டு மேலாதிக்கத்தை ஏற்றுக் கொண்டது', 'A) உ.வே.சாமிநாதர்', 'A) சுந்தரனார்', 'A)பரிதிமாற்கலைஞர்', 'A)பரிதிமாற்கலைஞர்\r', 'A) பி.சுந்தரனார்', 'A) பட்டினப்பாலை, மதுரைக்காஞ்சி', 'A) வேதாந்த தீபிகா', 'A)சென்னை பல்கலைக்கழகம்', 'A) பிராமணர் ஆதரவு சங்கம்', 'A) 1956', 'A)தூய தமிழ் வார்த்தைகளை பயன்படுத்துவதையும் சமஸ்கிருதத்தின் செல்வாக்கு தமிழ் மொழியில் இருந்து அகற்றப்படுவதையும் மறைமலை அடிகள் ஊக்குவித்தார். ', 'A) வேதாச்சலம்', 'A)ஞானக்கடல்', 'A)பொதுநிலை கழகம்', 'A)நீலாம்பிகை அம்மையார்', 'A) அயோத்திதாச பண்டிதர்', 'A) ராமானுஜம்\r', 'A) சித்த மருத்துவம் ,தமிழ் அறிஞர்', 'A)1845-1916', 'A) அயோத்தி', 'A) ஆங்கிலம்', 'A) உயர்சாதியினரின் ராஜ்ஜியமாக விளங்கிய அச்சிட்டு வெளியிடும் இதழ் இயல்லை தனது கருவியாகக் கொண்டு அயோத்திதாசர் ஒரு புதிய அறிவை பரப்பும் முறையை முன்னெடுத்தார்', 'A) திராவிட விடுதலைக் கழகம்', 'A) பெரியார்', 'A)1882', 'A)1885', 'A) கிருஷ்ணகிரி', 'A) இந்தியத் தமிழன்', 'A)1908', 'A) சாக்கிய பௌத்த சங்கம்', 'A) இலங்கை', 'A) தாழ்த்தப்பட்டவர்கள்', 'A) சாதியற்ற பௌத்தர்கள்', 'A) வட தமிழகம்', 'A) சிங்காரவேலர்', 'A) தமிழன்', 'A) திருமாவளவன்', 'A) திருமாவளவன்', 'A)2006', 'A) ஆகஸ்ட் 21 2005', 'A) காஞ்சிபுரம்', 'A) ராக் சாஹிப்', 'A) 1926 ராவ் சாஹிப்', 'A) சரித சுருக்கம்', 'A)1937', 'A)1839', 'A) இவர் ஒடுக்கப்பட்ட மக்களின் கூட்டமைப்பு மற்றும் சென்னை மாகாண ஒடுக்கப்பட்ட வகுப்பாரின்  கூட்டமைப்பு ஆகிய அமைப்புகளில் தலைவராக பணியாற்றினார்', 'A)1896', 'A) 1930 லண்டன் முதலாவது வட்டமேசை மாநாடு', 'A) ரெட்டைமலை சீனிவாசன்', 'A)1920-1926', 'A) தலைவர்', 'A) ஆதிதிராவிடர்', 'A) அகில இந்திய ஒடுக்கப்பட்டோர் சங்கம்', 'A) பூனா உடன்படிக்கை', 'A) தாயுமானவர்', 'A)1820-1871', 'A) மருதூர்', 'A) கடலூர்', 'A) அளப்பரிய புலமை பெற்றிருந்த ராமலிங்க அடிகளார் முறையான கல்வியையும் பெற்றிருந்தார', 'A)1866', 'A) சமரச சுத்த சன்மார்க்க சத்ய சங்கம்', 'A)\tகாத்தவராயன்', 'A)\t1849', 'A)\tஅயோத்திதாசர்', 'A)\t1802', 'A)\tசமய சீர்திருத்தம்', 'A)\tஇனம்', 'A)\tஆரியர்களை வகைப்படுத்த', 'A)\tஎல்லிஸ்', 'A)\tஎல்லிஸ்', 'A)\t1867', 'A)\t1812', 'A)\t1816', 'A)\t1920', 'A)\t1913', 'A)\tடி.எம். நாயர்', 'A)\tபுத்த சங்கம்', 'A)\tஎச்.சி.ஆல்காட்', 'A)\t1890', 'A)\t1860', 'A)\tதிராவிடம்', 'A)\t1890', 'A)\t1881', 'A)\tவில்லியம்', 'A)\tநடேச முதலியார்', 'A)\t1907', 'A)\t1910', 'A)\tபிடி தியாகராயர்', 'A)\t1911', 'A)\t1912', 'A)\t1916', 'A)\t1916', 'A)\tஜஸ்டிஸ்', 'A)\t1916', 'A)\t1919', 'A)\tபிராமணர்', 'A)\tசுய ஆட்சி', 'A)\t1910', 'A)\tகாங்கிரஸ்', 'A)\tதன்னாட்சி இயக்கம்', 'A)\t1915', 'A)\tதிலகர்', 'A)\t1920-45', 'A)\t1920', 'A)\t1938', 'A)\tஅண்ணா', 'A)\t1941', 'A)\t1937', 'A)\tதென்னிந்திய நல உரிமைச் சங்கம்', 'A)\t1916', 'A)\t63', 'A)\tதியாகராயர்', 'A)\tதியாகராயர்', 'A)\tபொப்பிலி ராஜா', 'A)\t1920', 'A)\t1920', 'A)\t1920', 'A)\tதியாகராயர்', 'A)\t1920', 'A)\tமதுரை விளக்குத்தூண் பள்ளி', 'A)\t1921', 'A)\t1926', 'A)\tமுத்துலட்சுமி ரெட்டி', 'A)\tருக்மணி லட்சுமிபதி', 'A)\tஅன்னிபெசன்ட்', 'A)\t1947', 'A)\t1920', 'A)\t1927', 'A)\tராஜமன்னார்', 'A)\t1920', 'A)\tமுத்தையா முதலியார்', 'A)\t1926', 'A)\t1927', 'A)\t ஆல்காட்', 'A)\tபிற்படுத்தப்பட்டோர்', 'A)\t1922', 'A) ஆந்திராவை சேர்ந்த மானசா வாரணாசி', 'A) பர்வீன் சிம்ஹா', 'A) சிம்லா', 'A) சிம்லா', 'A) கிழக்கு ரயில்வே மண்டலம்', 'A) இந்தியா', 'A) மதுரை', 'A) 2020', 'A) WHITE PETROL', 'A) IIT MUMBAI', 'A) காவிரி நதி', 'A) Kieron Pollard', 'A) 77', 'A) NATIONAL AGRICULTURE DISASTER MANAGEMENT PLAN', 'A) கடல்சார் இந்திய தொலைநோக்கு 2030', 'A)  லாவண்டர்', 'A) MARCH 7', 'A) இந்திய துறைமுகங்கள் உச்சிமாநாடு', 'A) PSLV-C51', 'A) UAE', 'A) எலக்ட்ரான்களின் ஏற்பு ', 'A) மின்னூட்டங்கள் உருவாக்கப்படுகின்றன', 'A) தொடங்கி ; தொடங்கும்', 'A) விசையின்', 'A)  ஜூல் வெப்பமேறல்', 'A) வெப்ப விளைவு\r', 'A) வெப்பநிலை', 'A) 220Hz', 'A) இ உ. ஈ. அ. ஆ', 'A) ச த ச த ச த', 'A) அதிக குறைந்த', 'A) 50Hz', 'A) மின்புலம்', 'A) ஓம் விதி', 'A) தொடர் இணைப்பில்', 'A) நீர் சூடேற்றி', 'A)  1.6 x 10^-19', 'A) 4.8 A', 'A) 5 V', 'A) 10 Ω', 'A) 2A', 'A) 54000J', 'A) 2A, 1A, 0.25A', 'A) 3A', 'A) 3.8Ω', 'A) மின்புலம்', 'A) வோல்ட்மீட்டர்', 'A) வோல்ட்மீட்டர்', 'A) வோல்ட்மீட்டர்', 'A) பாதரசம்']

b = ['B)2ம் 4ம் மட்டும்', 'B)மொழி இலக்கணம்', 'B)சமஸ்கிருதம்', 'B) பிரிட்டன்', 'B) கால்டுவெல்', 'B)1812', 'B) வீரசோழியம்',
     'B) சீவகசிந்தாமணி, பத்துப்பாட்டு, சிலப்பதிகாரம்', 'B)ராபர்ட் கால்டுவெல்', 'B) 1818', 'B) திருநெல்வேலியின் அரசியல் பொது வரலாறு', 'B)2ம் 3ம் சரி', 'B)வள்ளலார் எனப் பிரபலமாக அறியப்பட்ட ராமலிங்க அடிகள் அப்போது நடைமுறையில் இருந்த புத்தசமய பழமைவாதத்தை கேள்விக்குள்ளாக்கினார்', 'B)திரு.வி.கல்யாண சுந்தரனார்', 'B)மறைமலை அடிகளார்', 'B) மறைமலை அடிகளார்', 'B) மறைமலை அடிகளார்\r', 'B) இராமலிங்கனார்', 'B) பட்டினப்பாலை,முல்லைப்பாட்டு', 'B) சித்தாந்த சௌமியா', 'B) மாநிலக் கல்லூரி', 'B) திருக்குறள் கழகம்', 'B) 1936', 'B)இவ்வியக்கம் தமிழ்ப் பண்பாட்டின் மீது குறிப்பாக தமிழ்மொழி, இலக்கியம் ஆகியவை மீது பெரும் தாக்கத்தை ஏற்படுத்தியது. ', 'B)அருணாச்சலம்', 'B)அறிவுச் சாகரம்', 'B)பொது நிலைய கழகம்', 'B) கமலாம்பிகை அம்மையார்', 'B) ஆறுமுக நாவலர்', 'B) ஸ்ரீனிவாசன்\r', 'B) பத்திரிக்கையாளர்', 'B)1843-1914', 'B) கோயம்பத்தூர்', 'B) பிராகிருதம்', 'B) மூக நீதிக்காக இயக்கம் நடத்திய அவர் சாதியத்தின் கொடியை பிடியிலிருந்து ஒடுக்கப்பட்டோர் விடுதலை பெற பாடுபட்டார்', 'B) திராவிடர் கழகம்', 'B) அயோத்திதாசர்', 'B)1883', 'B)1882', 'B) கோவை', 'B) தமிழக இந்தியன்', 'B)1898', 'B) சாக்கிய பௌத்த விகாரம்', 'B) கோவை', 'B) பிற்படுத்தப்பட்டவர்கள் ஒடுக்கப்பட்டவர்கள்', 'B) சாதியற்ற இந்துக்கள்', 'B) தென் தமிழகம்', 'B) லட்சுமி நரசு', 'B) திராவிடன்', 'B) இளையபெருமாள்', 'B) இளையபெருமாள்', 'B) 2007', 'B) அக்டோபர் 21 2005', 'B) சென்னை', 'B) ராவ் பகதூர்', 'B) 1930 ராவ் பகதூர்', 'B) ஜீவிய சரித சுருக்கம்', 'B) 1936', 'B) 1939', 'B) ஒடுக்கப்பட்ட மக்களோடு தொடர்புடைய கேள்விகள் பிரச்சனைகள் குறித்து இந்திய தேசிய காங்கிரஸ் மற்றும் நீதி கட்சி தலைவர்களுடன் தொடர்ந்து விவாதித்தார்', 'B)1932', 'B) 1931 லண்டன் இரண்டாவது வட்டமேசை மாநாடு', 'B) அயோத்திதாசர்', 'B) 1919-1925', 'B) துணைத் தலைவர்', 'B) ஆதி ஆந்திரர்', 'B) தேசிய ஒடுக்கப்பட்டோர் சங்கம்', 'B) மின்டோ மார்லி சீர்திருத்தம்', 'B) வள்ளலார்', 'B)1821-1872', 'B) வேலூர்', 'B) வடலூர்', 'B) துயரப்படும் உயிரினங்களைப் பார்த்து இறக்கம் கொள்ளாதவர்கள் கல்நெஞ்ச காரர்கள் அவர்களின் செல்வம் மேகங்களால் மூடப்பட்டு இருக்கும் எனும் கருத்தினை முன் வைத்தார்', 'B)1867', 'B) சமரச சன்மார்க்க சத்ய சங்கம்', 'B)\tகந்தமாறன்', 'B)\t1854', 'B)\tகந்தையன்', 'B)\t1801', 'B)\tசமூக சீர்திருத்தம்', 'B)\tபகுதி', 'B)\tதமிழ் பேசும் ஆரியர் அல்லாதவரை குறிக்க', 'B)\tகால்டுவெல்', 'B)\tகால்டுவெல்', 'B)\t1837', 'B)\t1816', 'B)\t1812', 'B)\t1921', 'B)\t1912', 'B)\tதியாகராயர்', 'B)\tஆரிய சமாஜம்', 'B)\tஎல்லிஸ்', 'B)\t1891', 'B)\t1850', 'B)\tகுடி அரசு', 'B)\t1891', 'B)\t1882', 'B)\tஜோன்ஸ்', 'B)\tபுருசோத்தம நாயுடு', 'B)\t1908', 'B)\t1911', 'B)\tநடேச முதலியார்', 'B)\t1912', 'B)\t1913', 'B)\t1917', 'B)\t1917', 'B)\tலா ஜஸ்டிஸ்', 'B)\t1917', 'B)\t1920', 'B)\tவைசியர்', 'B)\tதன்னாட்சி', 'B)\t1920', 'B)\tநீதிக்கட்சி', 'B)\tசுராஜ் இயக்கம்', 'B)\t1917', 'B)\tஆல்காட்', 'B)\t1921-37', 'B)\t1923', 'B)\t1934', 'B)\tவீரமணி', 'B)\t1942', 'B)\t1938', 'B)\tமதராஸ் ஐக்கிய கழகம்', 'B)\t1917', 'B)\t65', 'B)\tசுப்பராயன்', 'B)\tசுப்பராயன்', 'B)\tபி டி ராஜன்', 'B)\t1921', 'B)\t1921', 'B)\t1921', 'B)\tசுப்புராயலு', 'B)\t1921', 'B)\tசென்னை ஆயிரம் விளக்கு பள்ளி', 'B)\t1922', 'B)\t1925', 'B)\tருக்மணி', 'B)\tஅன்னிபெசன்ட்', 'B)\tசரோஜினி', 'B)\t1937', 'B)\t1929', 'B)\t1926', 'B)\tமண்டல்', 'B)\t1929', 'B)\tஎம் சி ராஜா', 'B)\t1927', 'B)\t1923', 'B)\tஅம்பேத்கர்', 'B)\tபழங்குடியினர்', 'B)\t1923', 'B) தெலுங்கானாவை சேர்ந்த மானசா வாரணாசி', 'B) பிரவீன் சின்ஹா', 'B) அசாம்', 'B) அசாம்', 'B) மேற்கு ரயில்வே மண்டலம்', 'B) ரஷ்யா', 'B) சென்னை', 'B) 2021', 'B) PETROL', 'B) IIT MADRAS', 'B) வைகை நதி', 'B) Yuvraj Singh', 'B) 78', 'B) NAYANTHARA CULTURE DISASTER MANAGEMENT PLAN', 'B) கடல்சார் இந்திய தொலை நோக்கு 2032', 'B) வேர்க்கோசு', 'B) MARCH 8', 'B) இந்திய கடல் சார் உச்சி மாநாடு', 'B) PSLV-C52', 'B) USA', 'B) புரோட்டான்களின் ஏற்பு ', 'B) மின்னூட்டங்கள் இடம் பெயர்கின்றன', 'B)தொடங்கி ; முடிவடையும்', 'B) திறமையின்', 'B) கூலும் வெப்பமேறல்', 'B) வேதி விளைவு\r', 'B) வடிவம்', 'B) 80Hz', 'B) அ. ஆ. இ.  ஈ.  உ', 'B) ச த ச த ச ச ', 'B) குறைந்த அதிக', 'B) 60Hz', 'B) மின்விசை கோடுகள்', 'B) ஜூல் வெப்ப விதி', 'B) பக்க இணைப்பில்', 'B) மின் சலவைப் பெட்டி', 'B) 0.16 x 10^ -20', 'B) 2.4A', 'B) 15 V', 'B) 18 Ω', 'B) 4A', 'B) 50000J', 'B) 2A, 0.5A, 1A', 'B) 3.5A', 'B) 3.857Ω', 'B) மின்விசை கோடுகள்', 'B) அம்மீட்டர்', 'B) அம்மீட்டர்', 'B) அம்மீட்டர்', 'B) துத்தகனாகம்']

c = ['C)1ம் 2ம் மட்டும்', 'C)தமிழ் இலக்கணம்', 'C) பாலி', 'C) கோவா', 'C)செயின்ட் ஜார்ஜ்', 'C) 1821', 'C) இறையனார் அகப்பொருள்',
     'C) ஐங்குறுநூறு, பதிற்றுப்பத்து', 'C) பரிதிமாற்கலைஞர்', 'C)1820', 'C) பரதகண்ட புராதனம்', 'C) 1ம் 2ம் சரி', 'C) சி.வை.தாமோதரனார் தமிழ் இசைக்கு சிறப்பு செய்ததோடு தமிழிசை வரலாறு குறித்து நூல்களையும் வெளியிட்டார்', 'C)வி. கோ.சூரியநாராயண சாஸ்திரி', 'C)பரிதிமாற்கலைஞர்', 'C) திரு.வி.க', 'C) திரு.வி.க\r', 'C)திரு.வி.க', 'C) மதுரைக்காஞ்சி,முல்லைப்பாட்டு', 'C) வேதாந்த சௌமியா', 'C)சென்னை கிறித்தவக் கல்லூரி', 'C) கம்பன் கழகம்', 'C) 1916', 'C)தமிழ் மொழியின் மீது செல்வாக்குச் செலுத்தும் வேற்று மொழி வார்த்தைகளை அடையாளம் கண்டு அவற்றை அகற்றுகின்ற செயல்பாடு பத்தொன்பதாம் நூற்றாண்டின் பிற்பகுதியிலேயே தொடங்கப்பட்டு இருந்தாலும் தனித்தமிழ் இயக்கம் தொடங்கியது 1910 என பொதுவாகக் கூறப்படுகிறது.\xa0 ', 'C)வெங்கடாசலபதி', 'C)அறிவு சூரியன்', 'C) பொது கழகம்', 'C) தர்மாம்பாள் அம்மையார்', 'C) வள்ளலார்', 'C) நரசிம்மன்\r', 'C) சமூக அரசியல் செயல்பாட்டாளர்', 'C)1845-1915', 'C) காஞ்சிபுரம்', 'C) பாலி', 'C) கல்வியை வலிமை பெறுவதற்கான கருவியாக கருதிய அவர் தமிழகத்தின் ஒடுக்கப்பட்டோருக்கான பல பள்ளிகள் உருவாக்கப்படுவதற்கு உந்து சக்தியை திகழ்ந்தார்', 'C) அத்வைதாநந்தா சபா', 'C) ஜான் திரவியம்', 'C)1884', 'C)1887', 'C) தர்மபுரி', 'C) ஒரு பைசா தமிழன்', 'C)1888', 'C) சாக்கிய விடுதலை சங்கம்', 'C) சென்னை', 'C) சாதி இந்துக்களின்', 'C) சாதியற்ற திராவிடர்கள்', 'C) கீழ் தமிழகம்', 'C) மா பொ சிவஞானம்', 'C) ஆரியமாயை', 'C) சிங்காரவேலர்', 'C) தமிழரசன்', 'C) 2008', 'C) செப்டம்பர் 21 2005', 'C) கன்னியாகுமரி', 'C) திவான்பகதூர்', 'C) 1936 திவான்பகதூர்', 'C) நித்திய ஜீவ சுருக்கம்', 'C) 1939', 'C) 1893', 'C) பிரிட்டனில் காந்தியடிகளை சந்தித்த இரட்டைமலை சீனிவாசன் அவருடன் நெருக்கமானார்', 'C)1923', 'C) இவை இரண்டும்', 'C) மயிலை சின்னத்தம்பி ராஜா', 'C) 1920-1925', 'C) பொருளாளர்', 'C) மேற்கூறிய இரண்டும்', 'C) தென்னக ஒடுக்கப்பட்டோர் சங்கம்', 'C) முதல் வட்டமேசை மாநாடு', 'C) அருட்பெருஞ்ஜோதி', 'C)1822-1873', 'C) புவனகிரி', 'C) காஞ்சிபுரம்', 'C) தன்னுடைய அன்பையும் இரக்கத்தையும் செடிகொடிகள் உட்பட அனைத்து உயிரினங்கள் இடமும் காட்டினார் இதை அவர் ஜீவகாருண்யம் என்றார்', 'C)1856', 'C) சமரச சுத்த சன்மார்க்க சங்கம்', 'C)\tகாந்தையன்', 'C)\t1856', 'C)\tலக்ஷமினராசு செட்டி', 'C)\t1808', 'C)\tஅரசியல் சீர்திருத்தம்', 'C)\tநாடு', 'C)\tதெலுங்கு பேசும் வரை குறிக்க', 'C)\tபிரான்சிஸ்', 'C)\tஜேம்ஸ் பிரின்சிபே', 'C)\t1857', 'C)\t1817', 'C)\t1817', 'C)\t1923', 'C)\t1992', 'C)\tஜோர்டன் கார்டிவ்', 'C)\tஆத்வைத சங்கம்', 'C)\tஅயோத்திதாசர்', 'C)\t1897', 'C)\t1870', 'C)\tஒரு பைசா தமிழன்', 'C)\t1892', 'C)\t1883', 'C)\tஜான் ரத்தினம்', 'C)\tதியாகராயர்', 'C)\t1909', 'C)\t1912', 'C)\tமாதவன் நாயர்', 'C)\t1913', 'C)\t1916', 'C)\t1918', 'C)\t1918', 'C)\tஜஸ்டிஸ் லீக்', 'C)\t1918', 'C)\t1921', 'C)\tசத்திரியர்', 'C)\tஇரட்டையாட்சி', 'C)\t1903', 'C)\tசுயேட்சை', 'C)\tசட்ட மறுப்பு இயக்கம்', 'C)\t1919', 'C)\tகிருஷ்ணமூர்த்தி', 'C)\t1920-26', 'C)\t1924', 'C)\t1967', 'C)\tபெரியார்', 'C)\t1943', 'C)\t1939', 'C)\tதிராவிடர் கழகம்', 'C)\t1920', 'C)\t64', 'C)\tசுப்புராயலு', 'C)\tசுப்புராயலு', 'C)\tகே வி ரெட்டி', 'C)\t1922', 'C)\t1922', 'C)\t1923', 'C)\tசுப்பராயன்', 'C)\t1922', 'C)\tதிருச்சி பாப்பா குறிச்சி பள்ளி', 'C)\t1925', 'C)\t1921', 'C)\tஅற்புதம்மாள்', 'C)\tசரோஜினி', 'C)\tமுத்துலட்சுமி', 'C)\t1929', 'C)\t1930', 'C)\t1930', 'C)\tமுத்தையா முதலியார்', 'C)\t1926', 'C)\tவீரையன்', 'C)\t1928', 'C)\t1922', 'C)\tமுத்தையா முதலியார்', 'C)\tஒடுக்கப்பட்டோர்', 'C)\t1925', 'C) மகாராஷ்டிராவை சேர்ந்தமனிஷா வாரணாசி', 'C) நவீன் சின்ஹா', 'C) பெங்களூரு', 'C) பெங்களூரு', 'C) தெற்கு ரயில்வே மண்டலம்', 'C) கனடா', 'C) தஞ்சாவூர்', 'C) 2022', 'C) AIR', 'C) PATNA UNIVERSITY', 'C) கிருஷ்ணா நதி', 'C) Stuart broad', 'C) 79', 'C) NEW AGRICULTURE DISASTER MANAGEMENT PLAN', 'C)கடல்சார் இந்திய தொலை நோக்கு 2035', 'C) புதினா', 'C) MARCH 9', 'C) இந்திய கப்பல் வணிக உச்சிமாநாடு', 'C) PSLV-C53', 'C) UK', 'C) எலக்ட்ரான்களின் இழப்பு ', 'C) A & B', 'C)முடிவடைந்து ; தொடங்கும்', 'C) போக்கின்', 'C) மின்னழுத்த வெப்பமேறல்', 'C) பாய்வு விளைவு\r', 'C) கம்பியின் இயல்பு', 'C) 50Hz', 'C) இ ஈ உ அ ஆ ', 'C) ச ச ச ச ச ச', 'C) அதிக அதிக', 'C) 70Hz', 'C) மின்னூட்டம்', 'C) மின்னூட்டம்', 'C) இரண்டும் சரி', 'C) A & B', 'C) 16 x 10^-18', 'C) 7.2 A', 'C) 10 V', 'C) 20 Ω', 'C) 8A', 'C) 45000J', 'C) 2A, 1A, O.5A', 'C) 2.5A', 'C) 2.857Ω', 'C) மின்னூட்டம்', 'C) கால்வனோமீட்டர்', 'C) கால்வனோ மீட்டர்', 'C) கால்வனோமீட்டர்', 'C) இரும்பு']

d = ['D)1ம் 4ம் மட்டும்', 'D) உலகநெறி', 'D)தமிழ்', 'D) கோவை', 'D) சீகன்பால்கு', 'D)1853', 'D)  திருக்குறள்',
     'D)புறநானூறு, புறப்பொருள் வெண்பாமாலை, மணிமேகலை', 'D) மறைமலை அடிகள்', 'D)1822', 'D) தாமரை தடாகம்', 'D)அனைத்தும் சரி', 'D) இருபதாம் நூற்றாண்டின் தமிழ் மொழி இயக்கங்களான தனித்தமிழ் இயக்கம் மற்றும் தமிழிசை இயக்கம் போன்றவைகள் சமஸ்கிருதத்தின் செல்வாக்கிற்கு ஆட்படாத தூய தமிழை உருவாக்குவதில் தாக்கத்தை ஏற்படுத்தின.', 'D)ராஜகோபாலாச்சாரி', 'D) தேவநேயப் பாவாணர்', 'D)குன்றக்குடி அடிகளார்', 'D)குன்றக்குடி அடிகளார்', 'D)கவிமணி', 'D) மதுரைக்காஞ்சி,பதிற்றுப்பத்து', 'D)சித்தாந்த தீபிகா', 'D)சென்னை புதுக்கல்லூரி', 'D) பிராமணரல்லாதோர் இயக்கம்', 'D) 1906', 'D)மறைமலை அடிகளாரின் மகள் நீலாம்பிகை இவ்வியக்கம் உருவாக்கப்பட்டதில் முக்கிய பங்கு வகித்தார்.', 'D)வேங்கட கிருஷ்ணன்', 'D)அறிவு கடல்', 'D)பொது உடன்பாட்டுக்கு கழகம்', 'D) இவர் அனைவரும்', 'D) வைகுண்ட சுவாமிகள்', 'D) காத்தவராயன்', 'D) காந்தியவாதி', 'D)1845-1914', 'D) சென்னை', 'D) சமஸ்கிருதம்', 'D) ஏதுமில்லை', 'D) திராவிட மகாஜன சபை', 'D) B and C', 'D)1885', 'D)1891', 'D) நீலகிரி', 'D) ஒரு பைசா இந்தியன்', 'D)1868', 'D) ஐக்கிய விடுதலைக் கழகம்', 'D) திருவள்ளூர்', 'D) பிராமணியத்தாள் ஒடுக்கப்பட்டவர்கள்', 'D) சாதியற்ற தமிழர்கள்', 'D) மேல் தமிழகம்', 'D) எவருமில்லை', 'D) புத்தன்', 'D) எழில்மலை', 'D) எழில்மலை', 'D) 2010', 'D) நவம்பர் 21 2005', 'D) திருவண்ணாமலை', 'D) இவை அனைத்தும்', 'D) ஏதுமில்லை', 'D) நித்திய சரித சுருக்கம்', 'D) 1938', 'D)1933', 'D) நீதிக்கட்சியில் தனது செல்வாக்கினை ஏற்படுத்தி ஒடுக்கப்பட்ட உரிமைகள் மறுக்கப்பட்ட சமூக பிரிவுகளை சேர்ந்த மக்களின் உரிமைகளையும் பாதுகாப்பு உறுதியான நடவடிக்கைகளை மேற்கொள்ள செய்தார்.', 'D)1936', 'D) ஏதுமில்லை', 'D) தோழர் ஜீவானந்தம்', 'D)1921-1926', 'D) கொறடா', 'D) ஏதுமில்லை', 'D) அகில இந்திய ஆதிதிராவிடர் நல சங்கம்', 'D)இரண்டாம் வட்டமேசை மாநாடு', 'D) தனிப்பெரும் கருணை', 'D)1823-1874', 'D) பரங்கிப்பேட்டை', 'D) சென்னை', 'D) 1866ல் தென்னிந்தியாவில் ஏற்பட்ட கொடிய பஞ்சத்தை கணக்கில்கொண்டு 1867இல் சாதிய எல்லைகளைத் தாண்டி அனைத்து மக்களுக்குமான இலவச உணவகத்தை மருதூரில் நிறுவினார்.', 'D)1857', 'D) சமரச வேத சன்மார்க்க சத்ய சங்கம்', 'D)\tநந்தன்', 'D)\t1876', 'D)\tயாருமில்லை', 'D)\t1809', 'D)\tஇவற்றுள் ஏதுமில்லை', 'D)\tமொழி', 'D)\tஇவற்றில் ஏதுமில்லை', 'D)\tஇவர்களில் யாருமில்லை', 'D)\tயாருமில்லை', 'D)\t1877', 'D)\t1819', 'D)\t1818', 'D)\t1925', 'D)\t1919', 'D)\tயாருமில்லை', 'D)\tபிரம்ம சமாஜம்', 'D)\tஅன்னி பெசண்ட்', 'D)\t1898', 'D)\t1890', 'D)\tதிராவிட நாடு', 'D)\t1893', 'D)\t1884', 'D)\tதியாகராயர்', 'D)\tநாயர்', 'D)\t1910', 'D)\t1920', 'D)\tஇவர்களில் யாரும் இல்லை', 'D)\t1914', 'D)\t1917', 'D)\t1919', 'D)\t1919', 'D)\tயங் ஜஸ்டிஸ்', 'D)\t1919', 'D)\t1922', 'D)\tஉழைக்கும் மக்கள்', 'D)\tசுதந்திர ஆட்சி', 'D)\t1952', 'D)\tஇவற்றில் ஏதுமில்லை', 'D)\tஒத்துழையாமை இயக்கம்', 'D)\t1916', 'D)\tஅன்னிபெசன்ட்', 'D)\t1920-30', 'D)\t1925', 'D)\t1973', 'D)\tஇவர்களில் யாரும் இல்லை', 'D)\t1944', 'D)\t1940', 'D)\tசுயமரியாதை இயக்கம்', 'D)\t1960', 'D)\t67', 'D)\tபனகல் அரசர்', 'D)\tபனகல் அரசர்', 'D)\tஇவர்களில் யாரும் இல்லை', 'D)\t1923', 'D)\t1925', 'D)\t1926', 'D)\tபொப்பிலி ராஜா', 'D)\t1927', 'D)\tஇவற்றுள் ஏதுமில்லை', 'D)\t1927', 'D)\t1922', 'D)\tஅன்னிபெசன்ட்', 'D)\tமுத்துலட்சுமி', 'D)\tருக்மணி லட்சுமிபதி', 'D)\t1944', 'D)\t1924', 'D)\t1977', 'D)\tசிவஞானம் பிள்ளை', 'D)\t1930', 'D)\tஇரட்டைமலை சீனிவாசன்', 'D)\t1929', 'D)\t1924', 'D)\tஎம் சி ராஜா', 'D)\tஆதிதிராவிடர்', 'D)\t1926', 'D) டெல்லியை சேர்ந்த மனிஷா வாரணாசி', 'D) ஷெர்லின் சின்ஹா', 'D) சென்னை', 'D) சென்னை', 'D) வடக்கு ரயில்வே மண்டலம்', 'D) ஆஸ்திரேலியா', 'D) திருவாதவூர்', 'D) 2023', 'D) CARBON DIOXIDE', 'D) DELHI UNIVERSITY', 'D) அமேசான் நதி', 'D) Herschelle Gibbs', 'D) 80', 'D) NAYANTHARA CULTURE DISASTER MITIGATION PLANNING', 'D) கடல்சார் இந்திய தலைநோக்கு 2040', 'D) துளசி', 'D) MARCH 6', 'D) இந்திய நீர்வழி போக்குவரத்து உச்சி மாநாடு', 'D) PSLV-C54', 'D) INDIA', 'D) புரோட்டான்களின் இழப்பு', 'D) இரண்டும் இல்லை', 'D) முடிவடைந்து ;முடிவடையும்', 'D) வேலையின்', 'D) ஆம்பியர் வெப்பமேறல்', 'D) காந்த விளைவு\r', 'D) இவை அனைத்தும்', 'D) 100Hz', 'D) ஈ உ அ ஆ இ', 'D) த த த த த த', 'D) குறைந்த குறைந்த', 'D) 80Hz', 'D) மின்னோட்டம்', 'D) மின்னோட்டம்', 'D) இரண்டும் தவறு', 'D) இரண்டும் தவறு', 'D) அனைத்தும் சரி', 'D) 1.2 A', 'D)20 V', 'D) 15 Ω', 'D) 1A', 'D) 64000J', 'D)2A, 1A, 2A', 'D) 4A', 'D) 1.857Ω', 'D) மின்னோட்டம்', 'D) டயோடு', 'D) டயோடு', 'D) டயோடு', 'D) நிக்ரோம்']

correct_answer = ['C)1ம் 2ம் மட்டும்', 'A)சமயம்', 'D)தமிழ்', 'C) கோவா', 'D) சீகன்பால்கு', 'B)1812', 'D)  திருக்குறள்',
                  'A)திருக்குறள், குண்டலகேசி, வளையாபதி', 'A) எஃப்.டபிள்யூ.எல்லிஸ்', 'A)1816', 'A)திராவிட அல்லது தென்னிந்திய மொழிகளின் ஒப்பிலக்கணம்', 'C) 1ம் 2ம் சரி', 'D) இருபதாம் நூற்றாண்டின் தமிழ் மொழி இயக்கங்களான தனித்தமிழ் இயக்கம் மற்றும் தமிழிசை இயக்கம் போன்றவைகள் சமஸ்கிருதத்தின் செல்வாக்கிற்கு ஆட்படாத தூய தமிழை உருவாக்குவதில் தாக்கத்தை ஏற்படுத்தின.', 'C)வி. கோ.சூரியநாராயண சாஸ்திரி', 'C)பரிதிமாற்கலைஞர்', 'B) மறைமலை அடிகளார்', 'B) மறைமலை அடிகளார்', 'A) பி.சுந்தரனார்', 'B) பட்டினப்பாலை,முல்லைப்பாட்டு', 'D)சித்தாந்த தீபிகா', 'C)சென்னை கிறித்தவக் கல்லூரி', 'D) பிராமணரல்லாதோர் இயக்கம்', 'C) 1916\n', 'C)தமிழ் மொழியின் மீது செல்வாக்குச் செலுத்தும் வேற்று மொழி வார்த்தைகளை அடையாளம் கண்டு அவற்றை அகற்றுகின்ற செயல்பாடு பத்தொன்பதாம் நூற்றாண்டின் பிற்பகுதியிலேயே தொடங்கப்பட்டு இருந்தாலும் தனித்தமிழ் இயக்கம் தொடங்கியது 1910 என பொதுவாகக் கூறப்படுகிறது.', 'A) வேதாச்சலம்', 'D)அறிவு கடல்', 'A)பொதுநிலை கழகம்', 'A)நீலாம்பிகை அம்மையார்', 'A) அயோத்திதாச பண்டிதர்', 'D) காத்தவராயன்', 'D) காந்தியவாதி', 'D)1845-1914', 'D) சென்னை', 'B) பிராகிருதம்', 'D) ஏதுமில்லை', 'C) அத்வைதாநந்தா சபா', 'D) B and C', 'D)1885', 'D)1891', 'D) நீலகிரி', 'C) ஒரு பைசா தமிழன்', 'B)1898', 'A) சாக்கிய பௌத்த சங்கம்', 'C) சென்னை', 'D) பிராமணியத்தாள் ஒடுக்கப்பட்டவர்கள்', 'C) சாதியற்ற திராவிடர்கள்', 'A) வட தமிழகம்', 'C) மா பொ சிவஞானம்', 'A) தமிழன்', 'D) எழில்மலை', 'C) தமிழரசன்', 'C) 2008', 'B) அக்டோபர் 21 2005', 'A) காஞ்சிபுரம்', 'D) இவை அனைத்தும்', 'D) ஏதுமில்லை', 'B) ஜீவிய சரித சுருக்கம்', 'C) 1939', 'C) 1893', 'C) பிரிட்டனில் காந்தியடிகளை சந்தித்த இரட்டைமலை சீனிவாசன் அவருடன் நெருக்கமானார்', 'C)1923', 'C) இவை இரண்டும்', 'C) மயிலை சின்னத்தம்பி ராஜா', 'A)1920-1926', 'B) துணைத் தலைவர்', 'C) மேற்கூறிய இரண்டும்', 'A) அகில இந்திய ஒடுக்கப்பட்டோர் சங்கம்', 'A) பூனா உடன்படிக்கை', 'B) வள்ளலார்', 'D)1823-1874', 'A) மருதூர்', 'D) சென்னை', 'C) தன்னுடைய அன்பையும் இரக்கத்தையும் செடிகொடிகள் உட்பட அனைத்து உயிரினங்கள் இடமும் காட்டினார் இதை அவர் ஜீவகாருண்யம் என்றார்', 'C)1856', 'C) சமரச சுத்த சன்மார்க்க சங்கம்', 'A)\tகாத்தவராயன்', 'A)\t1849', 'C)\tலக்ஷமினராசு செட்டி', 'B)\t1801', 'B)\tசமூக சீர்திருத்தம்', 'D)\tமொழி', 'B)\tதமிழ் பேசும் ஆரியர் அல்லாதவரை குறிக்க', 'B)\tகால்டுவெல்', 'C)\tஜேம்ஸ் பிரின்சிபே', 'B)\t1837', 'B)\t1816', 'B)\t1812', 'A)\t1920', 'A)\t1913', 'C)\tஜோர்டன் கார்டிவ்', 'C)\tஆத்வைத சங்கம்', 'A)\tஎச்.சி.ஆல்காட்', 'A)\t1890', 'C)\t1870', 'C)\tஒரு பைசா தமிழன்', 'B)\t1891', 'B)\t1882', 'C)\tஜான் ரத்தினம்', 'B)\tபுருசோத்தம நாயுடு', 'C)\t1909', 'C)\t1912', 'B)\tநடேச முதலியார்', 'B)\t1912', 'C)\t1916', 'B)\t1917', 'A)\t1916', 'A)\tஜஸ்டிஸ்', 'B)\t1917', 'A)\t1919', 'A)\tபிராமணர்', 'C)\tஇரட்டையாட்சி', 'B)\t1920', 'A)\tகாங்கிரஸ்', 'D)\tஒத்துழையாமை இயக்கம்', 'D)\t1916', 'D)\tஅன்னிபெசன்ட்', 'B)\t1921-37', 'D)\t1925', 'A)\t1938', 'C)\tபெரியார்', 'D)\t1944', 'A)\t1937', 'A)\tதென்னிந்திய நல உரிமைச் சங்கம்', 'A)\t1916', 'A)\t63', 'C)\tசுப்புராயலு', 'B)\tசுப்பராயன்', 'C)\tகே வி ரெட்டி', 'A)\t1920', 'A)\t1920', 'B)\t1921', 'B)\tசுப்புராயலு', 'B)\t1921', 'B)\tசென்னை ஆயிரம் விளக்கு பள்ளி', 'A)\t1921', 'A)\t1926', 'A)\tமுத்துலட்சுமி ரெட்டி', 'D)\tமுத்துலட்சுமி', 'D)\tருக்மணி லட்சுமிபதி', 'C)\t1929', 'B)\t1929', 'B)\t1926', 'D)\tசிவஞானம் பிள்ளை', 'B)\t1929', 'A)\tமுத்தையா முதலியார்', 'A)\t1926', 'B)\t1923', 'D)\tஎம் சி ராஜா', 'D)\tஆதிதிராவிடர்', 'B)\t1923', 'B) தெலுங்கானாவை சேர்ந்த மானசா வாரணாசி', 'B) பிரவீன் சின்ஹா', 'C) பெங்களூரு', 'A) சிம்லா', 'B) மேற்கு ரயில்வே மண்டலம்', 'D) ஆஸ்திரேலியா', 'C) தஞ்சாவூர்', 'D) 2023', 'C) AIR', 'C) PATNA UNIVERSITY', 'D) அமேசான் நதி', 'A) Kieron Pollard', 'B) 78', 'A) NATIONAL AGRICULTURE DISASTER MANAGEMENT PLAN', 'A) கடல்சார் இந்திய தொலைநோக்கு 2030', 'A) லாவண்டர்', 'B) MARCH 8', 'B) இந்திய கடல் சார் உச்சி மாநாடு', 'A) PSLV-C51', 'A) UAE', 'C) எலக்ட்ரான்களின் இழப்பு', 'B) மின்னூட்டங்கள் இடம் பெயர்கின்றன', 'B)தொடங்கி ; முடிவடையும்', 'D) வேலையின்', 'A) ஜூல் வெப்பமேறல்', 'B) வேதி விளைவு', 'D) இவை அனைத்தும்', 'C) 50Hz', 'A) இ உ. ஈ. அ. ஆ', 'B) ச த ச த ச ச', 'A) அதிக குறைந்த', 'B) 60Hz', 'D) மின்னோட்டம்', 'A) ஓம் விதி', 'B) பக்க இணைப்பில்', 'C) A & B', 'D) அனைத்தும் சரி', 'B) 2.4A', 'C) 10 V', 'D) 15 Ω', 'D) 1A', 'A) 54000J', 'C) 2A, 1A, O.5A', 'B) 3.5A', 'C) 2.857Ω', 'D) மின்னோட்டம்', 'B) அம்மீட்டர்', 'A) வோல்ட்மீட்டர்', 'C) கால்வனோமீட்டர்', 'D) நிக்ரோம்']


@app.route("/", methods=["GET", "POST"])
def home():
    warning = request.args.get("warn")

    if current_user.is_authenticated:
        completed = Test23.query.filter_by(examinee_id=current_user.user_id).first()

        if request.args.get("fee"):
            name = request.args.get("name")
            bending = request.args.get("bending")
            logged_in = request.args.get("logged_in")

            return render_template("index.html", fee=True, name=name, bending=bending, logged_in=logged_in,
                                   completed=completed)

        else:
            if completed:
                return render_template("index.html", warning=warning, completed=completed)

            else:
                return render_template("index.html", warning=warning)

    else:
        return render_template("index.html", warning=warning)


@app.route("/register", methods=['GET', 'POST'])
def register():
    form = RegisterForm()
    errors = []

    if form.validate_on_submit():
        hash_and_salted_password = generate_password_hash(
            request.form.get('password'),
            method='pbkdf2:sha256',
            salt_length=8
        )

        new_user = User(
            email=request.form.get('email'),
            username=request.form.get('name'),
            password=hash_and_salted_password,
        )

        if User.query.filter_by(email=request.form.get('email').lower()).first():
            return redirect(url_for('login', msg="You've already been registered. Please Login!"))

        elif User.query.filter_by(username=request.form.get('name')).first():
            errors.append('The username has already been taken')
            return render_template("register.html", errors=errors, form=form)

        else:
            errors.clear()

            if request.form.get('email') in verified_emails:

                db.session.add(new_user)
                db.session.commit()

                login_user(new_user)

                # redirect to the home page with fee details.
                return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                        bending=student_mails[request.form.get('email')][1]))

            else:
                return redirect(url_for('home', warn=True))

    return render_template("register.html", form=form)


@app.route("/login", methods=['GET', 'POST'])
def login():
    form = LoginForm()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        password = request.form.get('password')

        # Find user by email entered.
        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, password):
            login_user(user)
            errors.clear()

            # checking the user's payment details
            # redirect to the home page with fee details.
            return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                    bending=student_mails[request.form.get('email')][1]))

        else:
            errors.append('Incorrect Password! Try Again')
            return render_template("login.html", errors=errors, form=form)

    msg = request.args.get("msg")
    return render_template("login.html", form=form, errors=errors, msg=msg)


@app.route("/exam", methods=["GET", "POST"])
def exam():
    global attended
    test_no = request.args.get("test_no")
    opentime = exam_sites[test_no][0]
    closetime = exam_sites[test_no][1]

    # if test_no == "15":
    #     attended = Test15.query.filter_by(examinee_id=current_user.user_id).first()
    #
    # elif test_no == "16":
    #         attended = Test16.query.filter_by(examinee_id=current_user.user_id).first()
    #
    # elif test_no == "17":
    #         attended = Test17.query.filter_by(examinee_id=current_user.user_id).first()
    #
    # elif test_no == "18":
    #     attended = Test18.query.filter_by(examinee_id=current_user.user_id).first()

    # if test_no == "19":
    #     attended = Test19.query.filter_by(examinee_id=current_user.user_id).first()

    if test_no == "20":
        attended = Test20.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "21":
        attended = Test21.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "22":
        attended = Test22.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "23":
        attended = Test23.query.filter_by(examinee_id=current_user.user_id).first()

    else:
        return redirect(url_for("home", warn=f"The Test number {test_no} is not available!"))

    if attended is None:
        return render_template("exam.html", opentime=json.dumps(opentime), closetime=json.dumps(closetime),
                               sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d, correct_answer=correct_answer,
                               answers=[], test_no=test_no)
    else:
        return redirect(url_for("home", warn="You have already committed this exam. Check the results instead."))


@app.route('/evaluate', methods=["GET", "POST"])
def evaluate():
    global new_examinee
    answers = []
    final_result = []
    marks = 0

    for i in range(0, len(sl_no)):
        user_answer = request.form[f'answers{i}']

        if user_answer is None:
            answers.append("None")

        else:
            answers.append(user_answer)

    for j in range(len(correct_answer)):

        if answers[j].strip() == correct_answer[j].strip():
            marks += 1
            final_result.append("Correct")

        else:
            final_result.append("Wrong")

    # return f"{final_result, answers, correct_answer}"

    st_answers = '#||#'.join(answers)
    f_result = "#||#".join(final_result)

    # return f"{correct_answer, answers}"
    # return f"{[s_answers for s_answers in correct_answer]}"
    # return f"{[s_answers for s_answers in answers]}"
    # return f"{final_result}"

    actual_time = datetime.datetime.now()
    s_time = actual_time.strftime('%Y-%m-%d %H:%M:%S.%f')

    new_examinee = Test23(
        test_author=current_user,
        user_answers=st_answers,
        marks=marks,
        final_result=f_result,
        date=s_time[:-7],
        examinee_name=current_user.username
    )

    db.session.add(new_examinee)
    db.session.commit()

    return redirect(url_for('home', warn="You have successfully completed the exam. Click results to see results."))


@app.route("/result", methods=["GET", "POST"])
def result():
    global answers, final_result, time, marks
    test_no = request.args.get("test_no")

    # if test_no == "15":
    #     attended_student = Test15.query.filter_by(examinee_id=current_user.user_id).first()
    #
    # elif test_no == "16":
    #     attended_student = Test16.query.filter_by(examinee_id=current_user.user_id).first()
    #
    # elif test_no == "17":
    #     attended_student = Test17.query.filter_by(examinee_id=current_user.user_id).first()
    #
    # elif test_no == "18":
    #     attended_student = Test18.query.filter_by(examinee_id=current_user.user_id).first()

    # if test_no == "19":
    #     attended_student = Test19.query.filter_by(examinee_id=current_user.user_id).first()

    if test_no == "20":
        attended_student = Test20.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "21":
        attended_student = Test21.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "22":
        attended_student = Test22.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "23":
        attended_student = Test23.query.filter_by(examinee_id=current_user.user_id).first()

    else:
        return redirect(url_for('home', warn="The result for the exam that you had selected is no longer available"))

    answers = attended_student.user_answers.split('#||#')
    final_result = attended_student.final_result.split('#||#')
    marks = attended_student.marks
    time = attended_student.date

    return render_template("results.html", answers=answers, marks=marks, sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d,
                           correct_answer=correct_answer, final_result=final_result, time=time)


@app.route("/dashboard")
def dashboard():
    all_record = Test23.query.all()

    return render_template("dashboard.html", all_record=all_record)


@app.route("/change_details", methods=["GET", "POST"])
def change_password():
    form = ChangeDetails()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        old_password = request.form.get('old_password')
        new_password = request.form.get('new_password')

        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, old_password):

            if User.query.filter_by(email=email).first():
                old = User.query.filter_by(email=email).first()
                pass_to_update = User.query.get(old.user_id)

                hash_and_salted_password = generate_password_hash(
                    new_password,
                    method='pbkdf2:sha256',
                    salt_length=8
                )

                pass_to_update.password = hash_and_salted_password

                db.session.commit()

                logout_user()
                return redirect(url_for('login', msg="Your password has been changed successfully. "
                                                     "Please Login with your new password."))

        else:
            errors.append("Please check your password.")
            return render_template("change_details.html", form=form, errors=errors)

    return render_template("change_details.html", form=form, errors=errors)


@app.route('/logout')
@login_required
def logout():
    logout_user()
    return redirect(url_for('home'))


@app.route("/admission", methods=["GET", "POST"])
def new_admission():
    form = AdmissionForm()

    if form.validate_on_submit():
        new_member = Admission(
            name=form.name.data,
            mobile_number=form.number.data,
            email=form.email.data,
        )

        db.session.add(new_member)
        db.session.commit()

        verification_code = random.randint(2000, 10000)

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=request.form.get('email'),
                                msg=f"Subject:WELCOME TO SENA CAREER INSTITUTE\n\nWelcome {request.form.get('name')}!"
                                    f" Happy to see you with us. Thanks for supporting us! Keep rocking! "
                                    f"Here is our Educators' number: 8610642720".encode('utf-8'))

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=MY_EMAIL,
                                msg=f"Subject:NEW ADMISSION\n\n{request.form.get('name')} has made an "
                                    f"admission sign up on Sena site Here is details {request.form.get('name')},"
                                    f" {request.form.get('number')}, {request.form.get('email')}!")

        return redirect(url_for('home'))

    return render_template("register.html", form=form, admission=True)


if __name__ == '__main__':
    app.run(debug=True)
