import datetime
import random
import smtplib
import pandas
from flask import Flask, render_template, redirect, url_for, flash, request, abort
from flask_bootstrap import Bootstrap
from flask_ckeditor import CKEditor
from werkzeug.security import generate_password_hash, check_password_hash
from flask_sqlalchemy import SQLAlchemy
from flask_login import UserMixin, login_user, LoginManager, login_required, current_user, logout_user
from flask_wtf import FlaskForm
from sqlalchemy.orm import relationship
from wtforms import StringField, SubmitField, PasswordField
from wtforms.fields.html5 import EmailField
from wtforms.validators import DataRequired
from functools import wraps
import os
import json

app = Flask(__name__)
app.config['SECRET_KEY'] = os.environ.get("SECRET_KEY")
ckeditor = CKEditor(app)
Bootstrap(app)

app.config['SQLALCHEMY_DATABASE_URI'] = os.environ.get("DATABASE_URL", "sqlite:///sena-base.db")
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
db = SQLAlchemy(app)

admin = False
login_manager = LoginManager()
login_manager.init_app(app)

MY_EMAIL = os.environ.get("MY_EMAIL")
SENA_EMAIL = 'sivagangainagarajan@gmail.com'
MY_PASSWORD = os.environ.get("MY_PASSWORD")


@login_manager.user_loader
def load_user(user_id):
    return User.query.get(int(user_id))


def admin_only(f):
    @wraps(f)
    def decorated_function(*args, **kwargs):
        # If id is not 1 then return abort with 403 error
        if current_user.user_id != 1:
            return abort(403)
        # Otherwise continue with the route function
        return f(*args, **kwargs)

    return decorated_function


class User(UserMixin, db.Model):
    __tablename__ = "User"
    user_id = db.Column(db.Integer, primary_key=True)
    email = db.Column(db.String(100), unique=True)
    password = db.Column(db.String(100))
    username = db.Column(db.String(100))
    # test = relationship("Test15", back_populates="test_author")
    test16 = relationship("Test16", back_populates="test_author")
    test17 = relationship("Test17", back_populates="test_author")
    test18 = relationship("Test18", back_populates="test_author")
    test19 = relationship("Test19", back_populates="test_author")
    test20 = relationship("Test20", back_populates="test_author")

    def get_id(self):
        return self.user_id


# class Test15(db.Model):
#     __tablename__ = "Test_15"
#     user_id = db.Column(db.Integer, primary_key=True)
#     examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
#     test_author = relationship("User", back_populates="test")
#     marks = db.Column(db.Integer)
#     user_answers = db.Column(db.String())
#     final_result = db.Column(db.String())
#     date = db.Column(db.String(250), nullable=False)


class Test16(db.Model):
    __tablename__ = "Test_16"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test16")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test17(db.Model):
    __tablename__ = "Test_17"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test17")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test18(db.Model):
    __tablename__ = "Test_18"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test18")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test19(db.Model):
    __tablename__ = "Test_19"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test19")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test20(db.Model):
    __tablename__ = "Test_20"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test20")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Admission(db.Model):
    __tablename__ = "New_Admission"
    user_id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(100))
    mobile_number = db.Column(db.Integer)
    email = db.Column(db.String(100), unique=True)


db.create_all()
db.session.commit()


class RegisterForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Register')


class LoginForm(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Login')


class AdmissionForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    number = StringField("Phone*", validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    submit = SubmitField('Submit')


class ChangeDetails(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    old_password = PasswordField('Old Password*', validators=[DataRequired()])
    new_password = PasswordField('New Password*', validators=[DataRequired()])
    submit = SubmitField('Submit')


student_mails = {
    "mgopalakrishnan075@gmail.com": ["Gopal", 2000],
    "nivir6558@gmail.com": ["Nivetha", 7000],
    "jaya26jj@gmail.com": ["Christy", 5000],
    "srjamuna1003@gmail.com": ["jamuna", 7000],
    "satheshpandian1997@gmail.com": ["Satheshpandian", 4000],
    "lakshmiraja412@gmail.com": ["Rajalaskhmi", 5000],
    "tamilarasanbe9597@gmail.com": ["Anitha", 1000],
    "rajeshkannan6341@gmail.com": ["Rajesh kannan", 3000],
    "jaishreeramgp@gmail.com": ["Yogapriya", 3000],
    "irudhayasubiksha2001@gmail.com": ["Subiksha", 0],
    "abinayaabi257@gmail.com": ["Abi", 1000],
    "shanthirasu1991@gmail.com": ["Shanthi", 0],
    "pradee1296@gmail.com": ["Pradeepa", 5000],
    "jeniferj0204@gmail.com": ["Janifer", 7000],
    "krish47457@gmail.com": ["Krishna", 0],
    "naveenaryan440@gmail.com": ["Naveen", 0],
    "veerasurya250899@gmail.com": ["Suriya", 3000],
    "amin2svg@gmail.com": ["Amin", 3000],
    "jjprincy06@gmail.com": ["Jeba Josepin Princy", 0],
    "jancybetsia20@gmail.com": ["Jancy", 0],
    "cottonpanju9@gmail.com": ["Panju", 2000],
    "rameswariv1999@gmail.com": ["Rameshwari", 2000],
    "vimaladharmar2002@gmail.com": ["Vimala", 1000],
    "devahi1993@gmail.com": ["Devahi", 0],
    "sarojiniganesan96@gmail.com": ["Sarojini", 0],
    "gangadha91@gmail.com": ["Gangadharan", 0],
    "krishnannk498@gmail.com": ["Kamatchi", 0],
    "indhuindhumathi141@gmail.com": ["Indhumathi", 4000],
    "jamespurysh@gmail.com": ["Purushothaman", 0],
    "sivagangainagarajan@gmail.com": ["Nagarajan", 0],
    "matheshsethu22@gmail.com": ["Mathesh", 4000],
    "nagarajnkarthika@gmail.com": ["Karthika", 2000],
    "keviraj482@gmail.com": ["Yogesh", 2000],
    "christyjeslina98@gmail.com": ["Christy", 3500],
    "valarmathi9415@gmail.com": ["Valarmathi", 2000],
}

verified_emails = [mail.strip() for mail in student_mails.keys()]

exam_sites = {

    "15": ["June 14, 2021 10:00:00", "June 14, 2021 13:30:00"],
    "16": ["June 21, 2021 10:00:00", "June 21, 2021 13:30:00"],
    "17": ["June 28, 2021 10:00:00", "June 28, 2021 22:30:00"],
    "18": ["July 05, 2021 10:00:00", "July 05, 2021 13:30:00"],
    "19": ["July 12, 2021 10:00:00", "July 12, 2021 13:30:00"],
    "20": ["July 19, 2021 10:00:00", "July 19, 2021 13:30:00"],

}

sl_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
         31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58,
         59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
         87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
         112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133,
         134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
         156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177,
         178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200]

ques = [' "தமிழ்நாடு நெல் ஆராய்ச்சி நிறுவனம்" தஞ்சாவூர் மாவட்டத்தில் ஆடுதுறை என்னுமிடத்தில் எப்போது தொடங்கப்பட்டது?',
        'Religion - என்ற சொல் எந்த மொழியின் Religio என்ற சொல்லிலிருந்து பெறப்பட்டது? ', 'கடற்கரையில் இருந்து பொதுவாக 20 முதல் 30 மைல்கள் தூரம் வரையிலும், பல 100 அல்லது 1000க்கும் மேற்பட்ட அடிகள் ஆழத்தில் மீன்பிடித்தல் நடக்கிறது இது என அழைக்கப்படுகிறது.', ' தீர்த்தகரர்களின் வாழ்க்கை வரலாற்றைக் கூறும் நூல் எது?', 'தேசிய வருவாய் என்பது ஓர் ஆண்டில் ஒரு நாட்டில் உற்பத்தி செய்யப்பட்ட __________இன் பணமதிப்பாகும் ', 'குருத்வாரா என்பதன் பொருள் என்ன? ', 'தமிழ்நாட்டில் ஏறத்தாழ எவ்வளவு பரப்பளவில் நெல் பயிரிடப்படுகிறது? ', 'தமிழகத்தில் அதிகளவில் சோளம் பயிரிடப்படும் பகுதிகள் எவை? ', 'இந்தியா, எந்த ஆண்டை "தினைப்பயிர்களின்" தேசிய ஆண்டாக அனுசரித்தது?', 'பொருத்துக: \r\n (i) சைவம் - 1.விஷ்ணு \r\n(ii) வைணவம் - 2. சிவன் \r\n(iii) காணபத்தியம் – 3. சூரியன் \r\n(iv) கௌமாரம் - 4. சக்தி \r\n (v) சாக்தம் -5. கணபதி \r\nvi) சௌரம் - 6. முருகன்\r\n', 'கன்னியாகுமரி, திருநெல்வேலி, நாகப்பட்டினம் மற்றும் இராமநாதபுரம் ஆகிய மாவட்டங்கள் மாநிலத்தின் கடல் மீன் உற்பத்தியில் ஏறத்தாழ எத்தனை சதவீதம் பங்களிப்பைத்தருகின்றன?', 'புத்தர் தனது முதல் உரையை எங்குள்ள மான் பூங்காவில் நிகழ்த்தினார்? ', 'ஒரு நாட்டிலுள்ள உழைப்பும் முதலும் சேர்ந்து அங்குள்ள இயற்கை வளங்களை பயன்படுத்தி பண்டங்கள் மற்றும் பணிகளை பயன்படுத்துகின்றன. இதுவே அந்நாட்டின் நிகர ஆண்டு வருமானம்,தேசிய வருவாய் அல்லது தேசிய ஈவுத்தொகை ஆகும் என்றவர் யார்? ', 'தேசிய வருவாயை அளவிடுவதற்கு பயன்படும் கருத்துருக்களில் சேராதது எது? ', 'புத்தமதக் கொள்கைகள் எவ்வாறு அழைக்கப்படுகிறது? ', 'ஓராண்டில் ஒரு நாட்டில் உற்பத்தி செய்யப்பட்ட இறுதிநிலை பண்டங்கள் மற்றும் பணிகளின் மொத்த சந்தை மதிப்பு எவ்வாறு அழைக்கப்படுகிறது? ', 'செலவு முறையைப் பயன்படுத்தி கணக்கிடப்படும் GDP யின் வாய்ப்பாடு என்ன?', 'ஒரு நாட்டில் ஓர் ஆண்டில் உற்பத்தி செய்யப்பட்ட முடிவடைந்த பொருட்கள் மற்றும் பணிகளின் அங்காடி மதிப்பின் மொத்த கணக்கிடுதல் எவ்வாறு அழைக்கப்படுகிறது? ', 'தமிழகத்தில் இரப்பர் தோட்டங்கள் அதிகல் காணப்படும் மாவட்டம்? ', 'தமிழகத்தின் எம்மாவட்டங்களில் நிலக்கடலை உற்பத்தியானது செறிந்து காணப்படுகிறது? ', 'GNPயிலிருந்து தேய்மானத்தின் மதிப்பு, முதலீட்டு சொத்தின் மாற்று கழிவு ஆகியவற்றை கழித்த பின் கிடைப்பது? ', 'NAASCOM என்பது?', 'எவ்விரு தென் மாநிலங்கள் இணைந்து இந்தியாவின் மொத்த மென்பொருள் ஏற்றுமதியில்59.6%ஐ மேற்கொள்கின்றன?', 'தகவல் தொழில்நுட்ப சிறப்புப் பொருளாதார மண்டலமான "டைடல் பூங்கா - 4" எங்குள்ளது? ', 'சீக்கிய சமயத்தின் தனித்த அடையாளங்களான பஞ்ச காக்கர் (5Ks) எனும் ஐந்து அடையாளங்களை வெளியிட்டவர் யார்?', 'தமிழகத்தின் நெற்களஞ்சியம் என்றழைக்கப்படுவது எது? ', 'உலக உணவு மற்றும் வேளாண்மைக் கழகம் (FAO), எந்த ஆண்டை சர்வதேச தினைப்பயிர்கள் ஆண்டாக அனுசரிக்கத் தீர்மானித்துள்ளது? ', 'உயிர்கள் அதன் அடிப்படையில் செயலாற்றுவதாக இந்து சமயம் கூறுகிறது? ', "தமிழக கடற்கரைப் பரப்பில் ஏறத்தாழ ____ ச.கி.மீ பரப்பளவு அளவில் 'கண்டத்திட்டு' உள்ளதால் கடற்கரை மீன்பிடிப்புக்கு சாதகமாக உள்ளது ", 'மீன்பிடித்தலை மேம்படுத்துவதற்காக தமிழ்நாடு மீன் வளத்துறை பல திட்டங்களை அறிமுகப்படுத்தியுள்ளது. அதில் சேராதது எது? ', 'இயற்கை அல்லது கரிம வேளாண்மையின் நோக்கம் என்ன? ', 'துன்பத்தை போக்குவதற்காகப் புத்தர் காட்டியவை எவை? ', 'வெளிநாடுகளில் இருந்து பெற்ற காரணிகளின் வருவாய்க்கும் (கூலி, வட்டி, இலாபம்) நம் நாட்டில் குடியிருக்கும் வெளிநாட்டுகாரர்களுக்கு கொடுக்கப்பட்ட காரணிகளின் வருவாய்க்கும் இடையே உள்ள வேறுபாடு (R - P) எவ்வாரு அழைக்கப்படுகிறது? ', 'கூற்று: தனிநபர் வருமானம் தேசிய வருமானத்திற்கு சமமாக இருக்காது காரணம்: தனிநபர் வருமானத்தோடு மாற்று செலுத்துதல்கள் சேர்க்கப்படுகிறது மற்றும் அரசிடம் இருந்து கிடைத்த ஓய்வு ஊதியம் தனி நபர் வருமானத்துடன் சேர்க்கப்படுகிறது? ', 'தேசிய வருவாயை அளவிடும் மூன்று முறைகளை சரியாகப் பயன்படுத்தி அளவிட்டால், உற்பத்தி, வருமானம், செலவு இம்மூன்றின் மதிப்பும் எவ்வாறு இருக்கும்? ', 'உற்பத்தி முறையில், ஒரு துறையின் வெளியீடு (Output) மற்றொரு துறையின் உள்ளீடு (Input) ஆகச் செல்ல வாய்ப்பு இருப்பதால் ஒரே பொருள் இரு முறை அல்லது பல முறை கணக்கில் வர வாய்ப்பு உள்ளது. இதற்கு என்று பெயர்.', 'ப்யூட்ரா டியூரா முறை எதில் பயன்படுத்தப்பட்டுள்ளது?', 'தமிழகத்தில் அதிகளவில் கம்பு பயிரிடப்படும் பகுதிகள் எவை? ', 'இயற்கை வேளாண்மையை மேம்படுத்தும் நோக்கத்தோடு, மத்திய அரசானது அறிமுகப்படுத்திய திட்டம் எது?', 'தமிழகம் மொத்தம் எத்தனை மீன்பிடித் தளங்களைக் கொண்டுள்ளது?', 'தமிழ்நாட்டின் மேற்பரப்பு நீரில் எத்தனை சதவீதம் பயன்பாட்டில் உள்ளது? ', 'புத்த சமய மாநாடுகளையும் அவற்றிற்கு தலைமை ஏற்றவரையும் பொருத்துக:\r\n (i) முதல் மாநாடு- 1. வசுமித்திரர்\r\n (ii) இரண்டாம் மாநாடு2. மகாகசபர் \r\n(iii) மூன்றாம் மாநாடு-3. சபாசமிகா \r\n(iv) நான்காவது மாநாடு4. மெக்காலி புத்ததிசா \r\n', 'சந்தை விலையில் GNP = ? ', 'கூற்று: தமிழகத்தில் வெப்பமண்டலப் பயிர்கள் மட்டுமே பயிரிடப்படுகின்றன. காரணம்: தமிழ்நாடு பூமத்தியரேகைக்கு அருகிலும், வெப்ப மண்டலத்திலும் அமைந்துள்ளதால் வெப்ப மண்டலக் காலநிலையைப் பெறுகிறது.', 'பின்வருவனவற்றுள் சரியான சமன்பாடு எது? ', 'ஓராண்டில் ஒரு நாட்டில் வசிக்கும் ஒரு நபரின் சராசரி ஆண்டு வருமானம் எவ்வாறு அழைக்கப்படுகிறது?', 'சர்வதேச அளவில் மிகச்சிறந்த பகுதிகளாகவும் ஏற்றுமதியை ஊக்குவிக்கக்கூடிய சூழலைப் பெற்றதாகவும் உள்ளவை?', 'இந்தியாவின் மொத்த பயணிகள் மகிழுந்து உற்பத்தியில் தமிழ்நாட்டின் பங்களிப்பு என்ன?', 'சமண சமய நூல்களான 12 அங்கங்கள் மற்றும் 12 உபஅங்கங்கள் ஆகியவை இறுதி செய்யப்பட்ட மாநாடு எது? ', 'சந்தை விலையில் GNP என்பது?', 'காரணி செலவில் NNP=?', 'கூற்று: உற்பத்தி, வருமானம் & செலவு ஆகிய மூன்று முறைகளும் இயல்பாகவே ஒரு  சுழற்சியாக இருக்கும். \r\nகாரணம்: நுகர்விற்காக உற்பத்தியும், உற்பத்தியின் பலனாக வருமானமும், பிறகு உற்பத்தி காரணிகளுக்கு ஊதியத்தை அளித்து அதன் மூலம் நுகர்வு செலவு செய்யப்படும். \r\n', 'தமிழ்நாட்டில் சிறப்புப்பொருளாதார மண்டலங்கள் அமைந்துள்ள பகுதிகளில் சேராதது எது? ', 'இந்தியாவின் மென்பொருள் ஏற்றுமதியில் தமிழ்நாட்டின் பங்களிப்பு என்ன?', 'அதிக மக்களடர்த்தி கொண்ட மாவட்டங்களில் இரண்டாமிடம் வகிக்கும் மாவட்டம் எது?', 'சிறப்புப் பொருளாதார மண்டலங்களின் (SEZ) நோக்கம் என்ன? ', 'இந்தியாவின் மொத்த "இராசயன மற்றும் வார்ப்புப் பொருள்" உற்பத்தியில் தமிழகத்தின் பங்களிப்பு என்ன?', 'ஒரு ஆண்டின், பொருளாதாரத்தின் நிகர உற்பத்தியின் மதிப்பு என்பது?', 'தமிழ்நாட்டிலுள்ள மொத்த சாலைகளின் நீளம் என்ன?', 'நாம்தாரி மற்றும் நிரங்கரி ஆகிய இரு சீக்கிய சமயப் பிரிவுகளில் நாம்தாரி இயக்கத்தை தோற்றுவித்தவர் யார்?', 'தமிழ்நாட்டின் மிக நீளமான தேசிய நெடுஞ்சாலை எது? ', 'தேய்மானத்தை வேறு எவ்வாறும் கூறலாம்?', 'கூற்று: சமவெளிப் பகுதிகள் வேளாண் தொழிலுக்கு ஏற்றதாக உள்ளது. \r\nகாரணம்: கரிசல் மண் மற்றும் களிமண்ணைக் கொண்டுள்ளதால், சமவெளிப் பகுதிகள் வேளாண் தொழிலுக்கு ஏற்றதாக உள்ளது. \r\n', 'பொருளாதாரத்தின் ஒவ்வொரு துறையிலும் கூட்டப்பட்ட மதிப்பு மூலமாக தேசிய வருவாயை கணக்கிடும் முறை எது? ', 'தமிழகத்தில் அமைந்துள்ள உற்பத்தி நிறுவனங்களில் சேராதது எது? ', 'உற்பத்தி முறையில் தேசிய வருவாயை கணக்கிடும் போது மேற்கொள்ளவேண்டிய முன்னெச்சரிக்கை நடவடிக்கை என்ன? ', 'தமிழகத்தில் மொத்தம் எத்தனை சர்கரை ஆலைகள் உள்ளன? ', '2011ஆம் ஆணுக் கணக்கெடுப்பின்படி, 10 லட்சத்திற்கும் குறைவான மக்கள் தொகையைக் கொண்டுள்ள மாவட்டம் எது? ', 'பருத்தி வளரும் காலத்தில் காலநிலையும், அறுவடை காலத்தில் – காலநிலையும் பயிருக்கு ஏற்றதாகும்.', 'இந்து சமயத்தின் ஆறு உட்பிரிவுகளில் சேராதது எது? ', 'பன்னிரு ஆழ்வார்கள் அருளிய நாலாயிரத் திவ்விய பிரபந்தத்தைதொகுத்தவர் யார்? ', '2017 - 2018 ஆம் ஆண்டில் தமிழ்நாட்டின் கடல் பொருட்களின் ஏற்றுமதி - மெட்ரிக் டன்கள்', 'மாநிலப் பொருளாதாரத்தில், மீன்பிடித்துறையானது எத்தனை சதவீதம் பங்களிப்பை தருகிறது?', 'சாத்தனூர் அணை எம்மலையின் நடுவே அமைந்துள்ளது?', '1895 ஆம் ஆண்டு ஆங்கிலேயர் நிர்வாகத்தால் கட்டப்பட்ட அணை எது?', 'பௌத்த சமயமானது மகாயானம், ஹீனயானம் என்று இரு பிரிவுகளாக பின்வரும்\r\nஎம்மாநாட்டில் பிரிந்தது? \r\n', 'மக்களின் சம்பளம், கூலி, சுய வேலை செய்வோருக்கான சம்பளம், தனியார் துறை வியாபாரம் மூலம் கிடைக்கும் இலாபம் மற்றும் நில உரிமையாளர்கள் பெறும் வாடகை இவற்றின் மூலமாக தேசிய வருவாயை கணக்கிடும் முறை எது? ', 'தமிழகத்தின் எம்மாவட்டத்தில் அதிக அளவு முந்திரி பயிரிடப்படுகிறது? ', 'ஜவுளியின் விலைக்குள் துணியின் விலையும் துணியின் விலையில் நூலின் விலையும் நூலின் விலையில் பஞ்சின் விலையும் உள்ளது எனவே பஞ்சு நூல் துணி ஆடைகள் ஆகியவற்றின் மொத்த மதிப்பினை கூட்டுவது பின்வரும் எந்த பிழைக்கு வழி வகுக்கும்? ', 'சிறப்பு மிக்க பத்துமலை முருகன் சிற்பம் எங்குள்ளது?', 'தமிழகத்தின் ஆண்டு சராசரி மழையளவு எவ்வளவு? ', 'வருமான முறையில், உள்நாட்டு காரணி வருவாய்களுடன் ஏற்றுமதி மற்றும் இறக்குமதியின் நிகர வருவாயை மூலம் தேசிய வருவாய் கணக்கிடப்படுகிறது? ', '2011 ஆம் ஆண்டு கணக்கெடுப்பின்படி, இந்தியாவின் மக்களடர்த்தியில் நமது மாநிலம் எவ்விடத்தில் உள்ளது?', 'ஒரு குறிப்பிட்ட ஆண்டில் விவசாயம், தொழில், வணிகம் போன்ற துறைகளின் உற்பத்தியின் மொத்தமே தேசிய உற்பத்தி என்பது? ', 'லாபம், வட்டி, லாப ஈவு மற்றும் ராயல்டி ஆகியவை? ', '2011ஆம் ஆண்டு மக்கள் தொகை கணக்கெடுப்பின்படி இந்தியாவின் மொத்த மக்கள்தொகையில் தமிழ்நாட்டின் மக்கள் தொகை\r\nஆகும்.\r\n', 'தகவல் தொழில்நுட்ப சிறப்புப் பொருளாதார மண்டலமான "உயிரி மருந்தகம்" எங்குள்ளது? ', 'தமிழ்நாட்டின் முக்கிய எண்ணெய்வித்துப் பயிர் எது?', 'தமிழகத்தில் அதிகளவில் கேழ்வரகு பயிரிடப்படும் பகுதிகள் எவை? ', 'இந்தியப் பரப்பளவில் 4 சதவீதத்தையும், மக்கள் தொகையில் 6 சதவீதத்தையும் கொண்டுள்ள தமிழ்நாடு, இந்திய நீர்வளத்தில் சதவீதத்தை மட்டுமே பெற்றுள்ளது. ', ' "தமிழ்நாடு நெல் ஆராய்ச்சி நிறுவனம்" எவ்வமைப்பின் கீழ் செயல்பட்டு வருகிறது? ', '“மந்திரங்களின் அரசி” எனப் போற்றப்படும் காயத்ரி மந்திரம் எந்த வேதத்தில் இடம்பெற்றுள்ளது?', 'இயற்கை வேளாண்மை அல்லது கரிம வேளாண்மைக்கு விவசாயிகள் திரும்புதல் எவ்வாறு அழைக்கப்படுகிறது?', 'பௌத்த சமயத்தின் புனித நூல் எவ்வாறு அழைக்கப்படுகிறது?', 'உற்பத்தி முறையில் தேசிய வருவாயை கணக்கிடும் போது பின்வரும் எதன் பண மதிப்பை சேர்க்கக்கூடாது?', 'வீடுபேறு அடைய பின்வரும் எதைக் கடைபிடிக்க வேண்டும் என்று சமணம் கூறுகிறது? ', 'சமணசமயத்தின் மிக உயர்ந்த கொள்கை எது?', 'விவசாயம் மற்றும் பண்ணை சிறு தொழில் செய்வோர் மற்றும் பிற வேலையிலிருந்து கிடைக்கும் வருமானம் ஆகியவை? ', 'வேதாந்த நெறிகளையும், அவற்றை உலகிற்களித்தவர்களையும் பொருத்துக: \r\n(i) அத்வைதம்\t- \t\t\t  1. இராமானுஜர் \r\n(ii) விசிஷ்டாத்வைதம் - \t\t  2. மத்துவர். \r\n(iii) துவைதம் \t -  \t\t\t  3. ஆதிசங்கரர் \r\n \t\t   \t  - \t\t \t  4. வசிஷ்ட ர்\r\n', 'பின்வரும் எந்த முறையில் ஓராண்டில் சமுதாயத்தில் உள்ளவர்களால் மேற்கொள்ளப்படும் மொத்த செலவுகள் அனைத்தையும் கூட்டி தேசிய வருவாய் கணக்கிடப்படுகிறது? ', 'தமிழகத்தில் சுற்றுலாத்துறை, எதனால் ஊக்குவிக்கப்படுகிறது? \r\n', '2011 ஆம் ஆண்டு கணக்கெடுப்பின்படி, மாவட்ட அளவில் அதிக அளவு நகர்புற மக்கள் தொகையை கொண்டுள்ள மாவட்டம் எது?\r\n', 'பின்வரும் செய்திகளில் சரியானது எது? \r\n1. தமிழ்நாட்டின முக்கியமான உணவுப்பயிர் நெல் ஆகும் \r\n2. பொன்னி மற்றும் கிச்சடி சம்பா ஆகிய நெல் வகைகள் தமிழகத்தில் பயிரப்படும் முக்கிய நெல் வகைகளாகும்\r\n', ' பின்வரும் செய்திகளில் தவறானதைக் கேர்க: \r\n\r\n', 'ஜீத் என்பதற்கு வெற்றிபெறுதல் என்று பொருள். ஜீனர் என்றால் என்ன பொருள்? \r\n', 'சமணம் கூறும் நல்லறிவு எது? \r\n', 'தமிழகத்தின் மொத்த மழையளவில் தென்மேற்கு பருவக்காற்று காலத்தில் தமிழகம் பெறும் மழை அளவு என்ன?\r\n', 'புத்தரின் முற்பிறப்பு, அவருடைய வாழ்வில் நிகழ்ந்த சம்பவங்களை அடிப்படையாகக் கொண்டு எழுதப்பட்டுள்ளவை? \r\n', '2017 தமிழ்நாடு புள்ளியியல் கையேட்டின்படி, தமிழகத்தில் உள்ள ஏரிகளின் எண்ணிக்கை என்ன? \r\n', 'உற்பத்தி செலவிற்கான உதாரணம் அல்லாதது எது?\r\n', 'கூற்று: அரசுக்கு செலுத்தும் வரிகள் உற்பத்தி செலவில் சேர்க்கப்படுவது இல்லை காரணம்: வரிகள் நேரடியாக உற்பத்தி நடவடிக்கைகளில் பங்கு பெறுவது இல்லை ? \r\n\r\n\r\n\r\n', '2013 ஆண்டில், சுற்றுலாத்துறையின் வருமானத்தின் அடிப்படையில் இந்திய மாநிலங்களில் தமிழகம் வகித்த இடம் என்ன? \r\n\r\n', 'கால்சா அமைப்பை தோற்றுவித்தவர் யார்?\r\n', 'பின்வரும் வாக்கியங்களில் தவறானது எது? \r\n1. தமிழ்நாடு வெப்ப மண்டலத்தில் அமைந்துள்ளதால் தமிழ்நாட்டின் வெப்பநிலை ஆண்டு முழுவதும் அதிகமாக உள்ளது. \r\n2. தமிழ்நாட்டில் நீர், வேளாண்மையைக் கட்டுப்படுத்தும் முக்கியக் காரணியாகும். \r\n3. தென்மேற்கு பருவக்காற்று தமிழ்நாட்டிற்கான முக்கிய நீர் ஆதாரமாக உள்ளதால், பயிரிடப்படும் முக்கிய காலம் இப்பருவத்தில் தொடங்குகிறது. \r\n', 'இந்தியா சுதந்திரமடைந்ததிலிருந்து_%கும் மேற்பட்ட மக்கள் வாழ்வாதாரத்திற்கு வேளாண் துறையைச் சார்ந்துள்ளனர். ', 'கரும்புப் பயிரிட ஏற்ற சூழல் எது? ', '12 சைவத் திருமுறைகளை தொகுத்தவர் யார்?', 'மாநில உள்நாட்டு மீன் உற்பத்தியில் 10 சதவீத உற்பத்தியுடன் முன்னிலையில் உள்ள மாவட்டம் எது?', 'கோயம்புத்தூர் நகரிலிருந்து 80 கி.மீ தொலைவில் அமைந்துள்ள பவானி சாகர் அணை எம்மாவட்டத்தில் அமைந்துள்ளது?', 'கிருஷ்ணகிரி நீர்த்தேக்கம் எத்தனை சதுர கிலோமீட்டர் பரப்பளவிற்குப் பாசனவசதியை அளிக்கிறது?', 'கூற்று: இந்தியாவில், ஒரு சரியான தேசிய வருமானத்தை மதிப்பீடு செய்வதில் எந்த சிரமமும் இல்லை\r\nகாரணம்: இந்தியா ஒரு ஒழுங்குபடுத்தப்படாத, அன்றாட பிழைப்பை நடத்தும் சிறு தொழில்களையும் பண்ட மாற்று அங்காடிகளையும் உள்ளடக்கிய நாடு. ', 'சாத்தனூர் அணையின் முழு அளவு எவ்வளவு? ', 'ஒரு ஆண்டில் உற்பத்தி செய்யப்பட்ட முடிவுற்ற பண்டங்கள் மற்றும் பணிகளின் மொத்த மதிப்பை பண அளவுகளில் குறிப்பிடப்படுவதே?', 'இந்தியாவில் பண்ணை உற்பத்தியின் மொத்த மதிப்பைக் கணக்கிடும்போது, எத்தனை வகை விவசாயப் பொருள்களின் மொத்த உற்பத்தி மதிப்பிடப்படுகிறது?\r\n', 'தேசிய வருவாய் எவ்வாறு அழைக்கப்படுவது இல்லை ? \r\n', 'மேட்டூர் அணை பின்வரும் எம்மாவட்டத்திற்கு நீர்பாசன வசதியை அளிக்கவில்லை?\r\n', 'இந்தியாவின் மொத்த கற்கரை நீளத்தில் தமிழகத்தின் பங்கு எவ்வளவு? \r\n', 'காரணிகள் சம்பாதிக்கும் முறை என்று அழைக்கப்படுவது எது?\r\n', 'தேசிய வருவாய் மதிப்பீட்டில் துல்லிய தன்மை இல்லாமலும், புள்ளி விவரங்கள் போதுமானதாக இல்லாமலும் இருப்பதால், தேசியவருவாயானது எத்தனை சதவீதம் அதிகமாகவோ அல்லது குறைத்தோ மதிப்பிடப்படுகிறது?\r\n', 'சமணம் என்பது எத்தனை தீர்த்தங்கரர்களின் போதனைத் தொகுப்பு ஆகும்?\r\n', 'தமிழகத்தில், கொண்டைக்கடலை உற்பத்தியில் எம்மாவட்டம் முதலிடம் வகிக்கிறது?\r\n', 'தேயிலை பயிரிடப்படும் பரப்பின் அடிப்படையில், தமிழகம் எவ்விடத்தில் உள்ளது?\r\n', 'இந்தியாவில் "ஏழை மக்களின் பசு" என்றழைக்கப்படுவது எது? \r\n', 'அமராவதி நீர்த்தேக்கத்தில் எவ்வகை முதலைகள் காணப்படுகின்றன?\r\n', 'சாத்தனூர் அணையில் அமைந்துள்ளவைகளில் சேராதது எது? \r\n\r\n', 'சமணப் புனித நூலான ஆகமசித்தாந்தம் எத்தனை அங்கங்களைக் கொண்டது?\r\n', 'தேய்மானத்தின் மதிப்பை GDPயிலிருந்து கழித்துவிட்டால் கிடைப்பது எது?\r\n', 'மொத்த உள்நாட்டு உற்பத்திக்கு சந்தையில் நிலவும் விலை பயன்படுத்தப்பட்டால் அது எவ்வாறு அழைக்கப்படுகிறது? \r\n', 'ஒரு நாட்டில் மொத்த உள்நாட்டு உற்பத்தி வரையறுக்கப்பட்ட நிலையில் தேசிய வருமானம் அளவிடப்படுவதன் மூலம் அந்நாட்டின் நலத்தை அறிய முடியும்...  அதிக வளர்ச்சிக்கான இலக்குகள் எதற்காக எப்படி என்பதை வரையறுக்க வேண்டும் என்றவர் யார்? \r\n\r\n', ' நாட்டின் மென்பொருள் ஏற்றுமதியில் தமிழ்நாடு வகிக்கும் இடம் என்ன?\r\n', '2011 மக்கள்தொகை கணக்கெடுப்பின்படி தமிழகத்தின் கல்வியறிவு விகிதம் எவ்வளவு?\r\n\r\n', ' தமிழ்நாட்டிலுள்ள மொத்த இருப்புப் பாதையின் நீளம் எவ்வளவு? \r\n', ' தமிழ்நாட்டின் மிகக் குறைவான நீளங்கொண்ட தேசிய நெடுஞ்சாலை எது?\r\n\r\n', 'தமிழ்நாட்டில் மொத்தம் எத்தனை முக்கிய மீன்பிடித் துறைமுகங்கள் உள்ளன?\r\n\r\n', 'உடுமலைப் பேட்டையில் இருந்து ஏறத்தாழ 25 கி.மீ தொலைவில் அமைந்துள அமராவதி அணை எம்மாவட்டத்தில் உள்ளது? \r\n', ' தமிழகத்தில் துவரம் பருப்பு அதிகம் உற்பத்தி செய்யப்படும் மாவட்டங்கள் எவை? \r\n\r\n', 'தமிழகத்தில் கொள்ளுப்பயறு அதிகமாக உற்பத்தி செய்யப்படும் மாவட்டங்கள் எவை?\r\n', ' தீர்த்தங்கரர் என்னும் சொல்லின் பொருள் என்ன?\r\n', 'பவாணி ஆற்றின் குறுக்கே கட்டப்பட்ட பவானி சாகர் அணை, கலவையால் கட்டப்பட்ட நாட்டின் மிகப்பெரிய அணைகளில் ஒன்றாகும்\r\n', 'செங்கம் தாலுகாவில் தென்பெண்ணை ஆற்றின் குறுக்கேக் கட்டப்பட்டுள்ள அணை எது?\r\n\r\n', 'முல்லைப்பெரியாறு அணையின் உயரம் மற்றும் நீளம் முறையே என்ன?\r\n', 'ஓராண்டில் பொருளாதாரத்தின் உற்பத்தி அமைப்பிலிருந்து பண்டங்களும் பணிகளும் உற்பத்தி செய்யப்பட்டு நிகர வெளியீடாக அவை இறுதிநிலை நுகர்வோரின் கைகளுக்கு செல்கின்றன அல்லது அந்த நாட்டில் இருக்கக்கூடிய மூலதன பொருட்களின் கூடுதலாக சேர்கின்றன என்று கூறியவர் யார்? \r\n', 'ஓர் ஆண்டில் ஒரு நாட்டில் ஏற்படும் தேய்மானத்தை கழித்த பிறகு கிடைக்கும் நிகர உற்பத்தி\r\nஎவ்வாறு அழைக்கப்படுகிறது? \r\n', 'ஆண்டிப்பட்டிக்கு அருகே வைகை ஆற்றின் குறுக்கே கட்டப்பட்டுள்ள வைகை அணையின் உயரம் என்ன?\r\n\r\n', 'வைகை அணையில் எத்தனை அடி உயரம் வரை மட்டுமே நீரை சேமிக்க முடியும்?\r\n', 'தமிழகத்தில் பயன்படுத்திக்கொள்ளத்தக்க நிலத்தடி நீர்வளம்_ மில்லியன் கன மீட்டர் ஆகும்.\r\n', 'ஒரு ஆண்டில் ஒரு நாட்டில் வசிக்கும் ஒவ்வொரு தனிநபருக்கும் பல வழிகளில் இருந்து கிடைக்கப்பெறும் மொத்த வருமானம் எவ்வாறு அழைக்கப்படுகிறது? \r\n', 'தனிநபர் வருமானத்தில் இருந்து நேர்முக வரிகளை கழித்தால் கிடைப்பது எது? \r\n\r\n', 'தமிழ்நாட்டின் தனிநபர் நீர்நுகர்வின் அளவு என்ன?\r\n\r\n', 'வளைந்து நெளிந்து செல்லும் மலைப்பாதை வழியாக செல்லும் படகு சவாரி மற்றும் நீர்விழ்ச்சிகள் எவ்வணையின் அருகே காணப்படுகின்றன? \r\n', 'திருநெல்வேலியிலிருந்து 49கி.மீ தொலைவில் அமைந்துள்ள பாபநாசம் அணை வேறு எவ்வாறு அழைக்கப்படுகிறது? \r\n\r\n', ' பரம்பிக்குளம் ஆழியாறு திட்டம், எவ்விரு மாவட்டங்களின் கூட்டு முயற்சியால் உருவாக்கப்பட்டது? \r\n\r\n', 'இந்தியாவின் மொத்த செம்மணிக்கல் உற்பத்தியில் தமிழ்நாட்டின் பங்களிப்பு என்ன? \r\n', 'தலா வருமானம் =?\r\n', 'ஒரு நாட்டின் உற்பத்தியை கணக்கிடும் உற்பத்தி முறை (Product Method), வேறு எவ்வாறு அழைக்கப்படுகிறது?\r\n', 'இந்தியாவின் மொத்த பழுப்பு நிலக்கரி உற்பத்தியில் தமிழ்நாட்டின் பங்களிப்பு என்ன?\r\n', 'உற்பத்தி நிலைகளில் உற்பத்தி காரணிகள் பெற்ற அனைத்துவித ஊதியங்களையும் கூட்டி தேசிய வருமானத்தை கணக்கிடும் முறை எது?\r\n', 'கூற்று: புவியில் காணப்படும் வளங்களில் மிகச்சிறந்த வளம் இயற்கை வளமே ஆகும்\r\nகாரணம்: மனிதர்கள் தங்களது திறன்கள் மூலம் இயற்கை வளங்களைப், பயன்படுத்தகூடிய பொருட்களாக மாற்றுகின்றனர்.\r\n', ' "அக்ரிகல்சர்" என்ற சொல் -- வார்த்தைகளான "அகர்" மற்றும் "கல்சரா" என்பதிலிருந்து பெறப்பட்டது. \r\n\r\n', 'வைணவக் கொள்கைகளை நெறிப்படுத்தி விளக்கியவர் யார்?\r\n', '2017 தமிழ்நாடு புள்ளியியல் கையேட்டின்படி, தமிழகத்தில் உள்ள மொத்த நீர்த்தேக்கங்களின் எண்ணிக்கை என்ன? \r\n', 'வைகை அணையில் அமைந்துள்ள தோட்டம் எவ்வாறு அழைக்கப்படுகிறது? \r\n\r\n', 'வேலூர் மற்றும் அதனைச் சுற்றியுள்ள இராணிப்பேட்டை, ஆம்பூர் மற்றும் வாணியம்பாடி நகரங்களில் நூற்றுக்கணக்கில் அமைந்துள்ள தொழிலகங்கள் யாவை? \r\n\r\n', 'முதல் சமண சமய மாநாடு, கி.மு. 3-ஆம் நூற்றாண்டில் பாடலிபுத்திர நகரில் யார் தலைமையில் நடைபெற்றது? \r\n\r\n', 'மத்திய தோல் ஆராய்ச்சி நிறுவனம் & ஆராய்ச்சியகம் (CLRI) எங்கு அமைந்துள்ளது? \r\n', 'தேசிய வருவாய் பற்றிய கருத்துருவை முதன் முதலில் அறிமுகப்படுத்திய நோபல் பரிசு பெற்ற அறிஞர் யார்? \r\n', 'GNP - ல் எத்தனை வகையான முடிவடைந்த பொருட்கள் மற்றும் பணிகள் உள்ளன?\r\n', 'ஒரு சதுர கிலோ மீட்டருக்கு 26,903 மக்களடர்த்தி கொண்ட தமிழக மாவட்டம் எது?\r\n', 'நெல் உற்பத்தி செய்யும் இந்திய மாநிலங்களில் தமிழகம் எவ்விடம் வகிக்கிறது? \r\n', 'சேலம் மாவட்டத்தில் உள்ள கஞ்சமலையிலும் திருவண்ணாமலை மாவட்டத்தில் உள்ள கல்வராயன் மலையிலும் காணப்படும் தாதுப் படிவு எது? \r\n', 'இந்தியாவின் ஜவுளி ஏற்றுமதியில் தமிழ்நாட்டின் பங்களிப்பு எவ்வளவு?\r\n', 'ஏறத்தாழ 1,060 மீட்டர் முதல் 1,280 மீட்டர் உயரம் வரை உள்ள ஆனைமலைப் பகுதிகளில் பயிரிடப்படுவது?\r\n', 'அரசு என்பது "ஒன்று சேர்க்கப்பட்ட நபர்கள்” எனக் குறிப்பிடுபவர்கள் யார்?\r\n', 'கோயம்புத்தூர், திருப்பூர் & ஈரோடு மாவட்டங்கள் நெசவுத்தொழில் மூலம் தமிழகத்தின் பொருளாதாரத்திற்கு முக்கிய பங்களிப்பதால் அவை எவ்வாறு அழைக்கப்படுகின்றன? \r\n\r\n', 'தமிழ்நாட்டின் நெசவுத் தலைநகரம் என்றழைக்கப்படுவது எது? \r\n\r\n', 'இந்தியாவின் பட்டு உற்பத்தியில் தமிழகம் வகிக்கும் இடம் என்ன?\r\n\r\n', 'தமிழக அரசு நிறுவனமான தமிழ்நாடு செய்தித்தாள் மற்றும் காகித நிறுவனம் (TNPL) எங்கு அமைந்துள்ளது? \r\n', 'இந்தியா, 181 மில்லியன் டன்கள் வருடாந்திர சிமெண்ட் உற்பத்தியுடன் உலகில் எவ்விடத்தை வகிக்கும் நாடாக உள்ளது? \r\n', 'ஒவ்வொரு இஸ்லாமியரும் ஒரு நாளைக்கு ஐந்து முறை எதை நோக்கி தொழுகை செய்ய வேண்டும் என்று இஸ்லாம் கூறுகிறது?\r\n', 'ஒரு குறிப்பிட்ட புவியியல் பிரதேசத்தில் தயாரிக்கப்படும் பொருட்களின் மீது பயன்படுத்தப்படும் "குறிப்பு" எவ்வாறு அழைக்கப்படுகிறது? \r\n', 'இந்தியாவின் மொத்த மென்பொருள் ஏற்றுமதியில் அதிகமான பங்களிப்பை செய்து வருபவை? \r\n\r\n', '2011 மக்கள்தொகை கணக்கெடுப்பின்படி தமிழகத்தின் 32 மாவட்டங்களில் எத்தனை மாவட்டங்களின் பாலின விகிதம் ஆயிரத்திற்கும் அதிகமாக இருந்தது?\r\n', ' 2017 தமிழ்நாடு புள்ளியியல் கையேட்டின்படி, தமிழ்நாட்டிலுள்ள தேசிய நெடுஞ்சாலைகளின் நீளம் என்ன?\r\n', 'தெற்கு இரயில்வேயின் தலைமையகம் எங்கு அமைந்துள்ளது?\r\n\r\n', 'சென்னை சர்வதேச விமானநிலையமானது இந்தியாவின் எப்பெரிய விமானநிலையமாக\r\nஉள்ளது?\r\nதமிழ்நாட்டின் மூன்று முக்கிய துறைமுகங்கள் யாவை? \r\n', 'தமிழ்நாட்டின் மூன்று முக்கிய துறைமுகங்கள் யாவை? \r\n', 'பின்வருவனவற்றுள் செயற்கைத் துறைமுகம் எது? \r\n', 'இடைநிலைத்துறைமுகமாக இருந்து சமீபத்தில் பெரிய துறைமுகமாக மேம்படுத்தப்பட்டு தமிழகத்தில் அதிக நிலக்கரி மற்றும் தாதுக்களைக் கையாளும் துறைமுகமாக உள்ளது எது? \r\n ', ' பேரிடர் அவரசர கால தொலைபேசி எண் என்ன? \r\n', 'மாநிலப் பேரிடர் மேலாண்மை ஆணையத்தின் தலைவர் யார்? \r\n']

a = ['A) 1988 மே \r', 'A) கிரேக்கம்\r', 'A) பெருங்கடல் மீன்பிடிப்பு \r', 'A) கல்ப காயல்யம்\r',
     'A) மொத்த பண்டங்கள் மற்றும் பணிகளின் \r', 'A) குருவை அடையும் வழி \r', 'A) 1 மில்லியன் ஹெக்டேர் \r', 'A) கோயம்புத்தூர் பீடபூமியிலும், கம்பம் பள்ளத்தாக்கிலும் \r', 'A) 2016\r', 'A) 2 3 4 5 6 1 \r', 'A) 80\r', 'A) பாடலிபுத்திரம்\r', 'A) சைமன் குஷ்நெட்ஸ் \r', 'A) GDP\r', 'A) மூன்று பேருண்மைகள்\r', 'A) நிகர தேசிய உற்பத்தி (NNP) \r', 'A) GDP= C +1+G + (X + M) \r', 'A) மொத்த உள்நாட்டு உற்பத்தி (GDP)\r', 'A) தேனி\r', 'A) வேலூர் & திருவண்ணாமலை\r', 'A) நிகர தேசிய உற்பத்தி\r', 'A) தேசிய மென்பொருள் தொழில்நுட்பம் & சேவைகள் நிறுவன கூட்டமைப்பு\r', 'A) தமிழ்நாடு & கர்நாடகா \r', 'A) திருச்சி \r', 'A) பத்தாவது குரு கோவிந்த்சிங்\r', 'A) ஒருங்கிணைந்த தஞ்சை மாவட்டம் \r', 'A) 2020\r', 'A) கர்மா\r', 'A) 48,412 \r', 'A) பண்ணைக் குளங்கள் மற்றும் நீர்பாசன ஏரிகளில் மீன் வளர்ப்பு \r', 'A) லாபம்\r', 'A) பஞ்ச மார்க்கம் - ஐந்து நல்வழிகள் \r', 'A) நிகர ஏற்றுமதி\r', 'A) கூற்றும் காரணமும் சரி மேலும் காரணம் கூற்றை சரியாக விளக்குகிறது \r', 'A) உற்பத்தி < வருமானம் <செலவு \r', 'A) ஒருமுறைக் கணக்கிடல்\r', 'A) தாஜ்மஹால்\r', 'A) கோயம்புத்தூர் பீடபூமியிலும், கம்பம் பள்ளத்தாக்கிலும் \r', 'A) தேசிய கரிம வேளாண்மைத் திட்டம் \r', 'A) 363 \r', 'A) 98 சதவீதத்திற்கு அதிகமாக\r', 'A) 1 2 3 4 \r', 'A) சந்தை விலையில் GDP/ வெளிநாட்டிலிருந்து கிடைக்கும் நிகர வருமானம் \r', 'A) கூற்றும் காரணமும் சரி; காரணம் கூற்றுக்கான சரியான விளக்கமே \r', 'A) NNP = GNP + தேய்மான கழிவு \r', 'A) தலா வருமானம்\r', 'A) ஸ்மார்ட் நகரங்கள் \r', 'A) 12% \r', 'A) முதல் சமண சமய மாநாடு\r', 'A) C+I+G+(X-M) + (R+P) \r', 'A) சந்தை விலையில் NNP - மறைமுக வரி + மானியம்\r', 'A) கூற்றும் காரணமும் சரி; காரணம் கூற்றுக்கு சரியான விளக்கமாகும்\r', 'A) நாங்குநேரி\r', 'A) 8%\r', 'A) கன்னியாகுமரி\r', 'A) வணிக சமநிலையை அதிகரித்தல்\r', 'A) 8% \r', 'A) நிகர உள்நாட்டு உற்பத்தி\r', 'A) 167000 கி.மீ\r', 'A) கோவிந்த் சிங்\r', 'A) NH - 41\r', 'A) மூலதன நுகர்வுப் பொருள் \r', 'A) கூற்றும் காரணமும் சரி; காரணம் கூற்றுக்கான சரியான விளக்கமே \r', 'A) உற்பத்தி முறை \r', 'A) ஃபோர்டு\r', 'A) பலமுறை கணக்கில் சேர்த்தல் என்ற பிழையை தவிர்க்க வேண்டும் \r', 'A) 16 \r', 'A) கிருஷ்ண கிரி\r', 'A) ஈரப்பத, வறண்ட \r', 'A) வைணவம் & காணாபத்யம்\r', 'A) ஆண்டாள்\r', 'A) 62,644\r', 'A) 7.5%\r', 'A) சென்ன கேசவ மலை\r', 'A) பரம்பிக்குளம் ஆழியாறு நீர்த்தேக்கம் \r', 'A) முதல் பௌத்த மாநாடு \r', 'A) உற்பத்தி முறை\r', 'A) பெரம்பலூர்\r', 'A) பலமுறை கணக்கில் சேர்த்தல்\r', 'A) சிங்கப்பூர்\r', 'A) 930 மி.மீ\r', 'A) கூட்டுவதன் மூலம்\r', 'A) 3\r', 'A) உற்பத்தி முறை \r', 'A) உழைப்பாளர் வருமானம் \r', 'A) 8.96%\r', 'A) சென்னை\r', 'A) எள்\r', 'A) கோயம்புத்தூர் பீடபூமியிலும், கம்பம் பள்ளத்தாக்கிலும்\r', 'A) 1.1\r', 'A) இந்திய வேளாண் உற்பத்தி கழகம்\r', 'A) ரிக்\r', 'A) உண்மையான பசுமைப்புரட்சி\r', 'A) திரிரத்தினம்\r', 'A) முதன் முறையாக வாங்கப்பட்ட கைபேசி \r', 'A) திரி பீடகங்கள் \r', 'A) சியாத்வாதம் அல்லது அநேகாந்தவாதம் \r', 'A) உழைப்பாளர் வருமானம்\r', 'A) 4         1         3\r', 'A) காரணி வருவாய் முறை\r', 'A) தமிழ்நாடு சுற்றுலா வளர்ச்சி சம்மேளனம்\r', 'A) சென்னை\r', 'A) 1 மட்டும்\r', 'A) மாநிலத்தின் பொருளாதாரத்தில் வேளாண்மையே பிரதானமாக இருந்து வருகிறது. \r', 'A) புலன்களை வெற்றிகொண்டவர்\r', 'A) இந்த உலகம் கடவுளால் படைக்கப்பட்டது \r', 'A) 47%\r', 'A) தேராகதைகள்\r', 'A) 41,127 \r', 'A) இயந்திரங்களை வாடகைக்கு எடுத்தல்\r', 'A) கூற்றும் காரணமும் சரி மேலும் காரணம் கூற்றை சரியாக விளக்குகிறது \r', 'A) முதலிடம்\r', 'A) பாபா தயாள் தாஸ்\r', 'A) 1 மட்டும்\r', 'A) 80% \r', 'A) குறைந்த வெப்பநிலை மற்றும் அதிகமழைப் பொழிவு \r', 'A) நாதமுனி \r', 'A) திருப்பூர் \r', 'A) திருப்பூர் \r', 'A) 5,428\r', 'A) கூற்றும் காரணமும் சரி \r', 'A) 119 அடிகள்\r', 'A) உண்மை வருமானம்\r', 'A) 36\r', 'A) பொருளாதாரத்தின் கணக்கு \r', 'A) கரூர்\r', 'A) 24%\r', 'A) செலவு முறை \r', 'A) 5%\r', 'A) 12 \r', 'A) திண்டுக்கல்\r', 'A) முதலிடம்\r', 'A) எருமை \r', 'A) தேங்கன்னி முதலைகள் \r', 'A) பெரிய முதலைப்பண்ணை \r', 'A) 8 \r', 'A) GDP \r', 'A) சந்தை விலையின் GDP \r', 'A) சைமன் குஷ்நெட்ஸ்\r', 'A) முதலிடம்\r', 'A) 80.09%\r', 'A) 7,693 கி.மீ\r', 'A) NH - 685 \r', 'A) 8\r', 'A) திருப்பூர் \r', 'A) திருவள்ளூர் & கன்னியாகுமரி \r', 'A) தர்மபுரி & கிருஷ்ண கிரி \r', 'A) சமயங்களை கடந்த ஞானி\r', 'A) சுண்ணாம்பு - மண்\r', 'A) செங்கம் அணை\r', 'A) 155 அடி & 1,400 அடி\r', 'A) சைமன் குஷ்நெட்ஸ் \r', 'A) மொத்த உள்நாட்டு உற்பத்தி (GDP) \r', 'A) 121 அடி\r', 'A) 71 அடி\r', 'A) 22,433 \r', 'A) தலா வருமானம்\r', 'A) தலா வருமானம்\r', 'A) 850 கன மீட்டர்\r', 'A) பாபநாசம் அணை \r', 'A) பாவசுத்தி அணை \r', 'A) தமிழகம் & கர்நாடகா\r', 'A) 75% \r', 'A) தேசிய வருமானம் * மக்கள் தொகை \r', 'A) செலவு கூட்டு முறை \r', 'A) 75% \r', 'A) செலவு முறை\r', 'A) கூற்றும் காரணமும் சரி; காரணம் கூற்றுக்கான சரியான விளக்கமே\r', 'A) கிரேக்கம் \r', 'A) ஆதிசங்கரர் \r', 'A) 41,127 \r', 'A) இரண்டாம் பிருந்தாவனம்\r', 'A) தோல் பதனிடும் தொழிலகங்கள்\r', 'A) தேவாதி க்ரஷ்மர்மனா \r', 'A) வேலூர் \r', 'A) ஆல்ஃபிரட் மார்ஷல் \r', 'A) 3 \r', 'A) சென்னை\r', 'A) முதலிடம்\r', 'A) தாமிரப் படிவுகள்\r', 'A) 20%\r', 'A) மிளகு\r', 'A) எடி & பீகாக்\r', 'A) தமிழ்நாட்டின் ஜவுளிக் கடல்\r', 'A) கோயம்புத்தூர்\r', 'A) முதலிடம்\r', 'A) கரூர்\r', 'A) முதலிடம் \r', 'A) புனித காபா\r', 'A) புவியியல் குறியீடு\r', 'A) தென் மாநிலங்கள் \r', 'A) 10 \r', 'A) 57,291 கி.மீ\r', 'A) ஹைதராபாத் \r', 'A) முதலாவது\r', 'A) சென்னை, எண்ணூர் & தூத்துக்குடி\r', 'A) சென்னை \r', 'A) சென்னை\r', 'A) 1088\r', 'A) மாநில முதன்மைச் செயலாளர் \r']

b = ['B) 1987 ஆகஸ்ட் \r', 'B) இலத்தீன்\r', 'B) உள்நாட்டு மீன்பிடிப்பு \r', 'B) கல்ப சூத்திரம்\r',
     'B) நிகர பண்டங்கள் மற்றும் பணிகளின் \r', 'B) குருவின் கோயில் \r', 'B) 2 மில்லியன் ஹெக்டேர் \r', 'B) இராமநாதபுரம், திருநெல்வேலி, கரூர், பெரம்பலூர் & சேலம்\r', 'B) 2017 \r', 'B) 2 1 5 6 4 3\r', 'B) 30 \r', 'B) சாரநாத்\r', 'B) ஆல்ஃபிரட் மார்ஷல் \r', 'B) GNP\r', 'B) நான்கு பேருண்மைகள் \r', 'B) மொத்த உள்நாட்டு உற்பத்தி (GDP) \r', 'B) GDP = C+1+G - (X - M) \r', 'B) நிகர தேசிய உற்பத்தி (NNP) \r', 'B) திண்டுக்கல் \r', 'B) விழுப்புரம் & சேலம் \r', 'B) நிகர தேசிய உற்பத்தி \r', 'B) தேசிய தொழில்நுட்பம் & சேவைகள் நிறுவன கூட்டமைப்பு \r', 'B) தமிழ்நாடு & ஆந்திரபிரதேசம்\r', 'B) ஓசூர் \r', 'B) ஏழாம் குரு ஹர் ராய் \r', 'B) தற்போதைய தஞ்சை மாவட்டம் \r', 'B) 2021\r', 'B) புனர்ஜென்மம் \r', 'B) 45,412 \r', 'B) மீன்குஞ்சுகள் பொறிப்பகம் & மீன் குஞ்சு வளர்ப்பகம் \r', 'B) மண்வளப் பாதுகாப்பு \r', 'B) சப்த மார்க்கம் - ஏழு நல்வழிகள் \r', 'B) நிகர இறக்குமதி \r', 'B) கூற்று சரி; காரணம் தவறு \r', 'B) உற்பத்தி > வருமானம் > செலவு\r', 'B) இருமுறை கணக்கிடல் \r', 'B) ஷார்மினார்\r', 'B) இராமநாதபுரம், திருநெல்வேலி, கரூர், பெரம்பலூர் & சேலம் \r', 'B) தேசிய கனிம வேளாண்மைத் திட்டம்\r', 'B) 463 \r', 'B) 90 சதவீதத்திற்கு குறைவாக \r', 'B) 4 3 2 1\r', 'B) சந்தை விலையில் GDP - வெளிநாட்டிலிருந்து கிடைக்கும் நிகர வருமானம். \r', 'B) கூற்றும் காரணமும் சரி; காரணம் கூற்றுக்கான சரியான விளக்கமல்ல\r', 'B) NNP = GNP - தேய்மான கழிவு \r', 'B) தனிநபர் வருமானம் \r', 'B) தொழில் நகரங்கள் \r', 'B) 8% \r', 'B) இரண்டாவது சமண சமய மாநாடு \r', 'B) C+1+G+(X-M) + (R-P) \r', 'B) சந்தை விலையில் NNP - மறைமுக வரி - மானியம் \r', 'B) கூற்று சரி; காரணம் தவறு \r', 'B) எண்ணூர் \r', 'B) 12% \r', 'B) திருவள்ளூர் \r', 'B) வேலை & முதலீட்டை அதிகரித்தல் \r', 'B) 21% \r', 'B) நிகர தேசிய உற்பத்தி \r', 'B) 267000 கி.மீ \r', 'B) பாபா ராம் சிங் \r', 'B) NH - 42\r', 'B) மூலதன் நுகர்ச்சி சேர்ப்பு\r', 'B) கூற்றும் காரணமும் சரி; காரணம் கூற்றுக்கான சரியான விளக்கமல்ல \r', 'B) காரணி வருவாய் முறை\r', 'B) பென்ஸ்\r', 'B) சொந்த நுகர்வுக்கு பயன்படுத்தப்பட்ட பொருட்களின் மதிப்பையும் தேசிய வருவாய் கணக்கில் சேர்த்துக் கொள்ள வேண்டும்\r', 'B) 18\r', 'B) நீலகிரி\r', 'B) வறண்ட, ஈரப்பத \r', 'B) சைவம் & கௌமாரம்\r', 'B) நாதமுனிகள் \r', 'B) 72,644 \r', 'B) 1.25%\r', 'B) கேசவ சந்திர மலை \r', 'B) முல்லைப்பெரியாறு அணை\r', 'B) இரண்டாம் பௌத்த மாநாடு \r', 'B) காரணி வருவாய் முறை \r', 'B) கடலூர்\r', 'B) ஒருமுறை கணக்கில் சேர்த்தல்\r', 'B) மியான்மர் \r', 'B) 880 மி.மீ\r', 'B) கழிப்பதன் மூலம் \r', 'B) 8\r', 'B) காரணி வருவாய் முறை\r', 'B) மூலதன வருமானம் \r', 'B) 7.96%\r', 'B) திருச்சி \r', 'B) ஆமணக்கு\r', 'B) இராமநாதபுரம், திருநெல்வேலி, கரூர், பெரம்பலூர் & சேலம் \r', 'B) 2.5 \r', 'B) இந்திய வேளாண் ஆராய்ச்சி நிறுவனம்\r', 'B) யஜூர்\r', 'B) முதலாவது பசுமைப்புரட்சி\r', 'B) திரிமூர்த்தி\r', 'B) இரண்டாம் முறையாக கைமாற்றப்பட்ட கைபேசி \r', 'B) திரி ஸ்லோகங்கள் \r', 'B) சத்யாத்வாதம் அல்லது நேகாந்தவாதம் \r', 'B) மூலதன வருமானம் \r', 'B) 4         3            1\r', 'B) செலவு முறை\r', 'B) தமிழ்நாடு சுற்றுலா மேம்பாட்டுக் கழகம்\r', 'B) திருச்சி\r', 'B) 2 மட்டும் \r', 'B) வேளாண்மை, கிராமப்புற மக்களுக்கு பெருமளவில் வேலை வாய்ப்பை அளிக்கிறது. \r', 'B) வாழ்வை வெற்றிகொண்டவர் \r', 'B) இந்த உலகம் மகாவீரரால் படைக்கப்பட்டது \r', 'B) 35%\r', 'B) தேரிகதைகள் \r', 'B) 81 \r', 'B) இயந்திரம் வாங்குதல்\r', 'B) கூற்று சரி; காரணம் தவறு \r', 'B) இரண்டாமிடம்\r', 'B) குரு கோபிந்த் சிங் \r', 'B) 2ம் 3ம்\r', 'B) 72 % \r', 'B) அதிக வெப்பநிலை மற்றும் அதிகமழைப் பொழிவு\r', 'B) அப்பர்\r', 'B) கன்னியாகுமரி \r', 'B) சேலம்\r', 'B) 4,428 \r', 'B) கூற்று சரி; காரணம் தவறு \r', 'B) 99 அடிகள்\r', 'B) மொத்த வருமானம்\r', 'B) 32 \r', 'B) சமூக கணக்கு \r', 'B) சேலம்\r', 'B) 4% \r', 'B) உற்பத்தி முறை\r', 'B) 10% \r', 'B) 18 \r', 'B) தேனி \r', 'B) இரண்டாமிடம்\r', 'B) மான்\r', 'B) அவிட்ட முதலைகள்\r', 'B) பெரிய பாம்புப்பண்ணை\r', 'B) 10 \r', 'B) NDP \r', 'B) உற்பத்தி விலையின் GDP \r', 'B) ஆல்ஃபிரட் மார்ஷல் \r', 'B) இரண்டாமிடம்\r', 'B) 73.45% \r', 'B) 6,693 கி.மீ\r', 'B) NH - 785 \r', 'B) 3\r', 'B) சேலம் \r', 'B) வேலூர் & கன்னியாகுமரி \r', 'B) சேலம் & ஈரோடு \r', 'B) அனைத்தையும் கடந்த ஞானி\r', 'B) சுண்ணாம்பு - கல் \r', 'B) பாபநாசம் அணை\r', 'B) 165 அடி & 1,300 அடி\r', 'B) ஆல்ஃபிரட் மார்ஷல் \r', 'B) நிகர தேசிய உற்பத்தி (NNP) \r', 'B) 111 அடி\r', 'B) 81 அடி\r', 'B) 32,433\r', 'B) ஆண்டு வருமானம் \r', 'B) ஆண்டு நிகர வருமானம் \r', 'B) 900 கன மீட்டர்\r', 'B) பரம்பிக்குளம் அணை\r', 'B) கரையார் அணை \r', 'B) தமிழகம் & தெலுங்கானா \r', 'B) 59%\r', 'B) தேசிய வருமானம் / மக்கள் தொகை\r', 'B) காரணி முறை \r', 'B) 59% \r', 'B) உற்பத்தி முறை \r', 'B) கூற்றும் காரணமும் சரி; காரணம் கூற்றுக்கான சரியான விளக்கமல்ல \r', 'B) பாரசீகம் \r', 'B) ஜெயேந்திரர் \r', 'B) 81\r', 'B) நந்தவனம் \r', 'B) காகித தொழிலகங்கள்\r', 'B) புஷ்பதந்தர் \r', 'B) இராணிப்பேட்டை\r', 'B) சாமுவெல்சன்\r', 'B) 4 \r', 'B) கோயம்புத்தூர் \r', 'B) ஐந்தாமிடம்\r', 'B) டைட்டானியம் படிவுகள் \r', 'B) 45% \r', 'B) ஏலம்\r', 'B) ஸ்வான் & மர்ஃபி \r', 'B) தமிழ்நாட்டின் ஜவுளிக் களஞ்சியம்\r', 'B) திருப்பூர் \r', 'B) இரண்டாமிடம் \r', 'B) ஈரோடு \r', 'B) இரண்டாமிடம் \r', 'B) புனித சர்வாசா \r', 'B) சிறப்புக் குறியீடு \r', 'B) வட மாநிலங்கள் \r', 'B) 15 \r', 'B) 23,350 கி.மீ\r', 'B) கோயம்புத்தூர் \r', 'B) இரண்டாவது\r', 'B) சென்னை, நாகை & தூத்துக்குடி \r', 'B) எண்ணூர்\r', 'B) எண்ணூர் \r', 'B) 1066\r', 'B) நிவாரண பேரிடர் மேலாண்மைத்துறை அமைச்சர் \r']

c = ['C) 1986 ஜூலை \r', 'C) பிரஞ்சு \r', 'C) ஆழ்கடல் மீன்பிடிப்பு \r', 'C) பஸ்லோகம் \r', 'C) A & B\r', 'C) குரு காட்டும் வழி \r',
     'C) 3 மில்லியன் ஹெக்டேர்\r', 'C) கோயம்புத்தூர் த ஸமற்றும் \r', 'C) 2018\r', 'C) 6 5 4 3 2 1 \r', 'C) 60 \r', 'C) அயோத்யா\r', 'C) காரல் மார்க்ஸ் \r', 'C) NNP\r', 'C) ஐந்து பேருண்மைகள்\r', 'C) மொத்த தேசிய மகிழ்ச்சிக் குறியீடு (GNHI) \r', 'C) GDP = C+I+ G + (X - M)\r', 'C) மொத்த தேசிய உற்பத்தி (GNP)\r', 'C) நீலகிரி\r', 'C) சேலம் & புதுக்கோட்டை\r', 'C) மொத்த உள்நாட்டு உற்பத்தி காக்க கட்டுப்பத்தி \r', 'C) தேசிய மென்பொருள் மற்றும் சேவைகள் நிறுவன கூட்டமைப்பு \r', 'C) தமிழ்நாடு & கேரளா\r', 'C) எண்ணூர்\r', 'C) ஆறாம் குரு ஹர்கோபிந்த் \r', 'C) திருவாரூர் மாவட்டம்\r', 'C) 2022\r', 'C) வீடுபேறு\r', 'C) 43,412 \r', 'C) அலங்கார மீன் வளர்ப்பு மற்றும் மீன் வேளாண்மேம்பாட்டு நிறுவனம் \r', 'C) மரபு வழி வேளாண்மைக்குத் திரும்புதல்\r', 'C) நவ மார்க்கம் - ஒன்பது நல்வழிகள் \r', 'C) இறக்குமதி வேறுபாடு\r', 'C) கூற்று தவறு; காரணம் சரி \r', 'C) உற்பத்தி = வருமானம் = செலவு \r', 'C) பிழையாகக் கணக்கிடல்\r', 'C) முத்து மசூதி\r', 'C) கோயம்புத்தூர், தர்மபுரி, வேலூர் மற்றும் கடலூர் \r', 'C) தேசிய கரிம & கனிம வேளாண்மைத் திட்டம்\r', 'C) 563 \r', 'C) 95 சதவீதத்திற்கு அதிகமாக\r', 'C) 2 3 4 1\r', 'C) சந்தை விலையில் GDP + வெளிநாட்டிலிருந்து கிடைக்கும் நிகர வருமானம். \r', 'C) கூற்று சரி; காரணம் தவறு\r', 'C) NNP = GNP / தேய்மான கழிவு \r', 'C) தேசிய வருமானம்\r', 'C) சிறப்புப் பொருளாதார மண்டலங்கள்\r', 'C) 16% \r', 'C) மூன்றாவது சமண சமய மாநாடு\r', 'C) C+I+G+(X+M) + (R-P) \r', 'C) சந்தை விலையில் NNP + மறைமுக வரி - மானியம்\r', 'C) கூற்று தவறு; காரணம் சரி \r', 'C) ஓசூர்\r', 'C) 15%\r', 'C) காஞ்சிபுரம் \r', 'C) புதிய வேலைவாய்ப்பை உருவாக்குதல் & சிறந்த நிர்வாகம்\r', 'C) 13% \r', 'C) மொத்த உள்நாட்டு உற்பத்தி \r', 'C) 107000 கி.மீ\r', 'C) துக்காராம்\r', 'C) NH - 43\r', 'C) மூலதன நுகர்வுக் கழிவு\r', 'C) கூற்று சரி; காரணம் தவறு\r', 'C) செலவு கூட்டு மூறை \r', 'C) ஹூண்டாய் \r', 'C) இரண்டாம் முறையாக கைப்பற்றப்பட்ட நீடித்த பொருட்களில் வாங்குதல் மற்றும் விற்றல் ஆகியவற்றின் பண மதிப்பை தேசிய வருவாயில் சேர்க்கக்கூடாது \r', 'C) 24\r', 'C) இராமநாதபுரம்\r', 'C) ஈரப்பத & ஈரப்பத \r', 'C) ஆசிவகம் & சன்மார்கம் \r', 'C) நம்மாழ்வார்\r', 'C) 82,644\r', 'C) 1.75%\r', 'C) சந்திர வித்திய மலை \r', 'C) பாபநாசம் அணை \r', 'C) மூன்றாம் பௌத்த மாநாடு \r', 'C) செலவு கூட்டு மூறை \r', 'C) விழுப்புரம் \r', 'C) பலமுறை கணக்கில் காட்டாமல் இருத்தல் \r', 'C) மலேஷியா \r', 'C) 750 மி.மீ\r', 'C) வகுப்பதன் மூலம் \r', 'C) 10\r', 'C) செலவு கூட்டு மூறை \r', 'C) கலப்பு வருமானம்\r', 'C) 6.96%\r', 'C) கன்னியாகுமரி\r', 'C) தென்னை\r', 'C) கோயம்புத்தூர், தர்மபுரி, வேலூர் மற்றும் கடலூர்\r', 'C) 2.8\r', 'C) தமிழ்நாடு வேளாண் பல்கலைக்கழகம்\r', 'C) சாமம்\r', 'C) இரண்டாவது பசுமைப் புரட்சி\r', 'C) திரிவாசகம்\r', 'C) இரண்டாம் முறையாக கைமாற்றப்பட்ட கார்\r', 'C) திரி ரத்தினங்கள்\r', 'C) சத்யாத்வாதம் அல்லது அநேகாந்தவாதம் \r', 'C) கலப்பு வருமானம்\r', 'C) 4         3         2\r', 'C) உற்பத்தி முறை \r', 'C) தமிழ்நாடு சுற்றுலாக் கழகம் \r', 'C) கோயம்பத்தூர்\r', 'C) இரண்டும்\r', 'C) வேளாண்மைக்கும் பொருளாதார வளர்ச்சிக்கும் இடையே ஒரு வலுவான தொடர்பு உள்ளது. \r', 'C) இல்லறத்தை வென்றவர் \r', 'C) இந்த உலகம் இயற்கையாக தோன்றியது\r', 'C) 14%\r', 'C) ஜாதகக்கதைகள்\r', 'C) 17\r', 'C) கூலி மற்றும் சம்பளம் கொடுத்தல்\r', 'C) கூற்று தவறு; காரணம் சரி \r', 'C) மூன்றாமிடம்\r', 'C) துக்காராம் \r', 'C) 3 மட்டும் \r', 'C) 65% \r', 'C) அதிக வெப்பநிலை மற்றும் குறைந்த மழைப் பொழிவு \r', 'C) சுந்தரர்\r', 'C) வேலூர்\r', 'C) கோயம்புத்தூர் \r', 'C) 3,428 \r', 'C) கூற்று தவறு; காரணம் சரி \r', 'C) 109 அடிகள்\r', 'C) நிகர வருமானம்\r', 'C) 64 \r', 'C) வளர்ச்சி கணக்கு \r', 'C) தர்மபுரி \r', 'C) 23%\r', 'C) காரணி உற்பத்தி முறை\r', 'C) 7% \r', 'C) 24\r', 'C) மதுரை \r', 'C) மூன்றாமிடம் \r', 'C) வெள்ளாடு\r', 'C) சீங்கன்னி முதலைகள்\r', 'C) வண்ணமீன் பண்ணை\r', 'C) 12 \r', 'C) NNP \r', 'C) இடுபொருட்களின் GDP\r', 'C) காரல் மார்க்ஸ்\r', 'C) மூன்றாமிடம்\r', 'C) 86.77% \r', 'C) 5,693 கி.மீ\r', 'C) NH - 786 \r', 'C) 7\r', 'C) கோயம்புத்தூர் \r', 'C) விருதுநகர் & காஞ்சிபுரம் \r', 'C) நாமக்கல் & திருச்சி \r', 'C) பிறவிப்பெருங்கடலை கடந்த ஞானி\r', 'C) மண் - கல்\r', 'C) மணிமுத்தாறு அணை\r', 'C) 175 அடி & 1,200 அடி\r', 'C) காரல் மார்க்ஸ்\r', 'C) நிகர உள்நாட்டு உற்பத்தி (NDP) \r', 'C) 101 அடி\r', 'C) 85 அடி\r', 'C) 42, 433\r', 'C) தனிநபர் நிகர வருமானம்\r', 'C) செலவிடக் கூடிய வருமானம்\r', 'C) 1100 கன மீட்டர் \r', 'C) வைகை அணை\r', 'C) மரையார் அணை \r', 'C) தமிழகம் & ஆந்திரா\r', 'C) 52 %\r', 'C) தேசிய வருமானம் + மக்கள் தொகை\r', 'C) உள்ளீடு முறை \r', 'C) 52 % \r', 'C) காரணி உற்பத்தி முறை \r', 'C) கூற்று சரி; காரணம் தவறு\r', 'C) இலத்தீன் \r', 'C) இராமானுஜர் \r', 'C) 17\r', 'C) இரண்டாம் நந்தவனம்\r', 'C) சிமெண்ட் தொழிலகங்கள் \r', 'C) நேமிநாதர் \r', 'C) சென்னை \r', 'C) ஆடம் ஸ்மித்\r', 'C) 5 \r', 'C) காஞ்சிபுரம் \r', 'C) எட்டாமிடம்\r', 'C) நிலக்கரிப் படிவுகள்\r', 'C) 40% \r', 'C) சின்கோனா\r', 'C) மர்ஃபி & காக்\r', 'C) தமிழ்நாட்டின் ஜவுளிக் பள்ளத்தாக்கு \r', 'C) ஈரோடு\r', 'C) மூன்றாமிடம்\r', 'C) சேலம்\r', 'C) மூன்றாமிடம்\r', 'C) புனித காபிர்\r', 'C) அடையாளக் குறியீடு \r', 'C) மேற்கு மாநிலங்கள் \r', 'C) 12 \r', 'C) 4,994 கி.மீ\r', 'C) சென்னை \r', 'C) மூன்றாவது\r', 'C) சென்னை , இராமநாதபுரம் & எண்ணூர்\r', 'C) தூத்துக்குடி\r', 'C) தூத்துக்குடி\r', 'C) 1077\r', 'C) நிவாரண / பேரிடர் மேலாண்மைத்துறை செயலாளர் \r']

d = ['D) 1985 ஏப்ரல்\r', 'D) பாரசீகம்\r', 'D) ஆழப்பகுதி மீன்பிடிப்பு\r', 'D) கல்ப கைவல்யம்\r', 'D) நிகர தேசிய உற்பத்தி\r',
     'D) குருவின் சொல்\r', 'D) 5 மில்லியன் ஹெக்டேர்\r', 'D) இவையனைத்தும்\r', 'D) 2015\r', 'D) 5 6 4 3 2 1\r', 'D) 40\r', 'D) முசாஃபர்\r', 'D) அமெர்தியா சென்\r', 'D) GNH\r', 'D) ஆறு பேருண்மைகள்\r', 'D) மனித வளக்குறியீடு (HDI)\r', 'D) GDP =C+I+G - (X + M)\r', 'D) நிகர உள்நாட்டு உற்பத்தி (NDP)\r', 'D) கன்னியாகுமரி\r', 'D) இவையனைத்தும்\r', 'D) திகா உள்நாட்டு உற்பத்தி\r', 'D) தேசிய மென்பொருள் & மின் சேவைகள் நிறுவன கூட்டமைப்பு\r', 'D) தமிழ்நாடு & தெலுங்கானா\r', 'D) கோயம்புத்தூர்\r', 'D) ஐந்தாம் குரு அர்ஜூன் தேவ்\r', 'D) காஞ்சிபுரம்\r', 'D) 2023\r', 'D) இவையனைத்தும்\r', 'D) 41,412\r', 'D) மீன்பிடிப் பொருட்கள் காப்பீடு\r', 'D) இவையனைத்தும்\r', 'D) அஷ்டாங்க மார்க்கம் - எட்டு நல்வழிகள்\r', 'D) மேற்கண்ட எதுவுமில்லை\r', 'D) கூற்றும் காரணமும் தவறு\r', 'D) உற்பத்தி < வருமானம் = செலவு\r', 'D) முடிவற்று கணக்கிடுதல்\r', 'D) பதேபூர் சிக்ரி\r', 'D) இவையனைத்தும்\r', 'D) ஏதுமில்லை\r', 'D) 663\r', 'D) 60 சதவீதத்திற்கு குறைவாக\r', 'D) 3 1 4 1\r', 'D) சந்தை விலையில் GDP* வெளிநாட்டிலிருந்து கிடைக்கும் நிகர வருமானம்,\r', 'D) கூற்று தவறு; காரணம் சரி\r', 'D) மேற்கண்ட எதுவுமில்லை\r', 'D) மேற்கண்ட அனைத்தும்\r', 'D) இவையனைத்தும்\r', 'D) 21%\r', 'D) நான்காவது சமண சமய மாநாடு\r', 'D) C+ 1 +G+(X+M) + (R+P)\r', 'D) சந்தை விலையில் NNP + மறைமுக வரி + மானியம்\r', 'D) கூற்றும் காரணமும்\r', 'D) பாப்பிரெட்டிப்பட்டி\r', 'D) 17%\r', 'D) மதுரை\r', 'D) இவையனைத்தும்\r', 'D) 18%\r', 'D) நிகர தேசிய உற்பத்தி\r', 'D) 207000 கி.மீ\r', 'D) பாபா தயாள் தாஸ்\r', 'D) NH – 44\r', 'D) மேற்கண்ட எதுவுமில்லை\r', 'D) கூற்று தவறு; காரணம் சரி\r', 'D) மேற்கண்ட அனைத்தும்\r', 'D) எச்.எம்.மிட்சுபிவி\r', 'D) மேற்கண்ட அனைத்தும்\r', 'D) 34\r', 'D) சிவகங்கை', 'D) வறண்ட & வறண்ட\r', 'D) சாக்தம் & சௌரம்\r', 'D) பூதத்தாழ்வார்\r', 'D) 92,644\r', 'D) 10%\r', 'D) வித்திய சாகர மலை\r', 'D) சாத்தனூர் அணை\r', 'D) நான்காம் பௌத்த மாநாடு\r', 'D) மேற்கண்ட அனைத்தும்\r', 'D) இவையனைத்தும்\r', 'D) மேற்கண்ட எதுவுமில்லை\r', 'D) இந்தோனேசியா\r', 'D) 1,080 மி.மீ\r', 'D) பெருக்குவதன் மூலம்\r', 'D) 12\r', 'D) மேற்கண்ட அனைத்தும்\r', 'D) தனிநபர் வருமானம்\r', 'D) 5.96 %\r', 'D) கோயம்புத்தூர்\r', 'D) நிலக்கடலை\r', 'D) இவையனைத்தும்\r', 'D) 3.1\r', 'D) இந்திய வேளாண் உற்பத்தி ஆராய்ச்சி கழகம்\r', 'D) அதர்வணம்\r', 'D) மூன்றாவது பசுமைப்புரட்சி\r', 'D) திரிபீடகம்\r', 'D) B&C\r', 'D) திரி மந்திரங்கள்\r', 'D) ஏதுமில்லை\r', 'D) தனிநபர் வருமானம்\r', 'D) 3         1          2\r', 'D) மேற்கண்ட அனைத்தும்\r', 'D) தமிழ்நாடு சுற்றுலா மேம்பாட்டுச் சம்மேளனம்', 'D) மதுரை', 'D) ஏதுமில்லை', 'D) மாநிலப் பொருளாதாரத்தில் வேளாண்மையின் பங்கு ஏறத்தாழ 21% ஆகும். இது ஆண்டிற்காண்டு மாறுபடுவதில்லை', 'D) அனைத்தையும் வென்றவர்', 'D) உலகம் என்பதே மாயை\r', 'D) 4%', 'D) இவையனைத்தும்', 'D) 156', 'D) அரசுக்கு செலுத்தும் வரிகள்', 'D) கூற்றும் காரணமும் தவறு', 'D) நான்காமிடம்', 'D) ஹர்கோபிந்த்', 'D) ஏதுமில்லை', 'D) 85% ', 'D) குறைந்த வெப்பநிலை மற்றும் குறைந்த மழைப் பொழிவு', 'D) நம்பியாண்டார் நம்பி\r', 'D) திருவண்ணாமலை', 'D) ஈரோடு', 'D) 2,428', 'D) கூற்றும் காரணமும் தவறு\r', 'D) 89 அடிகள்', 'D) மேற்கண்ட அனைத்தும்\r', 'D) 68', 'D) மேற்கண்ட எதுவுமில்லை', 'D) ஈரோடு', 'D) 13%', 'D) வருமான முறை', 'D) 12%', 'D) 36', 'D) கோயம்புத்தூர்', 'D) ஐந்தாமிடம்', 'D) செம்மறியாடு', 'D) தெவிட்ட முதலைகள்', 'D) ஏதுமில்லை', 'D) 14', 'D) GNP', 'D) உள்ளீடுகளின் GDP', 'D) அமெர்தியா சென்', 'D) நான்காமிடம்', 'D) 73.44%', 'D) 4,693 கி.மீ', 'D) NH – 686', 'D) 4', 'D) ஈரோடு', 'D) தேனி & விருதுநகர்', 'D) மதுரை & தேனி', 'D) கடவுளை அடைந்த ஞானி', 'D) முட்டை ஓடு - சுண்ணாம்பு', 'D) சாத்தனுர்அணை', 'D) 185 அடி & 1,100 அடி', 'D) அமெர்தியா சென்', 'D) மேற்கண்ட அனைத்தும்', 'D) 91 அடி', 'D) 91 அடி', 'D) 52,433', 'D) தனிநபர் வருமானம்', 'D) நிகர வருமானம்', 'D) 2200 கன மீட்டர்', 'D) மணிமுத்தாறு அணை', 'D) சுத்திதோஷ அணை', 'D) தமிழகம் & கேரளா', 'D) 55.3%', 'D) தேசிய வருமானம் மக்கள் தொகை,', 'D) சரக்கு முறை', 'D) 55.3%', 'D) வருமான முறை', 'D) கூற்று தவறு; காரணம் சரி', 'D) சமஸ்கிருதம்', 'D) வேதாந்ததேசிகர்', 'D) 156', 'D) சிறிய பிருந்தாவனம்', 'D) இவையனைத்தும்', 'D) ஸ்தூலபத்திரர்', 'D) கோயம்புத்தூர்', 'D) சைமன் குஷ்நெட்ஸ்', 'D) 6', 'D) மதுரை', 'D) மூன்றாமிடம்', 'D) இரும்புத்தாது படிவுகள்', 'D) 30%', 'D) இவையனைத்தும்', 'D) ஸ்வான் & காக்', 'D) தமிழ்நாட்டின் நெசவுத்தலை நகரம்', 'D) கரூர்', 'D) நான்காமிடம்', 'D) நாமக்கல்', 'D) நான்காமிடம்', 'D) புனித ஜும்மா', 'D) புவி சிறப்புக் குறியீடு', 'D) வடகிழக்கு மாநிலங்கள்', 'D) 8', 'D) 21,049 கி.மீ', 'D) பெங்களூரு', 'D) நான்காவது', 'D) எண்ணூர், தூத்துக்குடி & இராமநாதபுரம்', 'D) நாகப்பட்டினம்\r', 'D) நாகப்பட்டினம்', 'D) 1099', 'D) மாநில முதலமைச்சர்']

correct_answer = ['D) 1985 ஏப்ரல்', 'B) இலத்தீன்', 'C) ஆழ்கடல் மீன்பிடிப்பு', 'B) கல்ப சூத்திரம்',
                  'A) மொத்த பண்டங்கள் மற்றும் பணிகளின் ', 'A) குருவை அடையும் வழி ', 'C) 3 மில்லியன் ஹெக்டேர்', 'A) கோயம்புத்தூர் பீடபூமியிலும், கம்பம் பள்ளத்தாக்கிலும்', 'C) 2018', 'B) 2 1 5 6 4 3', 'D) 40', 'B) சாரநாத்', 'B) ஆல்ஃபிரட் மார்ஷல்', 'D) GNH', 'B) நான்கு பேருண்மைகள்', 'B) மொத்த உள்நாட்டு உற்பத்தி (GDP) ', 'C) GDP = C+I+ G + (X - M)', 'C) மொத்த தேசிய உற்பத்தி (GNP)', 'D) கன்னியாகுமரி', 'D) இவையனைத்தும்', 'A) நிகர தேசிய உற்பத்தி', 'C) தேசிய மென்பொருள் மற்றும் சேவைகள் நிறுவன கூட்டமைப்பு', 'A) தமிழ்நாடு & கர்நாடகா', 'D) கோயம்புத்தூர்', 'A) பத்தாவது குரு கோவிந்த்சிங்', 'A) ஒருங்கிணைந்த தஞ்சை மாவட்டம் ', 'D) 2023', 'A) கர்மா', 'D) 41,412', 'D) மீன்பிடிப் பொருட்கள் காப்பீடு', 'B) மண்வளப் பாதுகாப்பு ', 'D) அஷ்டாங்க மார்க்கம் - எட்டு நல்வழிகள்', 'A) நிகர ஏற்றுமதி', 'A) கூற்றும் காரணமும் சரி மேலும் காரணம் கூற்றை சரியாக விளக்குகிறது', 'C) உற்பத்தி = வருமானம் = செலவு ', 'B) இருமுறை கணக்கிடல் ', 'A) தாஜ்மஹால்', 'B) இராமநாதபுரம், திருநெல்வேலி, கரூர், பெரம்பலூர் & சேலம் ', 'A) தேசிய கரிம வேளாண்மைத் திட்டம்', 'A) 363', 'A) 98 சதவீதத்திற்கு அதிகமாக', 'C) 2 3 4 1', 'C) சந்தை விலையில் GDP + வெளிநாட்டிலிருந்து கிடைக்கும் நிகர வருமானம்.', 'A) கூற்றும் காரணமும் சரி; காரணம் கூற்றுக்கான சரியான விளக்கமே ', 'B) NNP = GNP - தேய்மான கழிவு ', 'A) தலா வருமானம்', 'C) சிறப்புப் பொருளாதார மண்டலங்கள்', 'D) 21%', 'B) இரண்டாவது சமண சமய மாநாடு', 'B) C+1+G+(X-M) + (R-P) ', 'A) சந்தை விலையில் NNP - மறைமுக வரி + மானியம்', 'A) கூற்றும் காரணமும் சரி; காரணம் கூற்றுக்கு சரியான விளக்கமாகும்', 'D) பாப்பிரெட்டிப்பட்டி', 'D) 17%', 'A) கன்னியாகுமரி', 'D) இவையனைத்தும்', 'C) 13%', 'D) நிகர தேசிய உற்பத்தி', 'A) 167000 கி.மீ', 'B) பாபா ராம் சிங் ', 'D) NH – 44', 'C) மூலதன நுகர்வுக் கழிவு', 'C) கூற்று சரி; காரணம் தவறு', 'A) உற்பத்தி முறை ', 'B) பென்ஸ்', 'D) மேற்கண்ட அனைத்தும்', 'D) 34', 'B) நீலகிரி', 'A) ஈரப்பத, வறண்ட ', 'C) ஆசிவகம் & சன்மார்கம் ', 'B) நாதமுனிகள்', 'B) 72,644', 'B) 1.25%', 'A) சென்ன கேசவ மலை', 'B) முல்லைப்பெரியாறு அணை', 'D) நான்காம் பௌத்த மாநாடு', 'B) காரணி வருவாய் முறை ', 'B) கடலூர்', 'A) பலமுறை கணக்கில் சேர்த்தல்', 'C) மலேஷியா ', 'A) 930 மி.மீ', 'A) கூட்டுவதன் மூலம்', 'D) 12', 'A) உற்பத்தி முறை ', 'B) மூலதன வருமானம் ', 'D) 5.96 %', 'A) சென்னை', 'D) நிலக்கடலை', 'C) கோயம்புத்தூர், தர்மபுரி, வேலூர் மற்றும் கடலூர்', 'B) 2.5', 'C) தமிழ்நாடு வேளாண் பல்கலைக்கழகம்', 'A) ரிக்', 'C) இரண்டாவது பசுமைப் புரட்சி', 'D) திரிபீடகம்', 'D) B&C', 'C) திரி ரத்தினங்கள்', 'A) சியாத்வாதம் அல்லது அநேகாந்தவாதம் ', 'C) கலப்பு வருமானம்', 'D) 3 \t1 \t 2', 'B) செலவு முறை', 'B) தமிழ்நாடு சுற்றுலா மேம்பாட்டுக் கழகம்', 'A) சென்னை', 'C) இரண்டும்', 'D) மாநிலப் பொருளாதாரத்தில் வேளாண்மையின் பங்கு ஏறத்தாழ 21% ஆகும். இது ஆண்டிற்காண்டு மாறுபடுவதில்லை', 'A) புலன்களை வெற்றிகொண்டவர்', 'C) இந்த உலகம் இயற்கையாக தோன்றியது', 'B) 35%', 'C) ஜாதகக்கதைகள்', 'A) 41,127 ', 'D) அரசுக்கு செலுத்தும் வரிகள்', 'A) கூற்றும் காரணமும் சரி மேலும் காரணம் கூற்றை சரியாக விளக்குகிறது', 'A) முதலிடம்', 'B) குரு கோபிந்த் சிங் ', 'C) 3 மட்டும் ', 'C) 65%', 'B) அதிக வெப்பநிலை மற்றும் அதிகமழைப் பொழிவு', 'D) நம்பியாண்டார் நம்பி', 'C) வேலூர்', 'D) ஈரோடு', 'A) 5,428', 'C) கூற்று தவறு; காரணம் சரி', 'A) 119 அடிகள்', 'A) உண்மை வருமானம்', 'C) 64', 'C) வளர்ச்சி கணக்கு', 'C) தர்மபுரி', 'D) 13%', 'D) வருமான முறை', 'B) 10% ', 'C) 24', 'D) கோயம்புத்தூர்', 'B) இரண்டாமிடம்', 'C) வெள்ளாடு', 'C) சீங்கன்னி முதலைகள்', 'B) பெரிய பாம்புப்பண்ணை', 'C) 12', 'B) NDP', 'A) சந்தை விலையின் GDP', 'A) சைமன் குஷ்நெட்ஸ்', 'B) இரண்டாமிடம்', 'A) 80.09%', 'B) 6,693 கி.மீ', 'B) NH - 785', 'B) 3', 'A) திருப்பூர்', 'B) வேலூர் & கன்னியாகுமரி', 'A) தர்மபுரி & கிருஷ்ண கிரி ', 'C) பிறவிப்பெருங்கடலை கடந்த ஞானி', 'C) மண் - கல்', 'D) சாத்தனுர்அணை', 'C) 175 அடி & 1,200 அடி', 'A) சைமன் குஷ்நெட்ஸ் ', 'C) நிகர உள்நாட்டு உற்பத்தி (NDP)', 'B) 111 அடி', 'A) 71 அடி', 'A) 22,433', 'D) தனிநபர் வருமானம்', 'C) செலவிடக் கூடிய வருமானம்', 'B) 900 கன மீட்டர்', 'D) மணிமுத்தாறு அணை', 'B) கரையார் அணை ', 'D) தமிழகம் & கேரளா', 'B) 59%', 'B) தேசிய வருமானம் / மக்கள் தொகை', 'D) சரக்கு முறை', 'D) 55.3%', 'D) வருமான முறை', 'D) கூற்று தவறு; காரணம் சரி', 'C) இலத்தீன் ', 'C) இராமானுஜர்', 'B) 81', 'D) சிறிய பிருந்தாவனம்', 'A) தோல் பதனிடும் தொழிலகங்கள்', 'D) ஸ்தூலபத்திரர்', 'C) சென்னை', 'D) சைமன் குஷ்நெட்ஸ்', 'C) 5 ', 'A) சென்னை', 'D) மூன்றாமிடம்', 'D) இரும்புத்தாது படிவுகள்', 'D) 30%', 'C) சின்கோனா', 'A) எடி & பீகாக்', 'C) தமிழ்நாட்டின் ஜவுளிக் பள்ளத்தாக்கு', 'D) கரூர்', 'D) நான்காமிடம்', 'A) கரூர்', 'B) இரண்டாமிடம் ', 'A) புனித காபா', 'A) புவியியல் குறியீடு', 'A) தென் மாநிலங்கள் ', 'B) 15', 'C) 4,994 கி.மீ', 'C) சென்னை', 'C) மூன்றாவது', 'A) சென்னை, எண்ணூர் & தூத்துக்குடி', 'A) சென்னை', 'B) எண்ணூர் ', 'C) 1077', 'D) மாநில முதலமைச்சர்']


@app.route("/", methods=["GET", "POST"])
def home():
    warning = request.args.get("warn")

    if current_user.is_authenticated:
        completed = Test20.query.filter_by(examinee_id=current_user.user_id).first()

        if request.args.get("fee"):
            name = request.args.get("name")
            bending = request.args.get("bending")
            logged_in = request.args.get("logged_in")

            return render_template("index.html", fee=True, name=name, bending=bending, logged_in=logged_in,
                                   completed=completed)

        else:
            if completed:
                return render_template("index.html", warning=warning, completed=completed)

            else:
                return render_template("index.html", warning=warning)

    else:
        return render_template("index.html", warning=warning)


@app.route("/register", methods=['GET', 'POST'])
def register():
    form = RegisterForm()
    errors = []

    if form.validate_on_submit():
        hash_and_salted_password = generate_password_hash(
            request.form.get('password'),
            method='pbkdf2:sha256',
            salt_length=8
        )

        new_user = User(
            email=request.form.get('email'),
            username=request.form.get('name'),
            password=hash_and_salted_password,
        )

        if User.query.filter_by(email=request.form.get('email').lower()).first():
            return redirect(url_for('login', msg="You've already been registered. Please Login!"))

        elif User.query.filter_by(username=request.form.get('name')).first():
            errors.append('The username has already been taken')
            return render_template("register.html", errors=errors, form=form)

        else:
            errors.clear()

            if request.form.get('email') in verified_emails:

                db.session.add(new_user)
                db.session.commit()

                login_user(new_user)

                # redirect to the home page with fee details.
                return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                        bending=student_mails[request.form.get('email')][1]))

            else:
                return redirect(url_for('home', warn=True))

    return render_template("register.html", form=form)


@app.route("/login", methods=['GET', 'POST'])
def login():
    form = LoginForm()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        password = request.form.get('password')

        # Find user by email entered.
        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, password):
            login_user(user)
            errors.clear()

            # checking the user's payment details
            # redirect to the home page with fee details.
            return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                    bending=student_mails[request.form.get('email')][1]))

        else:
            errors.append('Incorrect Password! Try Again')
            return render_template("login.html", errors=errors, form=form)

    msg = request.args.get("msg")
    return render_template("login.html", form=form, errors=errors, msg=msg)


@app.route("/exam", methods=["GET", "POST"])
def exam():
    global attended
    test_no = request.args.get("test_no")
    opentime = exam_sites[request.args.get("test_no")][0]
    closetime = exam_sites[request.args.get("test_no")][1]
    #
    # if test_no == "15":
    #     attended = Test15.query.filter_by(examinee_id=current_user.user_id).first()

    if test_no == "16":
        attended = Test16.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "17":
        attended = Test17.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "18":
        attended = Test18.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "19":
        attended = Test19.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "20":
        attended = Test20.query.filter_by(examinee_id=current_user.user_id).first()

    if attended is None:
        return render_template("exam.html", opentime=json.dumps(opentime), closetime=json.dumps(closetime),
                               sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d, correct_answer=correct_answer,
                               answers=[], test_no=test_no)
    else:
        return redirect(url_for("home", warn="You have already committed this exam. Check the results instead."))


@app.route('/evaluate', methods=["GET", "POST"])
def evaluate():

    global new_examinee
    answers = []
    final_result = []
    marks = 0

    for i in range(0, len(sl_no)):
        user_answer = request.form[f'answers{i}']

        if user_answer is None:
            answers.append("None")

        else:
            answers.append(user_answer)

    for j in range(len(correct_answer)):

        if answers[j].strip() == correct_answer[j].strip():
            marks += 1
            final_result.append("Correct")

        else:
            final_result.append("Wrong")

    # return f"{final_result, answers, correct_answer}"

    st_answers = '#||#'.join(answers)
    f_result = "#||#".join(final_result)

    # return f"{correct_answer, answers}"
    # return f"{[s_answers for s_answers in correct_answer]}"
    # return f"{[s_answers for s_answers in answers]}"
    # return f"{final_result}"

    actual_time = datetime.datetime.now()
    s_time = actual_time.strftime('%Y-%m-%d %H:%M:%S.%f')

    new_examinee = Test18(
        test_author=current_user,
        user_answers=st_answers,
        marks=marks,
        final_result=f_result,
        date=s_time[:-7],
        examinee_name=current_user.username
    )

    db.session.add(new_examinee)
    db.session.commit()

    return redirect(url_for('home', warn="You have successfully completed the exam. Click results to see results."))


@app.route("/result", methods=["GET", "POST"])
def result():
    global answers, final_result, time, marks
    test_no = request.args.get("test_no")

    if test_no == "15":
        attended_student = Test15.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "16":
        attended_student = Test16.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "17":
        attended_student = Test17.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "18":
        attended_student = Test18.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "19":
        attended_student = Test19.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "20":
        attended_student = Test20.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    return render_template("results.html", answers=answers, marks=marks, sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d,
                           correct_answer=correct_answer, final_result=final_result, time=time)


@app.route("/dashboard")
def dashboard():
    all_record = Test20.query.all()

    return render_template("dashboard.html", all_record=all_record)


@app.route("/change_details", methods=["GET", "POST"])
def change_password():
    form = ChangeDetails()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        old_password = request.form.get('old_password')
        new_password = request.form.get('new_password')

        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, old_password):

            if User.query.filter_by(email=email).first():
                old = User.query.filter_by(email=email).first()
                pass_to_update = User.query.get(old.user_id)

                hash_and_salted_password = generate_password_hash(
                    new_password,
                    method='pbkdf2:sha256',
                    salt_length=8
                )

                pass_to_update.password = hash_and_salted_password

                db.session.commit()

                logout_user()
                return redirect(url_for('login', msg="Your password has been changed successfully. "
                                                     "Please Login with your new password."))

        else:
            errors.append("Please check your password.")
            return render_template("change_details.html", form=form, errors=errors)

    return render_template("change_details.html", form=form, errors=errors)


@app.route('/logout')
@login_required
def logout():
    logout_user()
    return redirect(url_for('home'))


@app.route("/admission", methods=["GET", "POST"])
def new_admission():
    form = AdmissionForm()

    if form.validate_on_submit():
        new_member = Admission(
            name=form.name.data,
            mobile_number=form.number.data,
            email=form.email.data,
        )

        db.session.add(new_member)
        db.session.commit()

        verification_code = random.randint(2000, 10000)

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=request.form.get('email'),
                                msg=f"Subject:WELCOME TO SENA CAREER INSTITUTE\n\nWelcome {request.form.get('name')}!"
                                    f" Happy to see you with us. Thanks for supporting us! Keep rocking! "
                                    f"Here is our Educators' number: 8610642720".encode('utf-8'))

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=MY_EMAIL,
                                msg=f"Subject:NEW ADMISSION\n\n{request.form.get('name')} has made an "
                                    f"admission sign up on Sena site Here is details {request.form.get('name')},"
                                    f" {request.form.get('number')}, {request.form.get('email')}!")

        return redirect(url_for('home'))

    return render_template("register.html", form=form, admission=True)


if __name__ == '__main__':
    app.run(debug=True)
