import datetime
import random
import smtplib
import pandas
from flask import Flask, render_template, redirect, url_for, flash, request, abort
from flask_bootstrap import Bootstrap
from flask_ckeditor import CKEditor
from werkzeug.security import generate_password_hash, check_password_hash
from flask_sqlalchemy import SQLAlchemy
from flask_login import UserMixin, login_user, LoginManager, login_required, current_user, logout_user
from flask_wtf import FlaskForm
from sqlalchemy.orm import relationship
from wtforms import StringField, SubmitField, PasswordField
from wtforms.fields.html5 import EmailField
from wtforms.validators import DataRequired
from functools import wraps
import os
import json

app = Flask(__name__)
app.config['SECRET_KEY'] = os.environ.get("SECRET_KEY")
ckeditor = CKEditor(app)
Bootstrap(app)

app.config['SQLALCHEMY_DATABASE_URI'] = os.environ.get("DATABASE_URL", "sqlite:///sena-base.db")
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
db = SQLAlchemy(app)

admin = False
login_manager = LoginManager()
login_manager.init_app(app)

MY_EMAIL = os.environ.get("MY_EMAIL")
SENA_EMAIL = 'sivagangainagarajan@gmail.com'
MY_PASSWORD = os.environ.get("MY_PASSWORD")


@login_manager.user_loader
def load_user(user_id):
    return User.query.get(int(user_id))


def admin_only(f):
    @wraps(f)
    def decorated_function(*args, **kwargs):
        # If id is not 1 then return abort with 403 error
        if current_user.user_id != 1:
            return abort(403)
        # Otherwise continue with the route function
        return f(*args, **kwargs)

    return decorated_function


class User(UserMixin, db.Model):
    __tablename__ = "User"
    user_id = db.Column(db.Integer, primary_key=True)
    email = db.Column(db.String(100), unique=True)
    password = db.Column(db.String(100))
    username = db.Column(db.String(100))
    test = relationship("Test15", back_populates="test_author")
    test16 = relationship("Test16", back_populates="test_author")
    test17 = relationship("Test17", back_populates="test_author")
    test18 = relationship("Test18", back_populates="test_author")
    test19 = relationship("Test19", back_populates="test_author")

    def get_id(self):
        return self.user_id


class Test15(db.Model):
    __tablename__ = "Test_15"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test")
    marks = db.Column(db.Integer)
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test16(db.Model):
    __tablename__ = "Test_16"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test16")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test17(db.Model):
    __tablename__ = "Test_17"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test17")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test18(db.Model):
    __tablename__ = "Test_18"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test18")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test19(db.Model):
    __tablename__ = "Test_19"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test19")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Admission(db.Model):
    __tablename__ = "New_Admission"
    user_id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(100))
    mobile_number = db.Column(db.Integer)
    email = db.Column(db.String(100), unique=True)


db.create_all()
db.session.commit()


class RegisterForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Register')


class LoginForm(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Login')


class AdmissionForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    number = StringField("Phone*", validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    submit = SubmitField('Submit')


class ChangeDetails(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    old_password = PasswordField('Old Password*', validators=[DataRequired()])
    new_password = PasswordField('New Password*', validators=[DataRequired()])
    submit = SubmitField('Submit')


student_mails = {
    "mgopalakrishnan075@gmail.com": ["Gopal", 2000],
    "nivir6558@gmail.com": ["Nivetha", 7000],
    "jaya26jj@gmail.com": ["Christy", 5000],
    "srjamuna1003@gmail.com": ["jamuna", 7000],
    "satheshpandian1997@gmail.com": ["Satheshpandian", 4000],
    "lakshmiraja412@gmail.com": ["Rajalaskhmi", 5000],
    "tamilarasanbe9597@gmail.com": ["Anitha", 1000],
    "rajeshkannan6341@gmail.com": ["Rajesh kannan", 3000],
    "jaishreeramgp@gmail.com": ["Yogapriya", 3000],
    "irudhayasubiksha2001@gmail.com": ["Subiksha", 0],
    "abinayaabi257@gmail.com": ["Abi", 1000],
    "shanthirasu1991@gmail.com": ["Shanthi", 0],
    "pradee1296@gmail.com": ["Pradeepa", 5000],
    "jeniferj0204@gmail.com": ["Janifer", 7000],
    "krish47457@gmail.com": ["Krishna", 0],
    "naveenaryan440@gmail.com": ["Naveen", 0],
    "veerasurya250899@gmail.com": ["Suriya", 3000],
    "amin2svg@gmail.com": ["Amin", 3000],
    "jjprincy06@gmail.com": ["Jeba Josepin Princy", 0],
    "jancybetsia20@gmail.com": ["Jancy", 0],
    "cottonpanju9@gmail.com": ["Panju", 2000],
    "rameswariv1999@gmail.com": ["Rameshwari", 2000],
    "vimaladharmar2002@gmail.com": ["Vimala", 1000],
    "devahi1993@gmail.com": ["Devahi", 0],
    "sarojiniganesan96@gmail.com": ["Sarojini", 0],
    "gangadha91@gmail.com": ["Gangadharan", 0],
    "krishnannk498@gmail.com": ["Kamatchi", 0],
    "indhuindhumathi141@gmail.com": ["Indhumathi", 4000],
    "jamespurysh@gmail.com": ["Purushothaman", 0],
    "sivagangainagarajan@gmail.com": ["Nagarajan", 0],
    "matheshsethu22@gmail.com": ["Mathesh", 4000],
    "nagarajnkarthika@gmail.com": ["Karthika", 2000],
    "keviraj482@gmail.com": ["Yogesh", 2000],
    "christyjeslina98@gmail.com": ["Christy", 3500]
}

verified_emails = [mail.strip() for mail in student_mails.keys()]

exam_sites = {

    "15": ["June 14, 2021 10:00:00", "June 14, 2021 13:30:00"],
    "16": ["June 21, 2021 10:00:00", "June 21, 2021 13:30:00"],
    "17": ["June 28, 2021 10:00:00", "June 28, 2021 22:30:00"],
    "18": ["July 05, 2021 10:00:00", "July 05, 2021 13:30:00"],
    "19": ["July 11, 2021 10:00:00", "July 12, 2021 13:30:00"],

}

sl_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
         31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58,
         59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
         87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
         112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133,
         134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
         156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177,
         178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190]

ques = ['1)சந்தை விதியை உலகிற்கு அளித்தவர் யார்?', 'வேலை வாய்ப்புக்கும் வருமானத்திற்கும் உள்ள உறவை விலகியதில், '
                                                   'இருபதாம் நூற்றாண்டில் மிகப் பெரிய தாக்கத்தை ஏற்படுத்தியவர் யார்?\n',
        'சந்தை விதியை உலகிற்கு அளித்தவர் யார்?', 'இலைகளின் பணிகள் யாவை ?\n', 'நமது அரசானது, ஊழல் தடுப்புச்சட்டத்தை இயற்றிய ஆண்டு எது?\n', 'மத்திய அரசு மற்றும் பொதுத்துறை நிறுவனங்களின் நடவடிக்கைகளை கண்காணிக்கும் வகையில் ஏற்படுத்தப்பட்ட அமைப்பு எது?\n', 'நாட்டு மக்களில் வேலையில் இருப்பவர்கள் மற்றும் வேலை செய்யும் திறன் பெற்ற நபர்கள் ஆகியோர் கூட்டாக சேர்ந்து எவ்வாறு  அழைக்கப்படுகின்றனர்?\n', 'உழைப்பாளர் குழுவை கணக்கிடுவதில் ______ முதல் _______ வரையிலான வயதுடையவர்கள் கணக்கில் எடுத்துக் கொள்ளப்படுவர்.\n', 'பின்வரும் வாக்கியங்களில் சரியானவை எவை? 1.இந்தியாவிற்கு கணக்காய்வு மற்றும் தணிக்கைத் துறை தலைவர் ஒருவர் இருக்க வேண்டும் என்று அரசமைப்பு உறுப்பு 148(1) கூறுகிறது\n2.இந்திய கணக்காய்வு மற்றும் தணிக்கைத் துறையை பற்றி கூறும் அரசமைப்பு உறுப்புகள் 148 முதல் 158 வரை ஆகும் 3.இந்திய கணக்காய்வு மற்றும் தணிக்கைத் துறை தலைவர் ஐந்து ஆண்டுகளுக்கு அல்லது 60 வயது  வரை நியமனம் செய்யப்படுகிறார்\n4.இந்திய கணக்காய்வு மற்றும் தணிக்கைத் துறை தலைவர், உச்சநீதிமன்ற நீதிபதியை நீக்கும் முறைகளின் படியே பணிநீக்கம் செய்யப்பட வேண்டும் என்று அரசமைப்பின் உறுப்பு 148 கூறுகிறது\n', 'நல்ல உடல் நலம் உள்ள தனிநபர்கள் மற்றும், நிலவுகின்ற கூலி விகிதத்தில் வேலை செய்யத் தயாராக இருப்பவர்கள் அனைவருக்கும் வேலை கிடைக்கிறது எனில் அதனை _____ என்கிறோம்.\n', 'வேலை செய்ய விருப்பமும் திறமையும் இருப்பவர்களுக்கு கண்டிப்பாக வேலை கிடைக்கும் நிலைக்கு என்ன பெயர்?', 'பூவின் அடிப்படையில் தாவரங்களை இரு வகைகளாகப் பிரிக்கலாம். அவை யாவை?\n', 'பாலைவனத் தாவரங்கள் நீரையும் கனிம உப்புக்களையும் எங்கு சேமித்து வைத்துக் கொள்கின்றன?', 'பின்வரும் வாக்கியங்களில் எது/எவை சரி?\n1.மக்கள் தொகையில் பெரும்பகுதி குழந்தைகளும் வயது முதிர்ந்தவர்களும் இருந்தால், உழைப்பாளர் குழுவின் எண்ணிக்கை அதிகமாக இருக்கும்\n2.இதனால் நாட்டு முன்னேற்றம் விரைவாக நடைபெறும் 3.குறைந்த உழைப்பாளர்கள் குழுவானது, உழைப்பாளர் அல்லாத பெரிய குழுக்களுக்கு சிறிய தேசிய உற்பத்தியில் இருந்து உணவளித்து பராமரிக்க வேண்டி இருக்கும்', 'இந்திய கணக்காய்வு மற்றும் தணிக்கைத் துறை தலைவரின் ஊதியம் மற்றும் பிற பணி நிலைபாடுகளை நிர்ணயம் செய்பவர்/செய்வது?\n', '“முழு வேலை நிலை என்பது விருப்பமில்லா வேலை இன்மை(Involuntary Unemployment ) இல்லாமலிருப்பது ஆகும்" என்பது யாருடைய கூற்று?\n', '“கூலியும் விலையும் எந்த வேலைநிலையில் மாறிமாறி அதிகரிக்கிறதோ அங்கு முழு வேலைவாய்ப்பு நிலவுகிறது” என்றவர் யார்?\n', 'பாலைவன வாழிடத்தின் நான்கு வகைகள் எவை ?\n', 'காடுகள் எவ்வாறு வகைப்படுத்தப்படுகின்றன?\n', 'இந்தியாவில் பொருளியல் வருவாய் ஈட்டும் துறைகள் மூன்றாக வகைப்படுத்தப்பட்டுள்ளன. அவற்றில் சேராதது எது?\n\n', 'பின்வரும் கூற்றுகளில் சரியானவை எவை?\n1.ஜனாதிபதி தரும் படிவத்தில் மத்திய/ மாநில அரசுகளின் கணக்கை வரவு வைக்க வேண்டும் என்று கூறும் உறுப்பு (கணக்குகள் படிவம் உறுப்பு) 150 ஆகும்\n2.மத்திய அரசின் கணக்குகளை குடியரசுத் தலைவர் நாடாளுமன்றத்தில் தாக்கல் செய்ய வேண்டும் என்று கூறும் அரசமைப்பு உறுப்பு 151(1) ஆகும்\n3.மாநில அரசின் கணக்குகளை ஆளுநர் சட்டமன்றங்களில் தாக்கல் செய்ய வேண்டும் என்று கூறும் அரசமைப்பு உறுப்பு 151(2) ஆகும்\n4.பொது மக்களின் பாதுகாவலன் என்று குடியரசுத் தலைவர் அழைக்கப்படுகிறார்', 'நடைமுறையில் முழு வேலைவாய்ப்பு என்பது நாட்டின் _____ஐ முழுமையாக பயன்படுத்துவது ஆகும்.\n', 'கிராமங்களில் நிலவும் வேலையின்மை எது?\n I)அமைப்புசார் வேலையின்மை\nII)மறைமுக வேலையின்மை\nIII)பருவகால வேலையின்மை\n', 'வளரும் பருவநிலையில் அதிவேகமாக வளரக்கூடிய தாவரம் எது?\n', 'பற்றுகம்பி, ஏறுகொடி, முட்கள் இவ்வகை தகவமைப்புகள்_____ மற்றும்_____ தாவரங்களில் காணப்படுகின்றன.\n\n', 'இந்தியா போன்ற வளரும் நாடுகளில் உழைப்பாளர் குழுவின் பெரும்பகுதியினர் எந்தத் துறையில் இருப்பர்?\n', '1972-73 ஆம் ஆண்டுகளில் தொடங்கி கடந்த நான்கு பத்தாண்டுகளில்  வேலைவாய்ப்பு வளர்ச்சி, சராசரியாக எத்தனை சதவீத அளவுக்கு உயர்ந்துள்ளது?\n\n', 'இந்தியாவின் முதல் CAG யார்?\n', 'பின்வரும் எந்த நாடுகளில் வேலையின்மை தற்காலிகமாகவோ அல்லது பிறழ்ச்சியாகவோ  இருக்கும்?\n', 'பின்வருவனவற்றுள் வேலையின்மையின் வகை அல்லாதது எது?\n\n', 'தாவர உலகம் எத்தனை வகைகளாக பிரிக்கப்பட்டுள்ளது?\n', 'உயிரினங்களை அடையாளம் காணுதல், வகைப்படுத்துதல், அவற்றைப் பற்றி விளக்குதல், பெயரிடுதல் ஆகியவற்றை உள்ளடக்கியது _______ என்னும் உயிரியல் பிரிவு ஆகும் .\n', ' இடைக்கால இந்திய வரலாற்று காலத்தில், வேலைவாய்ப்பின்மை சிக்கலைத் தீர்ப்பதற்கு “வேலைவாய்ப்பு அலுவலகத்தை” அமைத்தவர் யார்?\n', 'இந்தியாவைப் பொருத்தவரை பின்வரும் எது ஒழுங்கமைக்கப்பட்ட துறை அல்ல?\n', 'பின்வருவனவற்றுள் CAG யின் பணி என்ன ?\n', 'மத்திய புலனாய்வுத்துறையானது எந்த கமிட்டியின் பரிந்துரையின் மூலம் உருவாக்கப்பட்டது?\n', 'சூழல் வேலையின்மையை எதன் மூலம் குறைக்கலாம்?\nI)அரசு முதலீட்டை அதிகரிப்பதன் மூலம்\nII)தனியார் முதலீட்டை அதிகரிப்பதன் மூலம்\nIII)விரிவான பணவியல் கொள்கைகளைக் கடைபிடிப்பதன் மூலம்\n', 'ஒரு வருடத்தின் சில காலங்களில் மட்டும் நிலவும் வேலையின்மைக்கு என்ன பெயர்?\n', 'வகைப்பாட்டியல் என்னும் சொல்லை முதன்முதலில் உருவாக்கியவர்?\n', 'வகைப்படுத்துதல் இன் பிரிவுகள் எத்தனை வகைப்படும்?\n', '2011-12 காலப்பகுதியில் வேலைவாய்ப்பில் முதன்மை துறையின் பங்களிப்பு எவ்வளவு?\n', 'பின்வரும் பண்புகளைக் கொண்ட துறை எது?\n1.இதற்கு விதிகளும் ஒழுங்கு முறைகளும் இருந்தாலும் அவை பின்பற்றப்படுவதில்லை\n2.இவற்றில் வேலை செய்வோருக்கு குறைந்த கூலி கொடுக்கப்படுவதோடு பல நேரங்களில் தொடர்ச்சியாக வேலையும் இருக்காது\n3.பெரும்பாலும் அவர்களுக்கு ஊதியத்துடன் விடுப்பு, விடுமுறை நாட்கள், மருத்துவ விடுப்பு போன்றவை இருக்காது\n4.வேலை உத்தரவாதம் கிடையாது. வேலை இல்லாதபோது அவர்கள் தொழில் கூடங்களில் இருந்து வெளியேறுமாறு கேட்டுக் கொள்ளப்படுவார்கள்\n5.தெருக்களில் விற்பனை செய்வோர், பழுது சரி பார்ப்போர், சிறிய அளவிலான தொழில் செய்வதில் ஈடுபட்டுள்ள ஏராளமான எண்ணிக்கையிலான மக்களை இந்த துறை உள்ளடக்கியுள்ளது. ', ' இந்திய அரசு, ஆட்சித்துறை ஆணையின் மூலம் சிறப்பு காவல் அமைப்பை ஏற்படுத்திய ஆண்டு என்ன?\n', 'மத்திய புலனாய்வுத்துறை ஆனது 1963ஆம் ஆண்டு பின்வரும் எதன்மூலம் கொண்டுவரப்பட்டது?\n', 'உழைப்பாளர்கள் ஓரிடத்திலிருந்து மற்றொரு இடத்திற்கு இடம் பெறாமை, திறமை பற்றாக்குறை, இயந்திரங்கள் பழுது ஏற்படுதல், மூலப்பொருட்களின் பற்றாக்குறை போன்ற காரணங்களால் ஏற்படுவது?\n', 'லின்னேயஸ் முறை _______ வகைப்பாட்டு முறையில் மிகவும் புகழ்பெற்றது.\n\n', 'ஜிம்னோஸ்பெர்ம்( திறந்த விதை உடைய தாவரங்கள்) எத்தனை குடும்பங்களை உள்ளடக்கியது?\n', 'பின்வருவனவற்றுள் “சேவை நோக்கம்” கொண்டது எது?\n', 'இந்தியாவில் ஊழலை ஒழிப்பது குறித்து, இந்திய அரசுக்கு பரிந்துரைகள் வழங்கும் குழுவிற்கு சந்தானத்தை தலைவராக லால்பகதூர் சாஸ்திரி நியமித்த ஆண்டு எது?\n', 'சந்தானம் கமிட்டி தனது அறிக்கையை சமர்ப்பித்த நாள் எது?\n', 'கற்றோர் வேலையின்மை உருவாக காரணம் என்ன? I)தவறான கல்விமுறை & வேலைக்கான திறன் பற்றாக்குறை II)அதிகளவு மாணவர்கள் ஒவ்வொரு ஆண்டும் படங்களை முடித்து வெளிவருதல்\nIII)இலகுவான வேலையை மட்டுமே விரும்புதல்\n', 'இருசொற்பெயர் இடுதல் முறையை லின்னேயஸ் முதன்முதலில் தம்முடைய _____ என்னும் புத்தகத்தில் குறிப்பிட்டுள்ளார்\n', ' ஒரு செல் உயிரியல் சில பாசிகள் நகர்ந்து செல்லக்கூடியவை. அதற்கு எடுத்துக்காட்டு ?\n', 'பின்வரும் கூற்றுகளில் சரியானவை எவை?\n1.ஒரு பொதுத் துறையின் சொத்துக்கள் அப்பகுதி மக்களுக்கு சொந்தம்\n2.ஒரு தனியார் துறையின் சொத்துக்கள் தனிநபர்களுக்கு சொந்தம்\n3.பொதுத் துறையில் பணியாற்றுபவர்களின் ஊதியம் ஆனது அரசாங்கத்தால் வழங்கப்படுகின்றது\n4.தனியார் துறையில் பணியாற்றுபவர்களின் ஊதியம் ஆனது அந்நிறுவனத்தின் உரிமையாளரால்  வழங்கப்படுகின்றது.\n', 'மத்திய புலனாய்வுத் துறையின் இயக்குனர் மற்றும் இதர ஊழியர்களை தேர்வு செய்யும் தேர்வுக் குழுவில் இடம் பெறாதவர் யார் ?\n', 'பின்வரும் காரணங்களால் உருவாகும் வேலையின்மை எது?\nI)ஒரு பொருளுக்கான தேவை குறைதல் அல்லது பிற பொருட்களின் தேவை அதிகரித்தல்\nII)இடுபொருட்கள் இன்மை\nIII) முதலீடு அல்லது மூலதன பற்றாக்குறை\n', 'ஒரு செல் உயிரியல் சில பாசிகள் நகர்ந்து செல்லாமல் ஒரே இடத்தில் இருக்கும். அதற்கு எடுத்துக்காட்டு?\n', '______ வகைபாசிகள் உயர் தாவரங்களை போன்ற உடல் அமைப்பினை கொண்டுள்ளன.\n', 'பின்வருவனவற்றுள் பொதுத்துறை நிறுவனம் அல்லாதது எது ?\n', 'மத்திய கண்காணிப்பு ஆணையம் - Central vigilance commission  (CVC) , சந்தானம் கமிட்டி பரிந்துரைபடியும்,மத்திய அரசின் ஆட்சித்துறை தீர்மானத்தின் மூலமும் உருவாக்கப்பட்ட ஆண்டு என்ன?\n', 'CVC பற்றிய பின்வரும் கூற்றுகளில் தவறானது எது?\n', 'மறைமுக வேலையின்மையில்\n', '1776 ஆம் ஆண்டு “நாடுகளின் செல்வம் பற்றிய இயல்பு மற்றும் காரணங்கள்” என்ற புத்தகத்தை வெளியிட்டவர் யார்?\n', 'பாசிகளில்  எத்தனை வகைகளில் இனப்பெருக்கம் நடைபெறுகின்றன.\n  ', 'பாசிகளில் உடலபெருக்கம் ______ மூலம் நடைபெறுகிறது\n', 'பின்வருவனவற்றுள் எது/எவை தற்கால வேலைவாய்ப்பு போக்குகள் ஆகும்?\n1. அதிகரித்துவரும் சுய வேலைவாய்ப்பு\n2.குறைந்துவரும் சுய வேலைவாய்ப்பு\n3.நிறுவனங்கள் பெருமளவில் நிரந்தர ஊழியர்களை பயன்படுத்துதல் மற்றும் நீண்ட கால ஒப்பந்த பணிகளை தருதல் 4.நிறுவனங்கள் ஒரு சில நிரந்தர ஊழியர்களையே பயன்படுத்துதல் மற்றும் குறுகிய கால ஒப்பந்த பணிகளை தருதல்\n5.பகுதிநேர வேலைவாய்ப்பில் ஒரு வளர்ச்சி இருந்து வருகிறது', 'மத்திய கண்காணிப்பு ஆணைய தேர்வுக் குழுவில் இடம் பெறாதவர் யார்?\n', 'மத்திய கண்காணிப்பு ஆணைய தேர்வுக் குழுவால் பரிந்துரைக்கப்படுபவர்களை நியமிப்பவர் யார்?\n', 'வேலை பற்றிய தொன்மை கோட்பாடானது, பின்வரும் யாரால் வளர்ச்சி பெற்றது?\n', 'பின்வரும் எந்தக் கொள்கையை அரசு பின்பற்றும் என்று தொன்மை பொருளியல் அறிஞர்கள் நம்பினர்?\n', 'பாசிகளில் பாலிலா இனப்பெருக்கம் ______ மூலம் நடைபெறுகிறது.\n', 'ஜப்பான், இங்கிலாந்து, இந்தியா போன்ற நாடுகளில் எவ்வகை பாசிகளை மக்கள் உணவாக உட்கொள்கின்றனர்?\n', 'தமிழகத்தில் அதிகம் பேருக்கு வேலை அளித்துக் கொண்டிருக்கும் துறை எது ?\n', 'கூற்று: நாட்டின் மொத்த உள்நாட்டு உற்பத்தியில் ஒரு கடுமையான வீழ்ச்சி ஏற்பட்டுள்ள போதிலும் தமிழகத்தில் விவசாயமே அதிகம் பேருக்கு வேலை  அளித்துக் கொண்டிருக்கிறது\nகாரணம்: விவசாயம் அல்லாத துறைகள், உழைப்பாளர்கள் குழு தொழில்களை மாற்றிக் கொள்வதற்கு போதுமான அளவு வேலைவாய்ப்பை உருவாக்கவில்லை\n', 'மத்திய கண்காணிப்பு ஆணையர்களின் பதவிக்காலம் என்ன?\n\n', 'மத்திய கண்காணிப்பு ஆணையர்களை, பதவிநீக்கம் செய்யும் அதிகாரம் கொண்டவர் யார்?\n', 'சந்தை (அங்காடி) விதியை உலகிற்கு அளித்த பிரஞ்சு பொருளியல் அறிஞரான ஜே.பி.சே அவர்களின் கூற்று எது ?\n', 'சே அவர்களின் கருத்துப்படி ஒரு பொருளாதாரத்தில்_____\n', 'எவ்வகை பாசிகள் வீட்டு விலங்குகளுக்கு உணவாக பயன்படுகின்றன.\n', '____ வகை பாசிகள் வளிமண்டல நைட்ரஜனை மண்ணில் நிலை நிறுத்தவும் மண்ணின் வளத்தை அதிகரிக்கவும் உதவுகின்றன.\n', 'இருவேல்பட்டு கிராமம் அமைந்துள்ள மாவட்டம் எது?\n', 'இருவேல்பட்டு கிராமம் எவ்வாறு அழைக்கப்படுகின்றது?\n', 'மத்திய கண்காணிப்பு ஆணையர்கள் எப்போது பணி நீக்கம் செய்யப்படலாம்?\n1. குடியரசுத் தலைவரின் கருத்துபடி, உடல் அளவிலோ (அ) மனதளவிலோ இப்பணியிணை செய்ய தகுதி இல்லாதிருத்தல் 2.அலுவல்களை பாதிக்கும் வண்ணம், ஏதேனும் வருவாய் மற்றும் பிறவற்றை பெறுதல்\n3.வேலை செய்யும் திறன் அற்றவராக இருத்தல்\n4. பணம் வருமானம் வரும் தொழிலில் ஈடுபட்டு இருத்தல்\n', 'முதலாளித்துவ நாடுகளில் குறைவான வேலை உள்ளதால், முழு வேலை வாய்ப்புக்கு சாத்தியமில்லை என்று கூறுபவர் யார்?\n', '_____ என்பது சிவப்பு பாசிகளில் இருந்து எடுக்கப்படுகிறது. இது ஆய்வகங்களில் வளர்ச்சி ஊக்கியாகவும் விளங்குகிறது?\n', 'எவ்வகை பாசிகளில் இருந்து அயோடின் பெறப்படுகிறது?\n', 'இருவேல்பட்டு கிராம மக்களுக்கு இன்றளவும் அதிக வேலைவாய்ப்பை வழங்குவது எது?\n', 'மேகமலை வன உயிரின சரணாலயம், ஸ்ரீவில்லிபுத்தூர் சாம்பல் அணில்கள் சரணாலயம் ஆகியவற்றை இணைத்து “தமிழகத்தின் ஐந்தாவது புலிகள் காப்பகமாக” பின்வரும் எதை தமிழக அரசு அறிவித்துள்ளது?\n', ' மத்திய ஊழல் கண்காணிப்பு ஆணையருக்கு வழங்கப்படும் சம்பளம் மற்றும் சலுகைகள் ஆகியவை யாருக்கு வழங்கப்படும் சம்பளம் மற்றும் சலுகைகளை ஒத்திருக்கின்றன?\n', 'பின்வரும் எச்சட்டத்தின் கீழ் ஒரு மத்திய அரசு ஊழியர் குற்றம்சாட்டப்பட்டால், அதை மத்திய கண்காணிப்பு ஆணையம் விசாரிக்கும்?\n', 'நவீன பொருளாதார கோட்பாடுகளின் வளர்ச்சியில் ஒரு திருப்பு முனையாக உள்ள புத்தகமான “வேலைவாய்ப்பு, வட்டி மற்றும் பணம் பற்றிய பொதுக்கோட்பாடு” என்ற நூலை எழுதியவர் யார்?\n\n', 'விண்வெளிப் பயணத்தின் போது ______ வகை பாசி, கார்பன்-டை-ஆக்சைடை அகற்றுவதற்கும் மனித கழிவுகளை மக்க செய்வதற்கும் பயன்படுகிறது?\n\n', 'பூஞ்சைகளின் செல்சுவர் ஆனது ______ என்ற வேதிப்பொருளால் ஆனது\n\n\n\n', 'இந்திய கூடைப்பந்து சம்மேளனத்தின் துணைத் தலைவராக தேர்வு செய்யப்பட்டுள்ளவர் யார்?\n', 'சுற்றுலா பயணிகளை கவரும் வகையில் 3,600 கோடி செலவில் பிரம்மாண்டமான “வீர சிவாஜி சிலையை” அமைக்க திட்டமிட்டுள்ள மாநிலம் எது?\n', ' CVC யின் நீதிமன்றமானது பின்வரும் எந்நீதிமன்றத்தின் அதிகாரத்தைக் கொண்டுள்ளது ?\n', 'பின்வரும் கூற்றுகளில் தவறானது எது?\n\n', 'பின்வரும் வாக்கியங்களில் சரியானவை எவை?\n1.கீன்சின் கோட்பாடு, முழு வேலைவாய்ப்பு என்ற கருத்தை மட்டுமே விளக்குகிறது. குறைந்த வேலை நிலைக்கும்(Underemployment)வாய்ப்பு இருப்பதை சுட்டிக் காட்டவில்லை\n2.கீன்சின் கோட்பாடு ஒரு பொது கோட்பாடாகவே திகழ்ந்தது 3.கீன்சின் கோட்பாடு எல்லாவகை சூழ்நிலைகளுக்கும் பொருந்துவதாக இருக்கிறது\n', 'பூஞ்சைகளின் உணவுப் பொருளானது ____ மற்றும் _____ ஆக சேமிக்கப்படுகின்றன.\n', 'பூஞ்சைகளில் பச்சையம் கிடையாது. எனவே இவை ......... உயிரிகள் எனப்படும்\n', 'இந்தியாவின் முதல் புவிவெப்ப மின் திட்டத்தை எண்ணெய் மற்றும் எரிவாயு கழகம்( ஓ.என்.ஜி.சி ) பின்வரும் எப்பகுதியில் செயல்படுத்த உள்ளது ?', 'நில உரிமையாளர்களை குறிக்கும் வகையில் தனித்துவமான “18 இலக்க யுனிகோட்” திட்டத்தை அறிமுகப்படுத்தி உள்ள மாநிலம் எது ?', 'மத்திய ஊழல் கண்காணிப்பு ஆணைய சட்டம் 2003 இன் படி, மத்திய ஊழல் கண்காணிப்பு ஆணையம், தமது நடவடிக்கைகள் குறித்த ஆண்டு அறிக்கையை யாரிடம்/ எதனிடம் சமர்ப்பிக்கிறது?', 'முதன் முதலில் குஜராத் மாநிலத்தில் ஜூனாகத் என்ற இடத்தில், லோக் அதாலத் நடைபெற்ற நாள் என்ன ?\n', 'வேலைவாய்ப்பு மற்றும் வருமானம் பற்றிய கீன்ஸ் கோட்பாட்டின் ஆரம்பப்புள்ளி எது?', 'ஆஸ்பியா கோஸ்பி மற்றும் எரிமோதீசியம் ஆஸ்பியி போன்ற பூஞ்சைகள் _______ ஐ உருவாக்குகின்றன.', 'ஈஸ்டில் உள்ள இன்வர்டேஸ்,சைமேஸ் போன்ற நொதிகள் சர்க்கரை கழிவிலிருந்து நொதித்தல் மூலம் _____ உருவாக்குகிறது', 'உலக வர்த்தக அமைப்பின் இயக்குனர் ஜெனரலாக தேர்வு செய்யப்பட்டுள்ள முதல் பெண் யார் ?', 'உலகின் முதல் பொதுமக்களுக்கான விண்வெளிப் பயணத் திட்டத்தை (ஸ்பேஸ் எக்ஸ்) அறிவித்துள்ள நாடு எது?', 'வழக்குகளுக்கு விரைவாக தீர்வு காண உதவும் மெகா லோக் அதாலத் நாடு முழுவதும் நடைபெற்ற நாள் எது?', 'கூற்று: விளைவு தேவை தேசிய வருவாய்க்கு சமமாக இருக்காது\n காரணம்: தொழில் முயல்வோர்கள், வட்டி, வாடகை,கூலி மற்றும் லாபம் போன்றவற்றை பணமாகவே கொடுப்பார்கள்', 'எந்த தாவரம் தீராத வயிற்றுப்போக்கு சீதபேதி ஆகியவற்றை குணப்படுத்துகிறது', 'எந்த முழு தாவரம் மஞ்சள் காமாலை மற்றும் கல்லீரல் நோய்க்கு மருந்தாக பயன்படுகிறது?', 'இந்தியாவைச் சேர்ந்த எந்த ஆன்மிகத் தலைவர் அமெரிக்கப் பல்கலைக் கழகத்தால் “சர்வதேச குடியுரிமை தூதராக” அங்கீகரிக்கப்பட்டுள்ளார்?', 'தமிழகத்தில் கொத்தடிமை தொழிலாளர் ஒழிப்பு தினம் என்று அனுசரிக்கப்படுகிறது?', 'லோக்பால் (பொருள்: மக்கள் காவலன்) என்ற வார்த்தையை 1963 ஆம் ஆண்டு அறிமுகப்படுத்தியவர் யார்?', 'மக்களின் குறை தீர்க்கும் சிறப்பு ஆணையங்களாக லோக்பால் மற்றும் லோக் ஆயுக்தா அமைப்புகளை பரிந்துரை செய்த நிர்வாக சீர்திருத்த ஆணையத்தின்(1966-1970) தலைவராக இருந்தவர் யார்?', 'மொத்த விளைவு தேவை (Aggregate effective demand) அதிகரிக்கும் போது என்ன நிகழும்?', 'எந்த தாவரத்தின் இலைகளும் கனிகளும் இருமல் மற்றும் சளிக்கு மருந்தாகவும், காசநோய் மற்றும் ஆஸ்துமா நோய்க்கு மருந்தாகவும் பயன்படுகிறது?', 'பொதுவாக சார்பசைவானது தூண்டலின் திசையை நோக்கி இருந்தால் அது ____ என்றும், தூண்டலின் திசைக்கு எதிராக இருந்தால் அது _____ என்றும் அழைக்கப்படுகிறது.', 'தூண்டல்களின் தன்மைக்கேற்ப திசைசாரா தூண்டல் அசைவுகள் எவ்வாறு வகைப்படுத்தப்படுகின்றன?', '20 வயதிற்கு உட்பட்டோருக்கான 36 வயது தேசிய ஜூனியர் தடகள சாம்பியன்ஷிப் போட்டிகள் நடைபெற்ற “சாருசஜாய் ஸ்டேடியம்” எம்மாநிலத்தில் உள்ளது?', 'லோக்பால் மசோதா முதன்முதலில் மக்களவையில் அறிமுகம் செய்யப்பட்ட ஆண்டு என்ன?', 'முதன்முதலில் லோக்பால் மசோதா மக்களவையில் நிறைவேற்றப்பட்ட ஆண்டு என்ன?', 'லோக்பால் நடைமுறைக்கு வந்த நாள் எது ?', 'இந்தியாவின் முதன்மை பொருளாதார ஆலோசகராக நியமிக்கப்பட்டுள்ளவர் யார்?', 'தொடுதல் மூலமாக தாவரத்தில் ஏற்படும் விளைவு  _________ ஆகும் ', 'தாவரத்தின் ஒரு பகுதி வெப்பநிலைக்கு ஏற்ப  தன் துலங்களை வெளிப்படுத்துவது _____ எனப்படும்.', 'ஒளிச்சேர்க்கை என்ற சொல்லுக்கு _______ என்பது பொருளாகும் .', 'சூரிய ஒளியை ஈர்க்கக்கூடிய வெஸ்பா ஒரியன்டாலிஸ் (Vespa orientalis) என்ற ______ பூச்சி இனத்தை டெல் அவிவ் பல்கலைக்கழக விஞ்ஞானிகள் கண்டறிந்துள்ளனர்?', '2021 ஆம் ஆண்டின் ரோட்டர்டம் சர்வதேச திரைப்பட விழாவில் டைகர் விருது பெற்ற தமிழ் திரைப்படம் எது?', 'லோக்பாலின் நோக்கங்களில் தவறாக கொடுக்கப்பட்டுள்ளது எது?', 'லோக்பால் அமைப்பில் 1 தலைவர் மற்றும் அதிகபட்சமாக _____ உறுப்பினர்கள் உள்ளனர்.', 'தாவரங்களில் உள்ள திசு தொகுப்புகளை மூன்று வகைகளாக வகைப்படுத்தியவர் யார்?', 'இலைகளின் வெளிப்புறச் சுவரில் ________ என்ற மெழுகு படலம் காணப்படுகிறது.', 'லோக்பால் அமைப்பில் எத்தனை சதவீதத்தினர் நீதித் துறையை சேர்ந்த உறுப்பினர்கள் ஆவர்?', 'நீர் மற்றும் கனிமங்களை தாவரத்தின் அனைத்து உறுப்புகளுக்கும் கடத்துவது எது?', 'சைலமும் புளோயமும் அடுத்தடுத்து வெவ்வேறு ஆரங்களில் அமைந்துள்ள அமைப்பு எவ்வாறு அழைக்கப்படுகிறது?', ' சான்ஸ் என்ற நிமோனியா விழிப்புணர்வு பிரச்சாரத்தை எம்மாநிலத்தின் சுகாதாரத்துறை தொடங்கியுள்ளது ?', 'லோக்பாலின் தலைவராக பதவி வகிக்க தேவைப்படும் குறைந்தபட்ச வயது என்ன?', 'லோக்பாலின் தலைவரையும் உறுப்பினர்களையும் தேர்வு செய்யும் தேர்வுக்குழுவில் இடம்பெறாதவர் யார்?', 'சைலத்திற்கும் புளோயத்திற்கும் இடையில் ______ காணப்பட்டால் அவை திறந்த ஒருங்கமைந்த வாஸ்குலார் கற்றை என அழைக்கப்படுகிறது?', 'புரோட்டோசைலம் மையத்தை நோக்கியும் மெட்டாசைலம் வெளிப்புறத்தை நோக்கியும் காணப்படுவது ?', '“பொருட்கள் மற்றும் பணிகளின் நுகர்வு மற்றும் மூலதனத்திற்காக செலவு செய்யப்பட்ட பணமே விளைவு தேவையாகும்”என்பது யாருடைய வேலை வாய்ப்பு கோட்பாடாகும்?', 'லோக்பாலின் தலைவர் மற்றும் உறுப்பினர்களின் ஊதியம் மற்றும் படிகள் எப்பதவிக்கு இணையாக இருக்கும் ?', 'இருவித்திலைத் தாவரவேரின் வெளிப்புற அடுக்கு _____ அல்லது ______ எனப்படும்.', 'இருவித்திலைத் தாவரவேரில் எது பல அடுக்கு செல் இடைவெளியுடன் கூடிய நெருக்கம் இன்றி அமைந்த பாரன்கைமா செல்களால் ஆனது ?', 'உலக பருப்பு தினம் அனுசரிக்கப்படும் நாள் எது?', 'லோக்பால் அமைப்பு எந்த நீதிமன்றத்திகுரிய அங்கீகாரத்தை பெற்றுள்ளது?', 'லோக்பால் இன் அதிகார எல்லைக்குள் வராதது ?', 'லோக்பாலை முன்மாதிரியாகக் கொண்டு மாநிலங்கள் அமைக்க வேண்டியது?', 'இருவித்திலைத் தாவரவேரில் இளம் வேர்களில் நடுவில் காணப்படும், முதிர்ந்த வேர்களில் இவை காணப்படுவதில்லை அது', 'ஒருவித்திலைத் தாவர தண்டில் சைல குழாய்கள் ஆங்கில எழுத்து ____ வடிவில் அமைந்துள்ளது?\n', 'லோக்பால் அமைக்கப்பட்ட எவ்வளவு காலத்திற்குள், மாநிலச் சட்டத்தின் மூலம் லோக் ஆயுக்தா அமைக்கப்படவேண்டும்?', 'பின்வருபவர்களுள் லோக்பாலின் அதிகார கட்டுப்பாட்டின்கீழ் கொண்டுவரப்பட்டுள்ளவர்களில் சேராதவர் யார்?', 'ஒருவித்திலைத் தாவர தண்டில் முதிர்ந்த வாஸ்குலார் கற்றையில் சில புரோட்டோசைல கூறுகள் சிதவடைவதால் ஒரு இடைவெளி ஏற்படுகிறது. இதற்கு _____ என்று பெயர்.', 'இலையின் மேல்புற தோலுக்கும் கீழ்ப்புற தோலுக்கும் இடையே காணப்படும் தள திசு ______ எனப்படும்.', ' ______ க்குமேல் நன்கொடை பெறும் வழக்குகள் லோக்பால் அமைப்பால் விசாரிக்கப்படும் .', 'பிரதமர் மீதான புகார்கள், லோக்பாலின் எத்தனை பங்கு அமர்வாளர்களின் ஒப்புதலுக்கு பின்னரே அனுமதிக்கப்படும்?', 'இருவித்திலைத் தாவரஇலையின் கோளவடிவ அல்லது உருளையான அல்லது ஒழுங்கற்ற வடிவம் கொண்ட செல்கள் நெருக்கும் இன்றி செல் இடைவெளிகளுடன் அமைந்துள்ள ஸ்பாஞ்சி பாரன்கைமா எதற்கு உதவுகிறது', 'லோக்பால் இல் அளிக்கப்படும் தவறான புகார்களுக்கு விதிக்கப்படும் தண்டனை என்ன?', 'ஊழல் செயலில் ஈடுபடும் பொது ஊழியருக்கு, லோக்பாலால் எத்தனை ஆண்டுகள் சிறை தண்டனை விதிக்கப்படுகிறது ?\n', 'தாவரங்கள் மற்றும் ஆல்காகளில் எத்தனை வகையான கணிகங்கள் உள்ளன?', 'ஆம்புட்ஸ்மேன்(OMBUSDSMAN- குறைகேள் பிரதிநிதி) எம்மொழியில் உள்ள ஆம்பூட்  என்ற சொல்லிலிருந்து பெறப்பட்டது?', 'பச்சை நிறமிகளை(chlorophyII)கொண்டுள்ள பசுங்கணிகம் 2 - 10 மைக்ரோமீட்டர் விட்டமும் 1 மைக்ரோமீட்டர் தடிமனும் கொண்ட ஒரு ______ வடிவ செல் நுண்ணுறுப்பு ஆகும் .', 'காமன்வெல்த் நாடுகளில் முதன் முதலில் ஊழல் தடுப்பு அமைப்புகளை கொண்டுவந்த நாடு எது?', 'நியூசிலாந்தில் OMBUSDSMAN அமைப்பு எவ்வாறு அழைக்கப்படுகிறது?', 'பல தைலக்காய்டுகள் ஒன்றன் மீது ஒன்றாக அடுக்கி வைக்கப்பட்ட நாணயம் போன்று உள்ளது, இது _____ என்று அழைக்கப்படுகிறது .', 'பசுங்கணிகத்தின் பணிகள் யாவை?', '1964 சந்தானம் குழுவின் பரிந்துரையின்படி லஞ்ச ஒழிப்பு மற்றும் ஊழல் எதிர்ப்பு இயக்குநரகத்தை தமிழ்நாடு அரசு ஏற்படுத்திய ஆண்டு என்ன?', 'ஒளிச்சேர்க்கையில் ஏனைய நிறமிகள் ஆன பச்சையம் b மற்றும் கரோட்டினாய்டு போன்றவை _____ என்று அழைக்கப்படுகிறது', 'முதன்மை நிறமி (வினைமையம் - பச்சையம் a) மற்றும் துணை நிறமிகள்( ஏற்பி நிறமி மூலக்கூறுகள் மையம்) இரண்டும் சேர்ந்து _____ என்று அழைக்கப்படுகிறது', 'மாநில அரசு ஊழியர்களுக்கு எதிரான ஊழல் குற்றச்சாட்டுகளை விசாரிக்கும் அமைப்பு எது ?', 'முதன் முதலாக லோக் ஆயுக்தா சட்டத்தை இயற்றிய மாநிலம் மற்றும் ஆண்டு?', 'ஒளிச்சேர்க்கையின் முழு நிகழ்ச்சியும் _____ உள்ளே நடைபெறுகிறது.', 'ஒளி சார்ந்த வினை அல்லது ஒளி வினை பசுங்கணிகத்தின் ______ லும், ஒளி சாரா வினை அல்லது இருள்வினை பசுங்கணிகத்தின் _____லும் நடைபெறுகிறது.', 'லோக் ஆயுக்தா அமைப்பை முதல் முதலில்(1971) உருவாக்கிய மாநிலம் எது?', 'மாநிலங்கள் மற்றும் அவற்றின் லோக்ஆயுக்தா உருவாக்கப்பட்ட ஆண்டுகள் கொடுக்கப்பட்டுள்ளன. அவற்றில் தவறான இணை எது?', 'ஒளிசார்ந்த வினை அல்லது ஒளி வினை (ஹில்வினை) யாரால் கண்டறியப்பட்டது?', 'ஒளிசாரா வினை அல்லது இருள் வினையில் ஒளிசார்ந்த வினையில் உண்டான ATP மற்றும் NADPH2 உதவியுடன் CO2 ஆனது ______ ஆக ஒடுக்கம் அடைகிறது.', 'இதுவரை எத்தனை மாநிலங்கள் லோக் ஆயுக்தாவை அமைத்துள்ளன ?', 'லோக் ஆயுக்தாவை அமைக்காத மாநிலங்கள், அவற்றை அமைக்கும் பணியைத் தொடங்க வேண்டும் என்று தொடரப்பட்ட வழக்கு எது?', 'ஒளிசாரா வினை அல்லது இருள்வினை _____ எனவும் அழைக்கப்படுகிறது?', 'லோக் ஆயுக்தாவின் தேர்வுக்குழு உறுப்பினர்களில் சேராதவர் யார்?', '______ செல்லின் ஆற்றல் நிலையம் என அழைக்கப்படுகிறது', 'லோக் ஆயுக்தாவின் பரிந்துரைக்கு பின்னர், சட்டசபை உறுப்பினர்கள் மீது நடவடிக்கை எடுப்பது யார்?', 'அரசு தகவல்களை மாற்றிக் தருதல் அல்லது வெளியிடுதல் எவ்வாறு அழைக்கப்படுகிறது?', 'மைட்டோகாண்ட்ரியாவின் உட்புறச்சவ்வில் காணப்படும் விரல் போன்ற நீட்சிகள் _____ எனப்படும் .', 'பணமோசடி தடுப்புச் சட்டம் கொண்டுவரப்பட்ட ஆண்டு என்ன?', 'ஒரு மூலக்கூறு குளுக்கோஸ் ஆனது (6 கார்பன்) இரண்டு மூலக்கூறு பைருவிக் அமிலம் ஆக (3 கார்பன்)  பிளக்கப்படும் நிகழ்ச்சி எவ்வாறு அழைக்கப்படுகிறது?']

a = ['A) J.M.கீன்ஸ்', 'A) J.M.கீன்ஸ்', 'A) நேர்புவிநாட்டம்', 'A)ஒளிச்சேர்க்கை மூலம் உணவு தயாரித்தல்', 'A) 1956',
     'A) மத்திய ஊழல் மற்றும் கண்காணிப்பு ஆணையம்(CVC)', 'A) உழைப்பாளர் குடும்பம்', 'A) 18 முதல் 55 வரை', 'A) 1, 2 & 4', 'A) பகுதி வேலைவாய்ப்பு', 'A) முழு வேலை நிலை', 'A)பூக்கும் தாவரங்கள், பூவா தாவரங்கள்', 'A) இலையில்', 'A) 1', 'A) குடியரசுத் தலைவர்', 'A) J.M.கீன்ஸ்', 'A)J.M.கீன்ஸ்', 'A)வெப்ப, மிதவெப்ப, கடல்சார்ந்த, குளிர் பாலைவனங்கள்', 'A) சதுப்புநிலக்காடுகள், வெப்பமண்டலகாடுகள், குளிர்பிரதேசகாடுகள்', 'A) விவசாயத்துறை', 'A) 1, 2 & 4', 'A) வளங்களை', 'A) I & II', 'A) தென்னை', 'A) பாலைவனத் தாவரங்கள் மற்றும் நீர் வாழ் தாவரங்கள்', 'A) முதன்மைத் துறை', 'A) 3.5 %', 'A) ஏ. நரஹரி', 'A) வளம் குன்றிய நாடுகள்', 'A) வாணிபச் சூழல் வேலையின்மை', 'A) 3', 'A)தாவர உலகம்', 'A) பெரோஸ் ஷா துக்ளக்', 'A) வங்கிகள் & ரயில்வே', 'A)மக்களின் திரட்டு நிதி சட்டப்படி செலவு செய்யப்படுவதை உறுதி செய்வார். அரசு நிறுவனங்களின் கணக்குகளையும் உறுதி செய்வார்.', 'A) எஸ்.வேணுகோபால் கமிட்டி', 'A) I & II', 'A) தொழில்நுட்ப வேலையின்மை', 'A) ராபர்ட் ஹூக்', 'A) 6', 'A) 27 %', 'A)ஒழுங்கமைக்கப்பட்ட துறைகள்', 'A) 1941', 'A) பிரதமரின் சிறப்பு அதிகாரத்தின் மூலம்', 'A) தொழில்நுட்ப வேலையின்மை', 'A) மரபுவழி வகைப்பாட்டு முறை ', 'A) 6', 'A) பொதுத்துறை', 'A) 1960', 'A) மார்ச் 31, 1964', 'A) I & II', 'A)ஜெனிராபிளான்டாரம்', 'A)கிளாமிடோமோனஸ்', 'A) 1, 3 & 4', 'A)பிரதமர்', 'A)தொழில்நுட்ப வேலையின்மை', 'A) குளோரெல்லா', 'A) வால்வாக்ஸ்', 'A)டாட்டா இரும்பு மற்றும் எஃகு தொழிற்சாலை', 'A) 1963', 'A) CVC ஆனது அரசியலமைப்பு பெற்ற நிறுவனம் ஆகும்', 'A)தேவைக்கு குறைவானவர்கள் ஒரு வேலையில் இருப்பவர்', 'A) ஆடம் ஸ்மித்', 'A) 4', 'A) செல்கள் இணைதல்', 'A) 2, 3 & 5', 'A) பிரதமர்', 'A) மக்களவை சபாநாயகர்', 'A) டேவிட் ரிக்கார்டோ & J.S.மில்', 'A) நிலையான பணவியல் கொள்கை', 'A) ஸ்போர் உருவாதல்', 'A) அல்வா, ஸ்பைருலினா, குளோரெல்லா', 'A)விவசாயம்', 'A)கூற்றும் காரணமும் சரியானவை; மேலும் காரணம் கூற்றுக்கான சரியான விளக்கம்', 'A) 5 ஆண்டுகள் அல்லது 65 வயது வரை', 'A) பிரதமர்', 'A) “அளிப்பு அதன் தேவையை தானே உருவாக்கும்”', 'A) மொத்த உற்பத்தியை விட மொத்த வருவாய் அதிகமாக இருக்கும்', 'A) நாஸ்டாக்,அனபினா', 'A) பச்சைப்பாசிகள்', 'A) விழுப்புரம்', 'A) ஸ்லேட்டர் கிராமம்', 'A) 1 & 2', 'A) கீன்ஸ்', 'A) கிரேசிலேரியா', 'A) பச்சை', 'A) விவசாயம்', 'A) ஸ்ரீவில்லிபுத்தூர் மேகமலை புலிகள் காப்பகம்', 'A) மத்திய பணியாளர் தேர்வு வாரிய தலைவர்', 'A) ஊழல் தடுப்புச் சட்டம் 1988', 'A) கீன்ஸ்', 'A) குளோரெல்லா', 'A) ஈஸ்ட்', 'A) ஆதவ் அர்ஜுனா', 'A) மகாராஷ்டிரா', 'A)மாநில உயர்நீதிமன்றங்கள்', 'A) மத்திய அரசிலிருந்தோ, அல்லது மத்திய அரசு நிறுவனங்களிலிருந்தோ தேவையான தகவல்களை கேட்டுப் பெறும் அதிகாரம் CVC க்கு உண்டு', 'A) 1 & 2 மட்டும்', 'A) ஈஸ்ட் ,லைக்கன்', 'A) தற்சார்பு', 'A)காஷ்மீர் ', 'A)மகாராஷ்டிரம் ', 'A) நாடாளுமன்றம்', 'A) மார்ச் 14, 1982', 'A) வலை தேவை என்ற கருத்து ', 'A) வைட்டமின் B2 ', 'A) நுண்ணுயிர் கொல்லி ', 'A)இந்திரா லூயி', 'A) ரஷ்யா ', 'A) ஆகஸ்ட் 23, 2013', 'A)கூற்றும் காரணமும் சரி; மேலும் காரணம் கூற்றுக்கு சரியான விளக்கமாகும் ', 'A) ஏகில்மார்மிளோஸ்', 'A) அலோவேரா ', 'A) ஜக்கி வாசுதேவ் ', 'A)  பிப்ரவரி 08', 'A) அச்சுத மேனன்', 'A) லால் பகதூர் சாஸ்திரி', 'A) வேலைவாய்ப்பின் அளவில் ஏற்றம் வரும்', 'A) அலோவேரா ', 'A) நேர்சார்பசைவு, எதிர்சார்பசைவு', 'A) திசைசாரா தூண்டல் அசைவு ', 'A) டெல்லி', 'A) 1968', 'A) 1968 ', 'A)  ஜனவரி 16, 2014 ', 'A) சஞ்சய்குமார் போன்சாய்', 'A) நடுக்கமுறுவளைதல்', 'A) நடுக்கமுறுவளைதல்', 'A)ஒளியின் உதவியால் உருவாக்கப்படுதல்', 'A) எறும்பு', 'A) அசுரன்', 'A) பொதுப்பணிகளில் ஊழலை ஒழிப்பது ', 'A) 4', 'A) மெல்வின் ', 'A) கியூடிக்கில் ', 'A) 50 % ', 'A) புளோயம் ', 'A) ஆரப்போக்கு அமைந்த வாஸ்குலார்கற்றை', 'A)தமிழ்நாடு ', 'A) 45 ', 'A) பிரதமர் &  மக்களவை சபாநாயகர் ', 'A) அகத்தோல் ', 'A)உள்நோக்கிய சைலம் ', 'A) J.B.சே', 'A)மக்களவை சபாநாயக்கர் ', 'A) ஸ்டீல் அல்லது பெரிசைக்கிள் ', 'A)புறணி ', 'A) பிப்ரவரி 08', 'A) குற்றவியல் ', 'A)லாபமீட்டும் உள்நாட்டு தனியார் நிறுவனங்கள் ', 'A) லோக் ஆயுக்தா ', 'A)எபிபிளமா', 'A) H', 'A) 6 மாதங்கள்', 'A) குடியரசுத் தலைவர்', 'A) சைலம் ', 'A) ஸ்பாஞ்சி', 'A)2 லட்சம்', 'A) மூன்றில் ஒரு பங்கு ', 'A)நீராவிப்போக்கு நடைபெற', 'A) 6 மாதம் வரை சிறை, ஒரு லட்சம் வரை அபராதம் ', 'A) 2', 'A) ஒன்று ', 'A) ஸ்வீடன்', 'A)வட்டம் ', 'A) ஆஸ்திரேலியா', 'A) பாராளுமன்ற விசாரணை கமிஷனர்', 'A)உறை', 'A) ஒளிச்சேர்க்கை மற்றும் தரசம் சேமித்தல்', 'A) 1964', 'A) வினைமையம்', 'A) ஒளித்தொகுப்பு ', 'A)லோக்பால் ', 'A) அசாம் & 1970 ', 'A) தண்டுகள்', 'A) உறையிலும், ஸ்ட்ரோமாவிலும்', 'A) உத்தரப் பிரதேசம் ', 'A) ராஜஸ்தான் - 1973 ', 'A) மெல்வின்', 'A) கார்பன் மோனாக்சைடு', 'A) 15', 'A) இந்திரா சஹானி வழக்கு ', 'A) கால்வின் சுழற்சி ', 'A) முதல்வர்', 'A) தசை செல்கள் ', 'A) ஆளுநர் ', 'A) தகவல் ஊழல்', 'A)நிறமிகள் ', 'A) 1988 ', 'A)கிளைக்காலிசிஸ் ']

b = ['B) J.B.சே', 'B)J.B.சே', 'B)வெளிபுவிநாட்டம்', 'B)சுவாசித்தல்', 'B) 1966',
     'B) ஒருங்கிணைந்த ஊழல் மற்றும் கண்காணிப்பு ஆணையம்(IVC)', 'B)உழைப்பாளர் குழு', 'B)15 முதல் 55 வரை', 'B) 1, 3 & 4', 'B)முழு வேலை வாய்ப்பு', 'B)கட்டாய வேலை நிலை', 'B)மூடிய விதை தாவரங்கள், பூவா தாவரங்கள்', 'B) தண்டில்', 'B) 1ம் 3ம்', 'B)பிரதமர்', 'B)J.B.சே', 'B)J.B.சே', 'B) அதிகவெப்ப, கடல்சார்ந்த,குளிர்,வெப்பபாலைவனங்கள்', 'B) மிதவெப்பமண்டலகாடுகள்,குளிர்பிரதேசகாடுகள், மலைக்காடுகள்', 'B)பண்டங்கள் துறை', 'B) 1, 2 & 3', 'B) பணத்தை', 'B) II & III', 'B) மூங்கில்', 'B) நீர் வாழ் தாவரங்கள் மற்றும் நில தாவரங்கள்', 'B)இரண்டாம் முறை', 'B) 4.2 %', 'B)எஸ். நவகாளி', 'B)வளரும் நாடுகள்', 'B) பருவகால வேலையின்மை', 'B) 5', 'B) பெயரிடுதல்', 'B) குத்புதீன் ஐபக்', 'B)காப்பீட்டு நிறுவனங்கள் மற்றும் உற்பத்தித் தொழிற்சாலைகள்', 'B)பொது கணக்கு குழுவின் நண்பர் மற்றும் வழிகாட்டியாக செயல்படுவார்.', 'B)நீதிபதி ராஜன் கமிட்டி', 'B) II & III', 'B)பருவகால வேலையின்மை', 'B)கிரிகோர் மெண்டல்', 'B) 3', 'B) 24 %', 'B)ஒழுங்கமைக்கப்படாத துறைகள்', 'B) 1946', 'B)குடியரசுத் தலைவரின் பரிந்துரையின் மூலம்', 'B) கற்றோர் வேலையின்மை', 'B)செயற்கை வகைப்பாட்டு முறை', 'B) 3', 'B) தனியார் துறை', 'B) 1961', 'B) அக்டோபர் 2, 1964', 'B) II & III', 'B)ஸ்பீசஸ்பிளான்டாரம்', 'B) குளோரெல்லா', 'B) 1, 2 & 4', 'B)மக்களவை சபாநாயகர்', 'B) அமைப்புசார் வேலையின்மை', 'B) வால்வாக்ஸ்', 'B)அமேக்ரோசிஸ்டிஸ்', 'B)நெய்வேலி பழுப்பு நிலக்கரி நிறுவனம்', 'B) 1964', 'B) இது பாராளுமன்றத்தால் அங்கீகரிக்கப்பட்ட நிறுவனம் அல்ல', 'B) தேவைக்கு அதிகமானவர்கள் ஒரு வேலையில் இருப்பர்', 'B) J.M.கீன்ஸ்', 'B) 6', 'B) ஸ்போர்ம் உருவாதல்', 'B) 1, 4 & 5', 'B)மத்திய உள்துறை அமைச்சர்', 'B) உச்சநீதிமன்ற தலைமை நீதிபதி', 'B)J.B.சே', 'B) தேர்ந்தெடுக்கப்பட்ட பணவியல் கொள்கை', 'B) செல்கள் இணைதல்', 'B) நாஸ்டாக், அனபினா', 'B)உற்பத்தித்துறை', 'B)கூற்று சரி; காரணம் தவறு', 'B) 4 ஆண்டுகள் அல்லது 68 வயது வரை', 'B) குடியரசுத் தலைவர்', 'B) “தேவை அதன் அளிப்பை தானே உருவாக்கும்”', 'B)மொத்த உற்பத்தியை விட மொத்த வருவாய் குறைவாக இருக்கும்', 'B)லேமினேரியா', 'B) நீலப்பச்சைப்பாசிகள்', 'B) திருவண்ணாமலை', 'B)கிளார்க் கிராமம்', 'B) 2 & 3', 'B) சாமுவேல்சன்', 'B)அனபினா', 'B) பழுப்பு', 'B)தொழில்துறை', 'B) வால்பாறை மேகமலை புலிகள் காப்பகம்', 'B) இந்திய குடிமைப் பணியாளர் தேர்வு வாரிய தலைவர்', 'B) ஊழல் தடுப்புச் சட்டம் 1989', 'B)சாமுவேல்சன்', 'B) ஸ்பைருலினா', 'B) கிளைகோஜன்', 'B) நீரவ் ஷா', 'B)உத்திரப்பிரதேசம்', 'B) குற்றவியல் நீதிமன்றம்', 'B) CVC ன் அறிக்கை / அறிவுரையின் மேல் மத்திய அரசு நடவடிக்கை எடுக்கலாம் எடுக்காமல் போகலாம்', 'B) 2 & 3 மட்டும்', 'B) கிளைக்கோஜனாகவும் , எண்ணெயாகவும்', 'B)பிறசார்பு', 'B)மேகாலயா', 'B)தெலுங்கானா ', 'B) குடியரசுத் தலைவர் ', 'B) ஏப்ரல் 1, 1986', 'B)அளிப்பு தேவை என்ற கருத்து ', 'B)வைட்டமின் சி ', 'B)அல்கஹால் ', 'B) ஸ்டெபி மார்கஸ் ', 'B)அமெரிக்கா ', 'B) செப்டம்பர் 13, 2014', 'B)கூற்று சரி;காரணம் தவறு ', 'B) யூஃபோர்பியேசி ', 'B)சொலானம் டிரைலோபேட்டம் ', 'B) ஸ்ரீ ஸ்ரீ ரவிசங்கர் ', 'B) பிப்ரவரி 09', 'B) சந்தானம் ', 'B) மொரார்ஜி தேசாய் ', 'B) வேலைவாய்ப்பின் அளவில் இறக்கம் வரும் ', 'B)சொலானம் டிரைலோபேட்டம் ', 'B) ஒளிசார்பசைவு, புவிசார்பசைவு', 'B)எதிர் ஒளிசார்பசைவு ', 'B) ஒரிசா', 'B) 1966', 'B) 1966', 'B)  டிசம்பர்18, 2013', 'B) மதன்குமார் அலுவாலியா', 'B) திசைசாரா தூண்டல் ', 'B) திசைசாரா தூண்டல் ', 'B) வெப்பமுறுவளைதல் ', 'B) கரப்பான்பூச்சி ', 'B) ராட்சசி ', 'B)பிரதமர் தவிர்த்த பிற பொது பணியாளர்களை பொறுப்பேற்க செய்தல் ', 'B) 10', 'B)கால்வின் ', 'B)வாஸ்குலார்', 'B) 33 %', 'B)சைலம் ', 'B) ஒன்றிணைந்த வாஸ்குலார்கற்றை', 'B)ஆந்திரா', 'B) 50', 'B)மக்களவை எதிர்க்கட்சித் தலைவர் ', 'B)புறணி ', 'B)இருபக்க ஒருங்கமைந்தவை ', 'B) J.M.கீன்ஸ் ', 'B)மாநிலங்களவை தலைவர்', 'B)எபிபிளமா அல்லது அகத்தோல்', 'B)அகத்தோல்', 'B) பிப்ரவரி 09', 'B)உரிமையியல் ', 'B)அனைத்து பொதுபணியாளர்கள் ', 'B)லோக் ஜனசங் ', 'B) பித் ', 'B) U', 'B) 3 மாதங்கள்', 'B) பிரதமர்', 'B)வாஸ்குலார் கற்றை', 'B) பாலிசேட்', 'B) 5 கோடி', 'B)நான்கில் ஒரு பங்கு', 'B) வாயு பரிமாற்றத்திற்கு', 'B)ஒரு வருடம் வரை சிறை, ஒரு லட்சம் வரை அபராதம்', 'B) 4', 'B)மூன்று', 'B) லத்தின் ', 'B)கூம்பு ', 'B) நியூசிலாந்து', 'B) ஒருங்கிணைந்த விசாரணைகள் ஆணையம்', 'B) தைலக்காய்டு ', 'B) கொழுப்பு அமில உற்பத்தி மற்றும் பசுங்கணிகம் உருவாக்கம்', 'B) 1965', 'B) ஒளித்தொகுப்பு ', 'B)வினைமையம் ', 'B)லோக் ஆயுக்தா', 'B)ராஜஸ்தான் & 1972 ', 'B) மலர் மொட்டுகள் ', 'B) கிரானாவிலும்,ஸ்ட்ரோமாவிலும்', 'B)ஆந்திரப் பிரதேசம்', 'B)மத்திய பிரதேசம் - 1981 ', 'B) C.N.R.ராவ் ', 'B) ஆக்சிஜன்', 'B) 18', 'B)எஸ்.ஆர்.பொம்மை வழக்கு', 'B)கிரிஸ்டே சுழற்சி', 'B) ஆளுநர்', 'B)உட்புறசவ்வு', 'B)முதல்வர்', 'B) புள்ளிவிவர ஊழல்', 'B)கிரிஸ்டே ', 'B) 2005', 'B) கிரப் சுழற்சி ']

c = ['C)காரல் மார்க்ஸ்', 'C)பிடெரிக் ஏங்கெல்ஸ்', 'C) எதிர்ப்புவிநாட்டம்', 'C) நீராவிப்போக்கு நடைபெறுதல்', 'C) 1976',
     'C)இந்திய ஊழல் மற்றும் கண்காணிப்பு ஆணையம்(IVC)', 'C)உழைப்பாளர் வர்க்கம்', 'C)18 முதல் 60 வரை', 'C) 1 & 4', 'C)கட்டாய வேலை வாய்ப்பு', 'C)நிறைவடைந்த வேலை நிலை', 'C)பூக்கும் தாவரங்கள், திறந்த விதை தாவரங்கள்', 'C) வேரில்', 'C) 1ம் 2ம்', 'C)நாடாளுமன்றம்', 'C)லர்னர்', 'C) லர்னர்', 'C) காற்று,கடல்சார்ந்த,குளிர்,வெப்பபாலைவனங்கள்', 'C)வெப்பமண்டலகாடுகள், குளிர்பிரதேசகாடுகள்,மலைக்காடுகள்', 'C)தொழில் துறை', 'C) 2, 3 & 4', 'C)வருமானத்தை', 'C) I & III', 'C) மாமரம்', 'C) நில தாவரங்கள் மற்றும் பாலைவனத் தாவரங்கள் ', 'C)மூன்றாம் துறை', 'C) 5%', 'C)ராஜீவ் மெஹ்ரிஷி', 'C)வளர்ந்த நாடுகள்', 'C) கல்லாதோர் வேலையின்மை', 'C) 7', 'C)வகைப்பாட்டியல்', 'C) ஹுமாயூன்', 'C) வீட்டு உபயோகப் பொருட்கள், சிறு மற்றும் குடிசைத் தொழில்கள்', 'C)ஜனாதிபதியின் கையொப்பமிட்ட கணக்குகளை சரி பார்ப்பார்', 'C)சந்தானம் கமிட்டி', 'C) I & III', 'C) கற்றோர் வேலையின்மை', 'C)ப்ராட்வின்', 'C) 5', 'C) 49 %', 'C) அமைப்புசார்ந்த துறைகள்', 'C) 1963', 'C)அரசமைப்புச் சட்டத்திருத்தத்தின் மூலம்', 'C)உடன்பாடில்லா (பிறழ்ச்சி) வேலையின்மை', 'C) இயற்கை வகைப்பாட்டு முறை', 'C) 2', 'C) அமைப்புசாரா துறை', 'C) 1962', 'C) மார்ச் 31, 1963', 'C) I & III', 'C)லின்னேயஸ்பிளான்டாரம்', 'C)தாலோபைட்டா', 'C) 2, 3 & 4', 'C) மக்களவை எதிர்க்கட்சித் தலைவர்', 'C) அமைப்புசாரா வேலையின்மை', 'C) மேக்ரோசிஸ்டிஸ்', 'C) கேரா', 'C) இந்திய உருக்கு ஆணையம்', 'C) 1965', 'C) செப்டம்பர் 2003 இல் நாடாளுமன்றம் இவ்வமைப்பிற்கு சட்ட அந்தஸ்து அளித்தது', 'C) தேவைப்படும் எண்ணிக்கையில் தொழிலாளர்கள் ஒரு வேலையில் இருப்பர்', 'C)லயனல் ராபின்ஸ்', 'C) 3', 'C) துண்டாதல்', 'C) 1, 2, 3 & 4', 'C) மக்களவை எதிர்க்கட்சித் தலைவர்', 'C) குடியரசுத் தலைவர்', 'C) A.C.பிகு', 'C) தலையிடாக்கொள்கை', 'C) துண்டாதல்', 'C) ஜெளிடியம், கிரேசிலேரியா', 'C)சேவைத் துறை', 'C)கூற்று தவறு; காரணம் சரி', 'C) 5 ஆண்டுகள் அல்லது 68 வயது வரை', 'C)மக்களவை சபாநாயகர்', 'C) “அளிப்பு அதன் அளிப்பை தானே உருவாக்கும்”', 'C)மொத்த உற்பத்தியும் மொத்த வருவாயும் சமமாக இருக்கும்', 'C)லேமினேரியா,அஸ்கோபில்லம்', 'C)சிவப்புப்பாசிகள்', 'C) கிருஷ்ணகிரி', 'C) குக் கிராமம்', 'C) 1, 2 & 3', 'C)ஆடம் ஸ்மித்', 'C)அகர் அகர்', 'C) சிவப்பு', 'C)சார்புத் துறை', 'C) ஸ்ரீவில்லிபுத்தூர் ஆழியாறு புலிகள் காப்பகம்', 'C)கேபினட் செயலக தலைமை செயலாளர்', 'C) ஊழல் தடுப்புச் சட்டம் 1986 ', 'C) ஆடம் ஸ்மித்', 'C) குளோரெல்லா பைரினாய்டோசா', 'C) கைட்டின்', 'C) பிரித்வி ஷா', 'C) சண்டிகர்', 'C) உரிமையியல் நீதிமன்றம்', 'C) CVC ன் அறிவுரைகள் நிராகரிக்கப்பட்டதற்கான காரணத்தை மத்திய அரசு தெளிவுபடுத்த வேண்டியது இல்லை', 'C) 1 & 3 மட்டும்', 'C) கிளைகோஜன், கைட்டின்', 'C)இரண்டும்', 'C) ராஜஸ்தான்', 'C)ஒடிசா ', 'C)மாநிலங்களவை', 'C) ஏப்ரல் 20, 1986 ', 'C)ஆயத்தீர்வை என்ற கருத்து', 'C)வைட்டமின் B12', 'C)வைட்டமின்கள் ', 'C)ஸ்டெல்லா க்யூரி', 'C)இங்கிலாந்து', 'C) அக்டோபர் 13, 2014', 'C)கூற்று தவறு ஆனால் காரணம் சரி ', 'C)அலோவேரா ', 'C)ஃபில்லாந்தஸ் அமாரஸ்', 'C) கல்கி பகவான் ', 'C) பிப்ரவரி 07', 'C)அசோக் மேத்தா', 'C)எல்.எம்.சிங்வி ', 'C) வேலைவாய்ப்பின் அளவில் நிலை அற்ற  நிலை இருக்கும்', 'C)ஃபில்லாந்தஸ் அமாரஸ் ', 'C)  நீர்சார்பசைவு, புவிசார்பசைவு ', 'C)ஒளியுறுவளைதல், நடுக்கமுறுவளைதல்', 'C) அசாம்', 'C) 1970', 'C) 1970 ', 'C) ஜனவரி  1, 2014 ', 'C) சஞ்சீவ் சன்யாஸ் ', 'C)ஒளியுறுவளைதல் ', 'C)ஒளியுறுவளைதல் ', 'C)தற்சார்பு ஊட்டம் உடையவை ', 'C)வண்ணத்துப்பூச்சி ', 'C)கூலாங்கல்', 'C)இவை இரண்டும்', 'C) 8', 'C)C.N.R.ராவ் ', 'C) டிரைகோம்கல் ', 'C) 60 % ', 'C)வாஸ்குலார் ', 'C) புளோயம் சூழ் வாஸ்குலார்கற்', 'C) மத்திய பிரதேசம் ', 'C) 55 ', 'C)உச்சநீதிமன்ற தலைமை நீதிபதி', 'C)கேம்பியம்', 'C)சைலம் சூல் வாஸ்குலார் கற்றை ', 'C)லயனல் ராபின்ஸ் ', 'C) உச்சநீதிமன்ற நீதிபதி ', 'C) எபிபிளமா அல்லது ரைசோடெர்மிஸ் ', 'C) எபிபிளமா', 'C) பிப்ரவரி 07', 'C)உயர்நீதிமன்றங்கள் ', 'C)வெளிநாட்டு நன்கொடைகளை பெறும் அரசுசார் அமைப்புகள்', 'C)லோக் அதாலத் ', 'C)பெரிசைக்கிள்', 'C) Y ', 'C) 1 வருடம் ', 'C) மத்திய அமைச்சர்கள்', 'C) புரோட்டோசைல இடைவெளி ', 'C) புறத்தோல் ', 'C) 10 லட்சம்', 'C) நான்கில் இரண்டு பங்கு', 'C) ஒளிச்சேர்க்கை பணியை மேற்கொள்ள ', 'C) 6 மாதம் வரை சிறை, 2 லட்சம் வரை அபராதம் ', 'C) 5', 'C) ஐந்து', 'C) கிரேக்கம் ', 'C)நீள் உருண்டை', 'C) இந்தியா ', 'C) ஒருங்கிணைந்த விசாரணை கமிஷன்', 'C)கிராணம் ', 'C) லிப்பிடுகள் சேமிப்பு ', 'C) 1966', 'C)துணை நிறமிகள் ', 'C)நிறமி மூலக்கூறுகள்', 'C) லோக் அதாலத்', 'C)ஒடிசா & 1970 ', 'C)பசுங்கணிகத்தின் ', 'C) தைலக்காய்டிலும்,உறையிலும்', 'C) மகாராஷ்டிரம் ', 'C)கேரளா - 1999 ', 'C)கால்வின்', 'C) கார்போஹைட்ரேட் ', 'C) 20', 'C) அஸ்வினி உபத்தியா வழக்கு ', 'C) ஒளி வினை', 'C) எதிர்க்கட்சித் தலைவர் ', 'C) மைட்டோகாண்ட்ரியா', 'C) சபாநாயகர்', 'C) அரசியல் ஊழல் ', 'C)ஸ்ட்ரோமா', 'C) 2002 ', 'C)வெளி சுவாசம்']

d = ['D) லயனல் ராபின்ஸ்', 'D)லயனல் ராபின்ஸ்', 'D) பக்கவாட்டுபுவிநாட்டம்', 'D)இவை அனைத்தும்', 'D) 1988', 'D) ஏதுமில்லை',
     'D)மேற்கண்ட அனைத்தும்', 'D)15 முதல் 60 வரை', 'D)மேற்கண்ட அனைத்தும்', 'D)நிறைவடைந்த வேலைவாய்ப்பு', 'D)கூடுதல் வேலை நிலை', 'D) மூடிய விதைத்தாவரங்கள், திறந்த விதை தாவரங்கள்', 'D)இவை அனைத்தும்', 'D)3 மட்டும்', 'D)துணை குடியரசுத் தலைவர்', 'D) எட்வின் டக்கர்', 'D)பிட்ஸ் பாரிஸ்டர்', 'D)ஏதுமில்லை', 'D)ஏதுமில்லை', 'D)சார்பு துறை அல்லது சேவை துறை', 'D) மேற்கண்ட அனைத்தும்', 'D)உழைப்பாளர்களை', 'D)மேற்கண்ட அனைத்தும்', 'D)பலாமரம்', 'D)இவை அனைத்தும்', 'D)மேற்கண்ட அனைத்தும்', 'D) 2%', 'D)கேசவ மேனன்', 'D)மேற்கண்ட அனைத்தும்', 'D)தொழில்நுட்ப வேலையின்மை', 'D) 6', 'D)அடையாளம் காணுதல்', 'D) அக்பர்', 'D)மத்திய மற்றும் மாநில அரசு ஊழியர்களை கொண்டு செயல்படும் துறைகள்', 'D) இவை அனைத்தும்', 'D)எல்.எம்.சிங்வி கமிட்டி', 'D)மேற்கண்ட அனைத்தும்', 'D) வாணிபச்சூழல் வேலையின்மை', 'D)அகஸ்டின்பைரமிஸ்டிகேண்டோல்', 'D) 4', 'D) 74 %', 'D) பொதுத்துறைகள்', 'D) 1958', 'D) உள்துறை அமைச்சகத்தின் தீர்மானம் மூலம்', 'D)மேற்கண்ட அனைத்தும்', 'D)நவீன வகைபாட்டு முறை', 'D) 4', 'D) ஒழுங்கமைக்கப்படாத துறை', 'D) 1963', 'D)  அக்டோபர் 2, 1963', 'D) மேற்கண்ட அனைத்தும்', 'D) ஏதுமில்லை', 'D)வால்வாக்ஸ்', 'D) மேற்கண்ட அனைத்தும்', 'D) உச்சநீதிமன்ற தலைமை நீதிபதி', 'D) மறைமுக வேலையின்மை', 'D) ஏதுமில்லை', 'D)ஸ்பைரோகைரா', 'D) பாரத தொலைபேசி நிறுவனம்', 'D) 1966', 'D)தவறானது ஏதும் இல்லை', 'D) மேற்கண்ட அனைத்தும்', 'D)J.B.சே', 'D) 2', 'D) ஏதுமில்லை', 'D) மேற்கண்ட அனைத்தும்', 'D) கேபினட் செயலக தலைமைச் செயலாளர்', 'D)துணைக் குடியரசுத் தலைவர்', 'D) மேற்கண்ட அனைவரும்', 'D) வின் வின் நிலை கொள்கை', 'D) ஏதுமில்லை', 'D) லேமினேரியா', 'D)இரண்டாம் துறை', 'D)கூற்றும் காரணமும் தவறு', 'D) 4 ஆண்டுகள் அல்லது 65 வயது வரை', 'D)இந்திய தலைமை நீதிபதி', 'D)“தேவை அதன் தேவையை தானே உருவாகும்”', 'D)மேற்கண்ட எதுவுமில்லை', 'D)ஜெளிடியம், கிரேசிலேரியா', 'D)பழுப்புப்பாசிகள்', 'D) ஈரோடு', 'D)மைக்கேல் கிராமம்', 'D) மேற்கண்ட அனைத்தும்', 'D) காரல் மார்க்ஸ்', 'D)ஜெளிடியம்', 'D) நீலம்', 'D)பணிகள் துறை', 'D) வண்டலூர் - கிண்டி புலிகள் காப்பகம்', 'D) உச்ச நீதிமன்ற நீதிபதிகள்', 'D) ஊழல் தடுப்புச் சட்டம் 1987', 'D)காரல் மார்க்ஸ்', 'D) கிரேசிலேரியா', 'D) லைக்கன்', 'D) பிங்காலி சவுகான்', 'D) மேற்கு வங்கம்', 'D) இவை அனைத்தும்', 'D) தவறானது ஏதுமில்லை', 'D)மேற்கண்ட அனைத்தும்', 'D) ஏதுமில்லை', 'D) ஏதுமில்லை', 'D) லடாக்', 'D)உத்திரப்பிரதேசம்', 'D) பிரதமர் அலுவலகம்', 'D) மார்ச் 20, 1982', 'D) விளைவு தேவை என்ற கருத்து', 'D) வைட்டமின் டி', 'D)இவை அனைத்தும்', 'D) ஒகோஞ்சோ இவெலா', 'D) ஜெர்மனி ', 'D) நவம்பர் 23, 2013', 'D)கூற்றும் காரணமும் தவறு ', 'D)சொலானம் ', 'D) ஏகில் மார்மிளோஸ்', 'D)அம்மா பகவான்', 'D)  பிப்ரவரி10', 'D) L.M.சிங்வி', 'D)இந்திரா காந்தி', 'D) மேற்கண்ட அனைத்தும் சாத்தியம்', 'D)ஏகில் மார்மிளோஸ்', 'D)வேதிசார்பசைவு , எதிர்சார்பசைவு ', 'D) நேர்புவிசார்பசைவு ', 'D) மணிப்பூர்', 'D) 1969', 'D) 1969', 'D) டிசம்பர் 17, 2013', 'D) மேற்கண்ட அனைவரும்', 'D)எதிர்ஒளிசார்பசைவு ', 'D)எதிர்ஒளிசார்பசைவு ', 'D)நடுக்கமுறுவளைதல்', 'D)கரையான்', 'D) டூலெட்', 'D) ஏதுமில்லை', 'D) 12', 'D)சாக்ஸ் ', 'D)கோலன்கைமா', 'D) 25 %', 'D)கோலன்கைமா', 'D) சைலம் சூழ் வாஸ்குலார்கற்', 'D)உத்தரகாண்ட் ', 'D) 60', 'D) குடியரசுத் தலைவர் ', 'D) பித் ', 'D)வெளிநோக்கிய சைலம்', 'D)பிடெரிக் ஏங்கெல்ஸ்', 'D)இந்திய குடிமைப் பணியாளர்', 'D)புறணி அல்லது அகத்தோல் ', 'D) ரைசோடெர்மிஸ்', 'D) பிப்ரவரி 10', 'D)உச்சநீதிமன்றம்', 'D) ஏதுமில்லை ', 'D)இவை அனைத்தும்', 'D) ரைசோடெர்மிஸ்', 'D) M', 'D) 2 வருடங்கள்', 'D) மூத்த அதிகாரிகள்', 'D)புறத்தோல்', 'D)மீசோபில்', 'D) 1 கோடி', 'D) மூன்றில் இரண்டு பங்கு ', 'D)கடத்தியாக ', 'D)ஒரு வருடம் வரை சிறை, 2 லட்சம் வரை அபராதம்', 'D) 7', 'D) இரண்டு', 'D) பிரெஞ்சு', 'D) உருளை', 'D)ஜப்பான் ', 'D) ஏதுமில்லை', 'D)ஸ்ட்ரோமா', 'D)இவை அனைத்தும்', 'D) 1967', 'D)நிறமி மூலக்கூறுகள்', 'D) துணை நிறமிகள்', 'D) இவை அனைத்தும்', 'D)பீகார் & 1972 ', 'D)இவை அனைத்தும் ', 'D) உறையிலும்,கிரானாவிலும் ', 'D)மத்தியப் பிரதேசம்', 'D)தமிழ்நாடு - 2017  ', 'D) ராபின் ஹில்', 'D)ஹைட்ரஜன் ', 'D) 24', 'D)ஏதும் இல்லை ', 'D) கிரப்ஸ் சுழற்சி', 'D)சபாநாயகர்', 'D) லிப்பிடு ', 'D) மாநில ', 'D)அதிகார ஊழல்', 'D) கிரானா', 'D) 2000', 'D) காற்று  சுவாசம்']

correct_answer = ['B) J.B.சே', 'A) J.M.கீன்ஸ்', 'A) நேர்புவிநாட்டம்', 'D)இவை அனைத்தும்', 'D) 1988',
                  'A) மத்திய ஊழல் மற்றும் கண்காணிப்பு ஆணையம்(CVC)', 'B)உழைப்பாளர் குழு', 'D)15 முதல் 60 வரை', 'C) 1 & 4', 'B)முழு வேலை வாய்ப்பு', 'A) முழு வேலை நிலை', 'A)பூக்கும் தாவரங்கள், பூவா தாவரங்கள்', 'A) இலையில்', 'D)3 மட்டும்', 'C)நாடாளுமன்றம்', 'A) J.M.கீன்ஸ்', 'C) லர்னர்', 'A)வெப்ப, மிதவெப்ப, கடல்சார்ந்த, குளிர் பாலைவனங்கள்', 'C)வெப்பமண்டலகாடுகள், குளிர்பிரதேசகாடுகள்,மலைக்காடுகள்', 'B)பண்டங்கள் துறை', 'B) 1, 2 & 3', 'D)உழைப்பாளர்களை', 'B) II & III', 'B) மூங்கில்', 'C) நில தாவரங்கள் மற்றும் பாலைவனத் தாவரங்கள் ', 'A) முதன்மைத் துறை', 'D) 2%', 'A) ஏ. நரஹரி', 'C)வளர்ந்த நாடுகள்', 'C) கல்லாதோர் வேலையின்மை', 'B) 5', 'C)வகைப்பாட்டியல்', 'A) பெரோஸ் ஷா துக்ளக்', 'C) வீட்டு உபயோகப் பொருட்கள், சிறு மற்றும் குடிசைத் தொழில்கள்', 'D) இவை அனைத்தும்', 'C)சந்தானம் கமிட்டி', 'C) I & III', 'B)பருவகால வேலையின்மை', 'D)அகஸ்டின்பைரமிஸ்டிகேண்டோல்', 'D) 4', 'C) 49 %', 'B)ஒழுங்கமைக்கப்படாத துறைகள்', 'A) 1941\n', 'D) உள்துறை அமைச்சகத்தின் தீர்மானம் மூலம்', 'C)உடன்பாடில்லா (பிறழ்ச்சி) வேலையின்மை', 'B)செயற்கை வகைப்பாட்டு முறை', 'B) 3', 'A) பொதுத்துறை', 'C) 1962', 'A) மார்ச் 31, 1964', 'D) மேற்கண்ட அனைத்தும்\n', 'B)ஸ்பீசஸ்பிளான்டாரம்', 'A)கிளாமிடோமோனஸ்', 'C) 2, 3 & 4', 'B)மக்களவை சபாநாயகர்', 'B) அமைப்புசார் வேலையின்மை', 'A) குளோரெல்லா', 'C) கேரா', 'A)டாட்டா இரும்பு மற்றும் எஃகு தொழிற்சாலை', 'B) 1964', 'A) CVC ஆனது அரசியலமைப்பு பெற்ற நிறுவனம் ஆகும்', 'B) தேவைக்கு அதிகமானவர்கள் ஒரு வேலையில் இருப்பர்', 'A) ஆடம் ஸ்மித்', 'C) 3', 'C) துண்டாதல்', 'B) 1, 4 & 5', 'D) கேபினட் செயலக தலைமைச் செயலாளர்', 'C) குடியரசுத் தலைவர்', 'D) மேற்கண்ட அனைவரும்', 'C) தலையிடாக்கொள்கை', 'A) ஸ்போர் உருவாதல்', 'A) அல்வா, ஸ்பைருலினா, குளோரெல்லா', 'A)விவசாயம்', 'A)கூற்றும் காரணமும் சரியானவை; மேலும் காரணம் கூற்றுக்கான சரியான விளக்கம்', 'D) 4 ஆண்டுகள் அல்லது 65 வயது வரை', 'B) குடியரசுத் தலைவர்', 'A) “அளிப்பு அதன் தேவையை தானே உருவாக்கும்”', 'C)மொத்த உற்பத்தியும் மொத்த வருவாயும் சமமாக இருக்கும்', 'C)லேமினேரியா,அஸ்கோபில்லம்', 'B) நீலப்பச்சைப்பாசிகள்', 'A) விழுப்புரம்', 'A) ஸ்லேட்டர் கிராமம்', 'D) மேற்கண்ட அனைத்தும்', 'A) கீன்ஸ்', 'C)அகர் அகர்', 'B) பழுப்பு', 'A) விவசாயம்', 'A) ஸ்ரீவில்லிபுத்தூர் மேகமலை புலிகள் காப்பகம்', 'A) மத்திய பணியாளர் தேர்வு வாரிய தலைவர்', 'A) ஊழல் தடுப்புச் சட்டம் 1988\n', 'A) கீன்ஸ்\n', 'C) குளோரெல்லா பைரினாய்டோசா', 'C) கைட்டின்', 'A) ஆதவ் அர்ஜுனா', 'A) மகாராஷ்டிரா', 'C) உரிமையியல் நீதிமன்றம்', 'C) CVC ன் அறிவுரைகள் நிராகரிக்கப்பட்டதற்கான காரணத்தை மத்திய அரசு தெளிவுபடுத்த வேண்டியது இல்லை', 'B) 2 & 3 மட்டும்', 'B) கிளைக்கோஜனாகவும் , எண்ணெயாகவும்', 'B)பிறசார்பு', 'D) லடாக்', 'D)உத்திரப்பிரதேசம்', 'B) குடியரசுத் தலைவர்', 'A) மார்ச் 14, 1982', 'D) விளைவு தேவை என்ற கருத்து', 'A) வைட்டமின் B2 ', 'B)அல்கஹால்', 'D) ஒகோஞ்சோ இவெலா', 'B)அமெரிக்கா', 'D) நவம்பர் 23, 2013', 'C)கூற்று தவறு ஆனால் காரணம் சரி', 'A) ஏகில்மார்மிளோஸ்', 'C)ஃபில்லாந்தஸ் அமாரஸ்', 'B) ஸ்ரீ ஸ்ரீ ரவிசங்கர்', 'B) பிப்ரவரி 09', 'D) L.M.சிங்வி', 'B) மொரார்ஜி தேசாய்', 'A) வேலைவாய்ப்பின் அளவில் ஏற்றம் வரும்', 'B)சொலானம் டிரைலோபேட்டம்', 'A) நேர்சார்பசைவு, எதிர்சார்பசைவு', 'C)ஒளியுறுவளைதல், நடுக்கமுறுவளைதல்', 'C) அசாம்', 'A) 1968', 'D) 1969', 'ஜனவரி 16, 2014', 'C) சஞ்சீவ் சன்யாஸ்', 'A)நடுக்கமுறுவளைதல்', 'C)ஒளியுறுவளைதல்', 'A)ஒளியின் உதவியால் உருவாக்கப்படுதல்', 'A) எறும்பு', 'C)கூலாங்கல்', 'B)பிரதமர் தவிர்த்த பிற பொது பணியாளர்களை பொறுப்பேற்க செய்தல்', 'C) 8', 'D)சாக்ஸ்', 'A) கியூடிக்கில்', 'A) 50 %', 'B)சைலம்', 'A) ஆரப்போக்கு அமைந்த வாஸ்குலார்கற்றை', 'C) மத்திய பிரதேசம்', 'A) 45', 'D) குடியரசுத் தலைவர்', 'C)கேம்பியம்', 'A)உள்நோக்கிய சைலம் ', 'B) J.M.கீன்ஸ்', 'C) உச்சநீதிமன்ற நீதிபதி', 'C) எபிபிளமா அல்லது ரைசோடெர்மிஸ்', 'A)புறணி', 'D) பிப்ரவரி 10', 'B)உரிமையியல்', 'A)லாபமீட்டும் உள்நாட்டு தனியார் நிறுவனங்கள் ', 'A) லோக் ஆயுக்தா', 'B) பித்', 'C) Y', 'C) 1 வருடம்', 'A) குடியரசுத் தலைவர்', 'C) புரோட்டோசைல இடைவெளி ', 'D)மீசோபில்', 'C) 10 லட்சம்', 'D) மூன்றில் இரண்டு பங்கு', 'B) வாயு பரிமாற்றத்திற்கு', 'B)ஒரு வருடம் வரை சிறை, ஒரு லட்சம் வரை அபராதம்', 'D) 7', 'B)மூன்று', 'A) ஸ்வீடன்', 'C)நீள் உருண்டை', 'B) நியூசிலாந்து', 'A) பாராளுமன்ற விசாரணை கமிஷனர்', 'C)கிராணம்', 'D)இவை அனைத்தும்', 'A) 1964', 'C)நிறமி மூலக்கூறுகள்', 'A) ஒளித்தொகுப்பு', 'B)லோக் ஆயுக்தா', 'C)ஒடிசா & 1970', 'C)பசுங்கணிகத்தின்', 'B) கிரானாவிலும்,ஸ்ட்ரோமாவிலும்', 'C) மகாராஷ்டிரம்', 'D)தமிழ்நாடு - 2017  ', 'D) ராபின் ஹில் ', 'C) கார்போஹைட்ரேட்', 'C) 20', '  C) அஸ்வினி உபத்தியா வழக்கு ', 'A) கால்வின் சுழற்சி', 'B) ஆளுநர்', 'C) மைட்டோகாண்ட்ரியா', 'C) சபாநாயகர்', 'B) புள்ளிவிவர ஊழல்', 'B)கிரிஸ்டே', 'C) 2002', 'A)கிளைக்காலிசிஸ்']


@app.route("/", methods=["GET", "POST"])
def home():
    warning = request.args.get("warn")

    if current_user.is_authenticated:
        completed = Test19.query.filter_by(examinee_id=current_user.user_id).first()

        if request.args.get("fee"):
            name = request.args.get("name")
            bending = request.args.get("bending")
            logged_in = request.args.get("logged_in")

            return render_template("index.html", fee=True, name=name, bending=bending, logged_in=logged_in,
                                   completed=completed)

        else:
            if completed:
                return render_template("index.html", warning=warning, completed=completed)

            else:
                return render_template("index.html", warning=warning)

    else:
        return render_template("index.html", warning=warning)


@app.route("/register", methods=['GET', 'POST'])
def register():
    form = RegisterForm()
    errors = []

    if form.validate_on_submit():
        hash_and_salted_password = generate_password_hash(
            request.form.get('password'),
            method='pbkdf2:sha256',
            salt_length=8
        )

        new_user = User(
            email=request.form.get('email'),
            username=request.form.get('name'),
            password=hash_and_salted_password,
        )

        if User.query.filter_by(email=request.form.get('email').lower()).first():
            return redirect(url_for('login', msg="You've already been registered. Please Login!"))

        elif User.query.filter_by(username=request.form.get('name')).first():
            errors.append('The username has already been taken')
            return render_template("register.html", errors=errors, form=form)

        else:
            errors.clear()

            if request.form.get('email') in verified_emails:

                db.session.add(new_user)
                db.session.commit()

                login_user(new_user)

                # redirect to the home page with fee details.
                return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                        bending=student_mails[request.form.get('email')][1]))

            else:
                return redirect(url_for('home', warn=True))

    return render_template("register.html", form=form)


@app.route("/login", methods=['GET', 'POST'])
def login():
    form = LoginForm()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        password = request.form.get('password')

        # Find user by email entered.
        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, password):
            login_user(user)
            errors.clear()

            # checking the user's payment details
            # redirect to the home page with fee details.
            return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                    bending=student_mails[request.form.get('email')][1]))

        else:
            errors.append('Incorrect Password! Try Again')
            return render_template("login.html", errors=errors, form=form)

    msg = request.args.get("msg")
    return render_template("login.html", form=form, errors=errors, msg=msg)


@app.route("/exam", methods=["GET", "POST"])
def exam():
    global attended
    test_no = request.args.get("test_no")
    opentime = exam_sites[request.args.get("test_no")][0]
    closetime = exam_sites[request.args.get("test_no")][1]

    if test_no == "15":
        attended = Test15.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "16":
        attended = Test16.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "17":
        attended = Test17.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "18":
        attended = Test18.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "19":
        attended = Test19.query.filter_by(examinee_id=current_user.user_id).first()

    if attended is None:
        return render_template("exam.html", opentime=json.dumps(opentime), closetime=json.dumps(closetime),
                               sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d, correct_answer=correct_answer,
                               answers=[], test_no=test_no)
    else:
        return redirect(url_for("home", warn="You have already committed this exam. Check the results instead."))


@app.route('/evaluate', methods=["GET", "POST"])
def evaluate():

    global new_examinee
    answers = []
    final_result = []
    marks = 0

    for i in range(0, 200):
        user_answer = request.form[f'answers{i}']

        if user_answer is None:
            answers.append("None")

        else:
            answers.append(user_answer)

    for j in range(len(correct_answer)):

        if answers[j].strip() == correct_answer[j].strip():
            marks += 1
            final_result.append("Correct")

        else:
            final_result.append("Wrong")

    # return f"{final_result, answers, correct_answer}"

    st_answers = '#||#'.join(answers)
    f_result = "#||#".join(final_result)

    # return f"{correct_answer, answers}"
    # return f"{[s_answers for s_answers in correct_answer]}"
    # return f"{[s_answers for s_answers in answers]}"
    # return f"{final_result}"

    actual_time = datetime.datetime.now()
    s_time = actual_time.strftime('%Y-%m-%d %H:%M:%S.%f')

    new_examinee = Test19(
        test_author=current_user,
        user_answers=st_answers,
        marks=marks,
        final_result=f_result,
        date=s_time[:-7],
        examinee_name=current_user.username
    )

    db.session.add(new_examinee)
    db.session.commit()

    return redirect(url_for('home', warn="You have successfully completed the exam. Click results to see results."))


@app.route("/result", methods=["GET", "POST"])
def result():
    global answers, final_result, time, marks
    test_no = request.args.get("test_no")

    if test_no == "15":
        attended_student = Test15.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "16":
        attended_student = Test16.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "17":
        attended_student = Test17.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "18":
        attended_student = Test18.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "19":
        attended_student = Test19.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    return render_template("results.html", answers=answers, marks=marks, sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d,
                           correct_answer=correct_answer, final_result=final_result, time=time)


@app.route("/dashboard")
def dashboard():
    all_record = Test19.query.all()

    return render_template("dashboard.html", all_record=all_record)


@app.route("/change_details", methods=["GET", "POST"])
def change_password():
    form = ChangeDetails()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        old_password = request.form.get('old_password')
        new_password = request.form.get('new_password')

        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, old_password):

            if User.query.filter_by(email=email).first():
                old = User.query.filter_by(email=email).first()
                pass_to_update = User.query.get(old.user_id)

                hash_and_salted_password = generate_password_hash(
                    new_password,
                    method='pbkdf2:sha256',
                    salt_length=8
                )

                pass_to_update.password = hash_and_salted_password

                db.session.commit()

                logout_user()
                return redirect(url_for('login', msg="Your password has been changed successfully. "
                                                     "Please Login with your new password."))

        else:
            errors.append("Please check your password.")
            return render_template("change_details.html", form=form, errors=errors)

    return render_template("change_details.html", form=form, errors=errors)


@app.route('/logout')
@login_required
def logout():
    logout_user()
    return redirect(url_for('home'))


@app.route("/admission", methods=["GET", "POST"])
def new_admission():
    form = AdmissionForm()

    if form.validate_on_submit():
        new_member = Admission(
            name=form.name.data,
            mobile_number=form.number.data,
            email=form.email.data,
        )

        db.session.add(new_member)
        db.session.commit()

        verification_code = random.randint(2000, 10000)

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=request.form.get('email'),
                                msg=f"Subject:WELCOME TO SENA CAREER INSTITUTE\n\nWelcome {request.form.get('name')}!"
                                    f" Happy to see you with us. Thanks for supporting us! Keep rocking! "
                                    f"Here is our Educators' number: 8610642720".encode('utf-8'))

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=MY_EMAIL,
                                msg=f"Subject:NEW ADMISSION\n\n{request.form.get('name')} has made an "
                                    f"admission sign up on Sena site Here is details {request.form.get('name')},"
                                    f" {request.form.get('number')}, {request.form.get('email')}!")

        return redirect(url_for('home'))

    return render_template("register.html", form=form, admission=True)


if __name__ == '__main__':
    app.run(debug=True)
