import datetime
import random
import smtplib
import pandas
from flask import Flask, render_template, redirect, url_for, flash, request, abort
from flask_bootstrap import Bootstrap
from flask_ckeditor import CKEditor
from werkzeug.security import generate_password_hash, check_password_hash
from flask_sqlalchemy import SQLAlchemy
from flask_login import UserMixin, login_user, LoginManager, login_required, current_user, logout_user
from flask_wtf import FlaskForm
from sqlalchemy.orm import relationship
from wtforms import StringField, SubmitField, PasswordField
from wtforms.fields.html5 import EmailField
from wtforms.validators import DataRequired
from functools import wraps
import os
import json

app = Flask(__name__)
app.config['SECRET_KEY'] = os.environ.get("SECRET_KEY")
ckeditor = CKEditor(app)
Bootstrap(app)

app.config['SQLALCHEMY_DATABASE_URI'] = os.environ.get("DATABASE_URL", "sqlite:///sena-base.db")
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
db = SQLAlchemy(app)

admin = False
login_manager = LoginManager()
login_manager.init_app(app)

MY_EMAIL = os.environ.get("MY_EMAIL")
SENA_EMAIL = 'sivagangainagarajan@gmail.com'
MY_PASSWORD = os.environ.get("MY_PASSWORD")


@login_manager.user_loader
def load_user(user_id):
    return User.query.get(int(user_id))


def admin_only(f):
    @wraps(f)
    def decorated_function(*args, **kwargs):
        # If id is not 1 then return abort with 403 error
        if current_user.user_id != 1:
            return abort(403)
        # Otherwise continue with the route function
        return f(*args, **kwargs)

    return decorated_function


class User(UserMixin, db.Model):
    __tablename__ = "User"
    user_id = db.Column(db.Integer, primary_key=True)
    email = db.Column(db.String(100), unique=True)
    password = db.Column(db.String(100))
    username = db.Column(db.String(100))
    # test = relationship("Test15", back_populates="test_author")
#     test16 = relationship("Test16", back_populates="test_author")
#     test17 = relationship("Test17", back_populates="test_author")
    test18 = relationship("Test18", back_populates="test_author")
    test19 = relationship("Test19", back_populates="test_author")
    test20 = relationship("Test20", back_populates="test_author")
    test21 = relationship("Test21", back_populates="test_author")

    def get_id(self):
        return self.user_id


# class Test15(db.Model):
#     __tablename__ = "Test_15"
#     user_id = db.Column(db.Integer, primary_key=True)
#     examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
#     test_author = relationship("User", back_populates="test")
#     marks = db.Column(db.Integer)
#     user_answers = db.Column(db.String())
#     final_result = db.Column(db.String())
#     date = db.Column(db.String(250), nullable=False)


# class Test16(db.Model):
#     __tablename__ = "Test_16"
#     user_id = db.Column(db.Integer, primary_key=True)
#     examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
#     test_author = relationship("User", back_populates="test16")
#     marks = db.Column(db.Integer)
#     examinee_name = db.Column(db.String())
#     user_answers = db.Column(db.String())
#     final_result = db.Column(db.String())
#     date = db.Column(db.String(250), nullable=False)


# class Test17(db.Model):
#     __tablename__ = "Test_17"
#     user_id = db.Column(db.Integer, primary_key=True)
#     examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
#     test_author = relationship("User", back_populates="test17")
#     marks = db.Column(db.Integer)
#     examinee_name = db.Column(db.String())
#     user_answers = db.Column(db.String())
#     final_result = db.Column(db.String())
#     date = db.Column(db.String(250), nullable=False)


class Test18(db.Model):
    __tablename__ = "Test_18"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test18")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test19(db.Model):
    __tablename__ = "Test_19"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test19")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test20(db.Model):
    __tablename__ = "Test_20"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test20")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)
    
    

class Test21(db.Model):
    __tablename__ = "Test_21"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test21")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Admission(db.Model):
    __tablename__ = "New_Admission"
    user_id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(100))
    mobile_number = db.Column(db.Integer)
    email = db.Column(db.String(100), unique=True)


db.create_all()
db.session.commit()


class RegisterForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Register')


class LoginForm(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Login')


class AdmissionForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    number = StringField("Phone*", validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    submit = SubmitField('Submit')


class ChangeDetails(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    old_password = PasswordField('Old Password*', validators=[DataRequired()])
    new_password = PasswordField('New Password*', validators=[DataRequired()])
    submit = SubmitField('Submit')


student_mails = {
    "mgopalakrishnan075@gmail.com": ["Gopal", 2000],
    "nivir6558@gmail.com": ["Nivetha", 7000],
    "jaya26jj@gmail.com": ["Christy", 5000],
    "srjamuna1003@gmail.com": ["jamuna", 7000],
    "satheshpandian1997@gmail.com": ["Satheshpandian", 4000],
    "lakshmiraja412@gmail.com": ["Rajalaskhmi", 5000],
    "tamilarasanbe9597@gmail.com": ["Anitha", 1000],
    "rajeshkannan6341@gmail.com": ["Rajesh kannan", 3000],
    "jaishreeramgp@gmail.com": ["Yogapriya", 3000],
    "irudhayasubiksha2001@gmail.com": ["Subiksha", 0],
    "abinayaabi257@gmail.com": ["Abi", 1000],
    "shanthirasu1991@gmail.com": ["Shanthi", 0],
    "pradee1296@gmail.com": ["Pradeepa", 5000],
    "jeniferj0204@gmail.com": ["Janifer", 7000],
    "krish47457@gmail.com": ["Krishna", 0],
    "naveenaryan440@gmail.com": ["Naveen", 0],
    "veerasurya250899@gmail.com": ["Suriya", 3000],
    "amin2svg@gmail.com": ["Amin", 3000],
    "jjprincy06@gmail.com": ["Jeba Josepin Princy", 0],
    "jancybetsia20@gmail.com": ["Jancy", 0],
    "cottonpanju9@gmail.com": ["Panju", 2000],
    "rameswariv1999@gmail.com": ["Rameshwari", 2000],
    "vimaladharmar2002@gmail.com": ["Vimala", 1000],
    "devahi1993@gmail.com": ["Devahi", 0],
    "sarojiniganesan96@gmail.com": ["Sarojini", 0],
    "gangadha91@gmail.com": ["Gangadharan", 0],
    "krishnannk498@gmail.com": ["Kamatchi", 0],
    "indhuindhumathi141@gmail.com": ["Indhumathi", 4000],
    "jamespurysh@gmail.com": ["Purushothaman", 0],
    "sivagangainagarajan@gmail.com": ["Nagarajan", 0],
    "matheshsethu22@gmail.com": ["Mathesh", 4000],
    "nagarajnkarthika@gmail.com": ["Karthika", 2000],
    "keviraj482@gmail.com": ["Yogesh", 2000],
    "christyjeslina98@gmail.com": ["Christy", 3500],
    "valarmathi9415@gmail.com": ["Valarmathi", 2000],
}

verified_emails = [mail.strip() for mail in student_mails.keys()]

exam_sites = {

    "15": ["June 14, 2021 10:00:00", "June 14, 2021 13:30:00"],
    "16": ["June 21, 2021 10:00:00", "June 21, 2021 13:30:00"],
    "17": ["June 28, 2021 10:00:00", "June 28, 2021 22:30:00"],
    "18": ["July 05, 2021 10:00:00", "July 05, 2021 13:30:00"],
    "19": ["July 12, 2021 10:00:00", "July 12, 2021 13:30:00"],
    "20": ["July 19, 2021 10:00:00", "July 19, 2021 14:00:00"],
    "21": ["July 26, 2021 10:00:00", "July 26, 2021 14:00:00"],

}

sl_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
         31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58,
         59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
         87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
         112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133,
         134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
         156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177,
         178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199]

ques = ['மௌரியர்களின் ஆட்சி தொடங்கிய வருடம் என்ன', 'இந்தியாவின் செவ்வியல் காலமாகவும் அறிவியல் தொலைநோக்கு வளர்ச்சிக்கு வித்திட்ட காலமாகவும் கருதப்படும் ஆட்சி', 'சாளுக்கியர் தமிழகத்தில் அறிமுகப்படுத்திய சமயபிரிவு என்ன?', 'அளவை முறையின் முன்னோடியாக கருதப்படுபவர்கள்?', 'குப்தர் காலத்தில் விசாகதத்தரால் சந்திரகுப்த மௌரியரைப் பற்றி தகவல் கொண்டதாக இயற்றப்பட்ட நூல் எது?', 'செலுக்கஸ்  நிக்கேட்டரின்\u200c தூதுவராக மௌரிய அரசை வந்தடைந்த அறிஞர்', 'மௌரிய ஆட்சி முறையின் அனைத்து கூறுகளையும் விளக்கும் வேதமாக கருதப்படும் நூல்', 'முகலாயர் வருகைக்கு பின் இந்தியாவில் நடைமுறையில் உள்ள நிர்வாக முறையை குறிப்பிடுக', 'பௌத்த சமயத்தின் சிற்பக்கலை, கட்டிடக்கலைக்கு புது வடிவம் கொண்ட பங்களிப்பை வழங்கிய அரசு', 'மௌரிய அரசு எத்தனை\u200c பிரிவுகள் கொண்ட நிர்வாக அலகாக செயல்படுகிறது என கௌடில்யர் குறிப்பிடுகிறார்', 'மௌரிய அரசரின் ஆலோசனை மற்றும் நிர்வாக உதவிக்கு அமர்த்தப்படும் குழுவில் உள்ள நபர்களின் எண்ணிக்கை', 'மௌரிய அரசின் நான்கு மாகாணங்களில் சேராதது', 'அசோகரின் பெயரில் அவரின் பெயரன் தசரதனால் கொடையாக அளிக்கப்பட்ட குகைகள்', 'எந்த கல்தூணில் புத்தரின்\u200c சின்னங்களாக கருதப்பட்ட உருவங்கள் பொறிக்கப்பட்டுள்ளன', 'புத்தரின் அன்னை மாயாதேவியின் கனவில் வந்த உருவத்தை குறிக்கும் சின்னம்', 'புத்தரின் இளமைக்கால ஆசைகளை குறிப்பது', 'புத்தரின் துறவறத்தை குறிப்பது', 'புத்தரின் சாதனைகளை குறிப்பது', 'சாரநாத் கற்தூணில் புத்தரின் போதனைகளை, முதல் பொழிப்புரையை அடையாளப்படுத்தும் சின்னமாக பொறிக்கப்பட்டுள்ளது எது?', '“தர்மமானது நெடுநாள் வாழும் பொருட்டு எங்கெல்லாம் கற்தூண்களும், கற்பாறைகளும் காணப்படுகின்றனவோ அங்கெல்லாம் தர்மத்தின் ஆணைகள் பொறிக்கப்படுகின்றன” இது எந்த கல்வெட்டில் குறிப்பிடப்பட்டுள்ளது ?', 'சாஞ்சி ஸ்தூபி யாருடைய காலத்தில் கட்டப்பட்டது', 'சாஞ்சி ஸ்தூபியை எடுத்துக்காட்டாக கொண்டு மற்றோரு இடத்தில் கட்டப்பட்ட ஸ்தூபி எது?', 'பௌத்த பிக்குகள் மற்றும் குருமார்களின் விடுதிகளாக கருதப்படுபவை', 'பௌத்த தியானக்கூடம்', 'பௌத்த குவிமாட கட்டிடங்கள்', 'கனிஷ்கர் காலத்தில் பௌத்த சிற்பக்கலை எவ்வாறாக வடிக்கப்பட்டது?', 'மௌரிய காலத்து இலக்கியங்கள் பெரும்பாலும் எந்த மொழியில் படைக்கப்பட்டன?', 'மௌரியர் காலத்தில் கிழக்கு பகுதியின் அரசு மொழி என்ன?', 'பின்வரும் நூல்களில் எது இலக்கண நூல்?', 'சந்திரகுப்த மௌரியரின் இறப்பிற்குப் பின்னர் அவருக்கு கோவில் கட்டப்பட்ட இடம்', 'கனிஷ்கரால் பௌத்த மதம் அதிகமாக பரப்பப்பட்ட நாடு', 'அசோகரால் பௌத்த மதம் பரப்பப்பட்ட நாடு', 'மகேந்திரன் மூலமாக இலங்கையில் பௌத்தம் பரவியதை குறிப்பிடும் நூல்', 'அசோகரால் நிகழ்த்தப்பட்ட பௌத்த மாநாடு யாரால் தலைமை ஏற்கப்பட்டது?', 'சமய\u200cபரப்புதலுக்கு அசோகரால் சங்கமித்ரை எங்கு அனுப்பப்பட்டார்?', 'கலிங்க போர் பற்றிய குறிப்புகள் கொண்ட கல்வெட்டு', 'சமணர்களின் எந்த வழிமுறையை\u200c பின்பற்றி சந்திரகுப்தர் உயிர் துறந்தார்', 'சந்திரகுப்தர் உண்ணா நோன்பிருந்த இடம்', 'சந்திரகுப்தரை சமண சமயத்திற்கு மாற்றியவர் யார்?', 'மௌரிய காலத்து தங்க நாணயம்', 'வெள்ளி நாணயம் - மௌரியர்', 'செம்பு நாணயம் – மௌரியர்', 'வணிகத்தில் சிறந்து விளங்கியதும் மிக முக்கியமான துறைமுகமாகவும் கருதப்பட்ட இடம்', 'மௌரிய வணிக மையங்களாக விளங்கியது', 'ஸ்ரேனி என்பது யாது?', 'ஆயுதங்கள் தயாரிப்பிற்கும் அணிகலன் தயாரிப்பிற்கும் தேவைபடுகிற மூல உலோகங்கள் எங்கிருந்து பெறப்பட்டது', 'பெண்கள் விதவிதமான காதணிகள் அணிவது, உற்பத்தி செய்தது குறித்து கூறுபவர் யார்?', 'நியார்கஸ் எந்த தொழிலின் உற்பத்தி குறித்து புகழ்ந்து கூறுகிறார்', 'பண்டைக்கால பல்கலைக்கழகங்கள் மௌரியர் காலத்தில் எந்த சமயம் சார்ந்து பயன்பட்டு வந்தது', 'மௌரியர்\u200c காலத்து புகழ் பெற்ற பல்கலைக்கழகம்', 'மௌரியப் காலத்தில் ஒற்றர்கள் எவ்வாறு அழைக்கப்பட்டனர்?', 'வரி – பழங்கள்', 'வரி – நில வரி', 'அலெக்சாண்டர் எந்த வருடம் இந்திய நிலப்பரப்பின்\u200c மீது படையெடுத்தார்?', 'குற்றவியல் நீதிமன்றம் – மௌரியர்\u200c நடைமுறை', 'மௌரியர் காலத்தில் 6 லட்சம் காலாட் படை வீரர்களும், 30 ஆயிரம் குதிரைப்படை வீரர்களும், 9000 யானைப் படையினரும் இருந்ததாக குறிப்பிடுபவர் யார்?', '15 கிராமங்களின்\u200c ஒருங்கிணைப்பு தலைமை – மௌரியர்', 'மெகஸ்தனிஸ் மற்றும் கௌடில்யர் எந்த நிர்வாக அதிகாரிகள் தமது நூல்களில் குறிப்பிட்டுள்ளனர்?', 'மௌரியர் காலத்து நிர்வாக அலகு எத்தனை பெரிய மாகாணங்களாக பிரிக்கப்பட்டுள்ளன', 'மௌரியர் காலத்தில் மாகாண தலைமைக்கு வழங்கப்பட்ட பெயர்', 'கருவூலம்', 'வரிவசூல்', 'அத்வர்வம்சிகா என்று அழைக்கப்பட்ட பொறுப்பு எதற்கானது?', 'தலைநகர ஆளுநருக்கு வழங்கப்பட்ட பொறுப்பு', 'மாவட்ட தலைமை – மௌரியர்\u200c காலத்து பொறுப்பு', 'நகர நிர்வாகம் எத்தனை குழுக்களாகவும், உறுப்பினர்களாகவும் வகைப்படுத்தப் பட்டனர்', 'நாணய சரிபார்ப்பு பதவி\u200c', 'எந்தப் பதவியில் கீழ் ஆயுதங்கள் , படையெடுத்து நடைமுறைகள் மற்றும் போர்விதிகள் சரி பார்க்கப்படுகின்றன', 'இந்தியாவில் முதல் மக்கள் தொகை கணக்கெடுப்பு ______ஆம் ஆண்டு மேற்கொள்ளப்பட்டது?\n', 'முழுமையான முதல் மக்கள் தொகை கணக்கெடுப்பு ______ஆம் ஆண்டு மேற்கொள்ளப்பட்டது?\n', '15வது மக்கள் தொகை கணக்கெடுப்பு ______ஆம் ஆண்டு நடைபெற்றது\n', 'இந்தியாவில் மிக அதிக மக்கள் தொகையை உடைய மாநிலம்?\n', 'இந்தியாவில் மிகக் குறைந்த மக்கள் தொகை கொண்ட மாநிலம்\n\n', '2011 ஆம் ஆண்டின் மக்கள் தொகை கணக்கெடுப்பின்படி இந்தியாவின் சராசரி மக்கள் அடர்த்தி ஒரு சதுர கிலோ மீட்டருக்கு----?\n', 'மக்கள் தொகையின் பல்வேறு அம்சங்கள் பற்றிய அறிவியல் பூர்வமான படிப்பு ?', 'இந்தியாவில் தங்க நாற்கரச் சாலையின் நீளம்\n', 'இந்தியாவின் தேசிய நெடுஞ்சாலை ஆணையம்  _______ இல் நிறுவப்பட்டது\n', 'தேசிய தொலையுணர்வு மையம் அமைந்துள்ள இடம்?\n', 'இந்தியாவின் முதல் அஞ்சல் விலை 1852 ஆம் ஆண்டு ___ல் வெளியிடப்பட்டது?\n', 'இந்திய ரயில்வே துறை ____ ரயில்வே மண்டலங்களாக பிரிக்கப்பட்டுள்ளது\n', '______அதிவிரைவு வண்டி இந்தியாவின் மிக அதிகவேக இரயில் வண்டி ஆகும்\n', 'பெரும் மக்களியல் பிளவு ஆண்டு\n', 'மக்கள் தொகை வளர்ச்சியை தீர்மானிக்கும் காரணிகள்?\n', '2011ம் ஆண்டு மக்கள் தொகை கணக்கெடுப்பின்படி இந்தியாவில் 121 கோடி மக்களின் ------கோடி மக்கள் இடம் பெயர்ந்தவர்கள் ஆவார்கள்?\n', 'இந்தியாவில் உள்ள மொத்த மக்கள் தொகையை உழைக்கும் மக்கள் தொகையில் சதவீதம்\n', 'பொருத்துக பாலின விகிதம் 2011\nA) இந்தியா----1)618\nB) கேரளா----2)1038\nC) புதுச்சேரி----3)940\nD) டையூ டாமன்----4)1084\n', 'பொருத்துக எழுத்தறிவு விகிதம் 2011 எது தவறானவை\n', 'இந்தியாவில் அதிக எழுத்தறிவு பெற்ற மாநிலம்?\n\n', 'இந்தியாவில் குறைந்த எழுத்தறிவு பெற்ற மாநிலம்\n', 'எந்த மாநிலம் மிகுந்த நகரம் மயமாக்கப்பட்ட பகுதியாக உள்ளது------? (62.17%)\n', 'குறைந்த நகர மயமாக்கப்பட்ட பகுதியாக உள்ளது?\n', 'பொருத்துக  மயமாக்கப்பட்ட பகுதிகளில் சதவீதம்\nA) டெல்லி----47.7%\nB) தமிழ்நாடு----97.50%\nC) கேரளா-----45.2%\nD) மகாராஷ்டிரா----48.4%', '2011 ஆம் ஆண்டு கணக்கெடுப்பின்படி இந்தியாவில் நகர்ப்புற மக்கள்தொகை ?-----மில்லியன்\n\n', ' மனிதவள மேம்பாடு என்பது கல்வி,உடல்நலம்,வருமானம், அதிகாரம் போன்றவைகளில் மக்களுக்கான வாய்ப்புகளை அதிகப்படுத்தும் ஒரு செயல்முறையாகும்?\n', 'மனித வளர்ச்சியின் குறியீடுகள் UNDP ----?\n', 'மனிதவள மேம்பாடு என்பது மூன்று அடிப்படை பரிணாமங்களைக் கொண்டது அவை?\n\n', 'பொருத்துக மனித வள மேம்பாட்டு குறியீடு HDI\n\nA) குறைந்து மனிதவள மேம்பாடு---0.550 - 0.699\nB) மிதமான மனிதவள மேம்பாடு----0.800 அதற்குமேல்\nC) அதிக மனிதவள மேம்பாடு----0.550\nD) மிக அதிக மனிதவள மேம்பாடு----0.700-0.799', '2016ஆம் ஆண்டின் படி இந்தியா சுமார்------ நீலசாலையை கொண்டு உலகின் இரண்டாவது நீண்ட சாலை வலைப்பின்னல் அமைப்பை பெற்றுள்ளது?\n\n', '2016 இன் படி தேசிய நெடுஞ்சாலைகளில் நீளம்  சுமார் ------கிலோ மீட்டர் ஆகும்???\n', 'இந்தியாவின் மிக நீளமான தேசிய நெடுஞ்சாலை?\n', 'மிகக் குறைந்த தேசிய நெடுஞ்சாலை??', '2016 இன் படி மாநில நெடுஞ்சாலைகளின் நீளம்??\n', ' 2016ல் படி இந்தியாவில் மாவட்ட சாலைகளின் நீளம்??\n', '2011ன் படி இந்தியாவில் கிராமப்புற சாலைகள் இன் மொத்த நீளம்???\n', 'இந்தியாவில் தேசிய நெடுஞ்சாலை ஆணையம் நிறுவப்பட்ட ஆண்டு----NHAI\n', 'எல்லைப்புற சாலைகள் நிறுவனம் அமைக்கப்பட்ட ஆண்டு??\n', ' உலகிலேயே உயரமான எல்லைப்புற சாலை லடாக்கில் உள்ள லேவில் இருந்து -------வரை அமைக்கப்பட்டுள்ளது?\n', 'தங்க நாற்கர சாலைகளை இணைக்கும் பகுதிகள்?\n', 'தங்க நாற்கர சாலை திட்டம் தொடங்கப்பட்ட ஆண்டு?\n\n', 'பொருத்துக\n\nA) ஸ்ரீநகர் ------கன்னியாகுமரி----- 3640 கிலோமீட்டர்\nB) அஸ்ஸாம் ----குஜராத் போர்பந்தர்----- 7349\nC) மொத்த ரயில் பாதை நீளம்------4076 கிலோமீட்டர்\nD) மொத்த ரயில் நிலையங்கள் ----- 67,368 கிலோமீட்டர்', 'சாலைகளின் அடர்த்தி மிக அதிகமாக உள்ள மாநிலம்?\n', 'சாலைகளின் அடர்த்தி மிக குறைவாகஉள்ள மாநிலம்?\n', 'இந்திய ரயில் போக்குவரத்து அமைப்பு ஆசியாவின் மிகப் பெரியதும் உலக அளவில் -------  பெரியதும் ஆகும்????\n', 'இந்திய ரயில்வே துறை எத்தனை ரயில்வே மண்டலங்களாக பிரிக்கப்பட்டுள்ளது?\n', 'இந்தியாவின் முதல் ரயில்வே போக்குவரத்து மும்பை மற்றும் தானே நகரங்களுக்கு இடையே 34 கிலோ மீட்டர் தூரத்திற்கு தொடங்கப்பட்ட ஆண்டு??\n\n\n', ' இந்தியாவின் ரயில்வே தேசியமயமாக்கப்பட்ட ஆண்டு?\n', 'இந்தியாவின் முதல் புறநகர் ரயில்வே போக்குவரத்து 1925-ல் எங்கு தொடங்கப்பட்டது??\n', 'பொருத்துக ரயில்வே இருப்புப் பாதை\nA) அகலப்பாதை  1 மீட்டர்\nB) மீட்டர் பாதை 0.610 மீட்டர்\nC) குறுகிய பாதை 1.676 மீட்டர்\nD) குறுகிய தூக்கு பாதை 0.762 மீட்டர்', 'சென்னை நகரம் மெட்ரோ ரயில் சேவை கொண்ட ------ஆவது நகரமாகும்??\n', 'கீழ்க்கண்டவற்றுள் சரியானதை தேர்ந்தெடு?\n\n', 'கொங்கன் ரயில்வே அமைக்கப்பட்ட ஆண்டு\n', ' கொங்கன் ரயில்வே -------இடைப்பட்ட 160 கிலோ மீட்டர் நீளத்தை இணைக்கிறது\n\n', 'பொறியியல் துறையின் அதிசயமாக கருதப்படும் ரயில்வே????\n', 'இந்தியாவில் இந்தியாவில் எந்த பெருநகரங்களில் மெட்ரோ ரயில் சேவை வழங்கப்படுகிறது?\n\n', 'இந்தியாவில் முதல் மெட்ரோ ரயில் சேவை தொடங்கப்பட்ட நகரம்?\n\n', '2018 ன் படி இந்தியாவில் மெட்ரோ ரயில் இருப்புப் பாதை எத்தனை கிலோமீட்டர் நீளம்??\n\n', 'ரயில் போக்குவரத்து இல்லாத மாநிலம்??\n', 'பழமையான மற்றும் மலிவான போக்குவரத்து முறை?\n', 'உள்நாட்டு நீர்வழிப் போக்குவரத்து ஆணையம் தொடங்கப்பட்ட ஆண்டு??\n\n', 'பொருத்துக\nA) பெரிய துறைமுகங்கள்-----1,55,000\nB) நடுத்தர மற்றும் சிறிய துறைமுகங்கள்----1,39,000\nC) இந்திய அஞ்சல் நிலையங்கள்----200\nD) கிராம புறங்களில் உள்ள தபால் நிலையங்கள்--13', 'கிழக்கு கடற்கரையில் அமைந்துள்ள முக்கிய துறைமுகங்கள்?\n', 'மேற்கு கடற்கரையில் அமைந்துள்ள முக்கிய துறைமுகங்கள்??\n\n', 'பொருத்துக\nA) இந்துஸ்தான் கப்பல் கட்டும் தளம்--- கொல்கத்தா\nB) கார்டன் ரீச் கப்பல் கட்டும் தொழிற்சாலை- விசாகப்பட்டினம்\nC) மாஷாகான் கப்பல் கட்டும் தொழிற்சாலை-- கொச்சி\nD) கொச்சி கப்பல் கட்டும் தளம்- மும்பை', 'இந்தியா கப்பல் கட்டும் தொழிலில் உலக அளவில் எந்த இடம்?\n', 'முதல் இந்திய விமான போக்குவரத்து பிப்ரவரி ----இல் ஹென்றி யூர் பிக்யூர் என்பவரால் அலகாபாத்தில் இருந்து சுஜியை வரவே மாட்டேங்குது ஏதாவது பாருடா எவ்வளவு கஷ்டப்படுறாங்க பிரிவினை அவர் எவ்வளவு உட்கார்ந்து இருப்பார்கள்  நைனிக்  என்ற இடத்திற்கு கடிதங்கள் கொண்டு செல்லப்பட்ட அதன்மூலம் ஆரம்பமானது?\n', '----- ஆம் ஆண்டு நாட்டில் செயல்பட்டு வந்த 8 பல்வேறு நிறுவனங்கள் ஒன்றிணைக்கப்பட்டு தேசிய மயமாக்கப்பட்டன?\n\n', 'இந்தியாவில் தற்போது எத்தனை சர்வதேச விமான நிலையங்கள் உள்ளன??\n\n', 'இந்திய விமான நிலைய பொறுப்பு ஆணையம் ஆரம்பிக்கப்பட்ட ஆண்டு??\n', ' ஏர் இந்தியா மற்றும் இந்தியன் ஏர்லைன்ஸ் நிறுவனங்கள் இந்திய தேசிய விமான போக்குவரத்து கழகத்தின் கீழ் ஒன்றிணைக்கப்பட்ட ஆண்டு??\n', 'இந்திய அஞ்சல் சேவை பொதுமக்களின் பயன்பாட்டிற்காக தொடங்கப்பட்ட ஆண்டு???\n\n', 'இந்தியாவின் முதல் அஞ்சல் வில்லை 1852 ஆம் ஆண்டில் ------வெளியிடப்பட்டது????\n', 'விரைவு அஞ்சல் சேவை தொடங்கப்பட்ட ஆண்டு?\n', 'இந்திய வானொலி ஒலிபரப்பு சேவை மும்பை வானொலி சங்கம் மூலமாக எந்த ஆண்டு தொடங்கப்பட்டது?\n', 'அகில இந்திய வானொலி என்று பெயர் மாற்றம் செய்யப்பட்ட ஆண்டு??\n', 'ஆகாசவாணி என்று பெயர் மாற்றம் செய்யப்பட்ட ஆண்டு??\n\n', 'சீனாவிற்கு அடுத்தபடியாக 460 மில்லியன் இணைய பயன்பாட்டாளர்கள் கொண்டு இந்தியா எந்த இடத்தில் உள்ளது??\n', 'இந்திய  தேசிய செயற்கைக்கோள் அமைப்பு நிறுவப்பட்ட ஆண்டு???\n\n', 'ஆகஸ்ட் 30 ஆயிரத்து தொள்ளாயிரத்து எண்பத்தி மூன்றாம் ஆண்டு தகவல் தொடர்புக்காக ஏவப்பட்ட முதல் இன்சாட் வரிசை செயற்கைக்கோள்?\n', 'பொருத்துக விரைவு சாலைகள்\nA) மும்பை------- யமுனா விரைவுச்சாலை\nB) கொல்கத்தா-------பூனா விரைவுச்சாலை\nC) துர்காபூர்------- டம் டம் விமான நிலையம் விரைவுசாலை\nD) புதுடெல்லி மற்றும் ஆக்ரா ----- கொல்கத்தா விரைவுசாலை', 'இந்தியாவில் வேலையில் பங்கேற்போர் விகிதம் 2011 ஆம் ஆண்டு?\n', "ஆண்டுதோறும், 'பாகுபாடுகள் ஒழிப்பு நாள் - Zero Discrimination Day' அனுசரிக்கப்படும் தேதி எது?", '30ஆவது அட்ரியாடிக் பியர்ல் போட்டி நடைபெற்ற நாடு எது?', 'நடப்பாண்டு (2021) ஆசிய பொருளாதார பேச்சுவார்த்தைக்கு இணைந்து தலைமை தாங்கிய இந்திய அமைப்பு எது?', 'VL-SRSAM என்பது எந்த வகை ஏவுகணையாகும்?', "அண்மையில் NITI ஆயோக் நிறுவனத்தின் தலைமைச் செயல் அதிகாரியால் அறிமுகப்படுத்தப்பட்ட, 'DigiBoxx' என்றால் என்ன?", "இ-தர்தி ஜியோ' என்ற வலைத்தளத்தை அறிமுகப்படுத்தியுள்ள மத்திய அமைச்சகம் எது?", 'உள்மாநில மின்சார-பரிமாற்ற திட்டத்தை மேம்படுத்துவதற்காக அஸ்ஸாம் மாநிலத்திற்கு $304 மில்லியன் கடனை வழங்கவுள்ள நிறுவனம் எது?', 'NASA & ஜெர்மன் விண்வெளி ஆய்வுமையத்தின் ஓர் அண்மைய ஆய்வின்படி, பூமியில் காணப்படும் சில நுண்ணுயிரிகள், பின்வரும் எந்தக் கோளில் உயிர்வாழக்கூடும்?', 'இந்தியாவின் முதல் கடலடி சுரங்கப்பாதை கட்டப்படுகிற நகரம் எது?', 'உலக வனவுயிரிகள் நாள் கடைப்பிடிக்கப்படும் தேதி எது?', 'உலக செவிப்புலன் நாள் கடைப்பிடிக்கப்படும் தேதி எது?', 'வயநாடு வனவுயிரிகள் சரணாலயம் அமைந்துள்ள மாநிலம் எது?', 'அண்மையில் எந்த மாநிலத்தில், கால்நடை மற்றும் விலங்கு அறிவியலுக்கான ஒருங்கிணைந்த ஆராய்ச்சி நிறுவனம் (AIRLAS) திறக்கப்பட்டது?', "அண்மைச் செய்திகளில் இடம்பெற்ற, 'ஹண்டர் கில்லர்ஸ்', எந்த இந்திய ஆயுதப்படையால் கொள்முதல் செய்யப்படவுள்ளது?", 'சமீபத்திய செய்திகளில் இடம்பெற்ற அமேஸானியா-1 செயற்கைக் கோள் சார்ந்த நாடு எது?', '"நம்ம கார்கோ" என்ற சேவை தொடங்கப்பட்டுள்ள மாநிலம் எது?', 'COVAX திட்டத்தின்மூலம் இலவச COVID தடுப்பூசிகளைப்பெற்ற முதல் நாடு எது?', "மிகவும் அருகிவிட்ட இனமான, 'ஆல்பைன் தாவர இனங்கள்' கண்டுபிடிக்கப்பட்டுள்ள மாநிலம் எது?", 'இந்திய கடல்சார் உச்சிமாநாடு-2021 நடைபெறும் இடம் எது?', 'பின்வரும் கூற்றுகளைப் படிக்க\n1. A-யும் B-யும் சமவயதுடையவர்கள் அல்லது A ஆனவர் B-ஐ விட பெரியவர்\n 2. C-யும் D-யும் சமவயதுடையவர்கள் அல்லது D ஆனவர் C-ஐ விட பெரியவர்\n 3. B ஆனவர் C-ஐ விட பெரியவர் மேலே உள்ள கூற்றுகளிலிருந்து நாம் காணும் தீர்மானம் யாது? \n', 'தன்யா, எரிக்-ஐ விட பெரியவள். தயா, தன்யாவை விட பெரியவன். எரிக், தயாவை விட பெரியவன். முதல் இரண்டு கூற்றுகள் சரி எனில் மூன்றாவது கூற்று எப்படிபட்டது?', 'B யை விட A மூத்தவர், C என்பவர் B யை விட மூத்தவராகவும் A வை விட இளையவராகவும், D என்பவர் E மற்றும் B யை விட இளையவராகவும், B என்பவர் E-யை விட மூத்தவராகவும் உள்ளனர். எனில் இதில் மிகவும் இளையவர் யார்?', 'A, B என்பவர்களின் தற்போதைய வயது விகிதம் 4 : 5.5 வருடங்களுக்கு பிறகு அவர்களின் வயது 5: 6 எனில், இருவரின் தற்போதைய வயதின் கூடுதல்', 'P மற்றும் Q-ன் தற்போதைய வயதுகளின் விகிதம் 2 : 3. மேலும் அவர்கள் வயதுகளின் வித்தியாசம் 8 ஆண்டுகள் எனில் P-ன் தற்போதைய வயது ---------ஆண்டுகள்.', 'தந்தை மற்றும் மகனின் வயதின் கூட்டுத்தொகை மொத்தம் 50 ஆண்டுகள் ஆகும். 6 வருடத்திற்கு முன்பு இவர்கள் இருவரின் வயதின் பெருக்குத்தொகையானது அச்சமயத்தின் தந்தை வயதின் இருமடங்காக உள்ளது. தற்போது தந்தை மற்றும் மகனின் வயது', 'A ஆனவர் B யை விட 2 வருடம் பெரியவர் மற்றும் C யை விட இருமடங்கு பெரியவர் ,A,B,C யின் கூட்டுத்தொகை 27 எனில்.B யின் வயது என்ன?', 'கார்த்திக் மற்றும் ஜெய்யின் வயது விகிதங்கள் 4:3. இவ்விருவரின் வயதுகளையும் கூட்டினால் 35 ஆண்டுகள். எனவே, ஆறு ஆண்டுகளுக்குப்பின் இவர்களின் வயது விகிதங்கள் என்ன?', '5 பேர் கொண்ட ஒரு குடும்பத்தின் சராசரி வயது 20 ஆண்டுகள். உறவினர் ஒருவரின் வயதை சேர்க்கும்போது, சராசரி 10 ஆண்டுகள் கூடுகிறது எனில், அந்த உறவினரின் வயது என்ன?', 'A என்பவர் B-யை விட 10 ஆண்டுகள் மூத்தவர்.2 ஆண்டுகளுக்கு முன்பு A-யின் வயது B-யின் வயதேக்காட்டிலும் இருமடங்கு என்றால்,B-யின் தற்போதைய வயது என்ன?', '3 ஆண்டுகள் இடைவெளியில் பிறந்த 5 குழந்தைகளின் வயது கூட்டு தொகை 50 ஆண்டுகள் ஆகிறது. இளைய குழந்தைகளின் வயது என்ன?', 'அப்பாவின் வயது ராமின் வயதை விட மூன்று மடங்கு அதிகம்.8 வருடங்களுக்கு பிறகு ராமின் வயதை விட இரண்டரை மடங்கு அதிகம்.8 வருடங்களுக்கு எத்தனை மடங்கு அதிகமாக இருப்பார்?', '"நான் நீ பிறக்கும்போது உன்னுடைய தற்போதைய வயதில் இருந்தேன்" என்று தந்தை மகனிடம் சொல்கிறார். தற்போது தந்தைக்கு 38 வயது எனில் 5 வருடங்களுக்கு முன் மகனின் வயது என்ன?', 'A ஆனவர் B யை விட 2 வருடம் பெரியவர் மற்றும் C யை விட இருமடங்கு பெரியவர் ,A,B,C யின்கூட்டுத்தொகை 27 எனில்.B யின் வயது என்ன?', 'சமீர் மற்றும் ஆனந்தின் தற்போதைய வயதின் விகிதம் 5:4..3 வருடங்களுக்கு பிறகு வயதின் விகிதம் 11:9 ஆகிறது எனில் ஆனந்தின் தற்போதைய வயது என்ன?', 'ஒருவர் அவரது மகனை விட 24 வயது மூத்தவர். அடுத்த 2 வருடத்தில் அவரது மகனை விட 2 மடங்கு ஆவார். மகனின் தற்போதைய வயது என்ன?', 'குணால் மற்றும் சாகரின் வயது விகிதம் 6 வருடங்களுக்கு முன் 6:5 அடுத்த 4 வருடங்களுக்கு பின் 11:10 என்ற விகிதமாகிறது. தற்போதைய சாகரின் வயது என்ன?', 'தந்தை மற்றும் மகனின் தற்போதைய வயதின் கூட்டுத்தொகை 60. 6 வருடங்களுக்கு பிறகு தந்தையின் வயது மகனின் வயதை விட 5 மடங்கு ஆகிவிடும். அடுத்த 6 வருடங்களுக்கு பிறகு மகனின் வயது என்ன?', 'அருண் மற்றும் தீபக்கின் தற்போதைய வயதின் விகிதம் 4:3..6 வருடங்களுக்கு பிறகு அருணின் வயது 26. தீபக்கின் தற்போதைய வயது என்ன?', 'சச்சின் ராகுலை விட 7 வயது சிறியவன். அவர்களின் வயதின் விகிதம் 7:9.எனில் சச்சின் வயது என்ன?', 'மூன்று நபர்களின் வயதின் விகிதம் 4:7:9. அவர்களின் வயதின் கூட்டுத்தொகை 8 வருடங்களுக்கு முன் 56 எனில் தற்போதைய வயது என்ன?', 'ஒருவன் அவனுடைய அம்மாவின் வயதில் 5-ல் 2 பகுதி உள்ளான்.8 வருடங்களில் 2-ல் 1 பகுதி ஆகிறான். அம்மாவின் தற்போதைய வயது என்ன?', 'ராணி மற்றும் மேரி ஆகியோரின் வயதுகளின் கூடுதல் மேரி மற்றும் நான்ஸி ஆகியோரின் வயதுகளின் கூடுதலைக் காட்டிலும் 14 வருடங்கள் அதிகம் எனில் நான்ஸியானவர் ராணியைக் காட்டிலும் எத்தனை வயது சிறியவர் எனக் கண்டுபிடி', 'B-ன் வயது A -ன் வயதுபோல் இருமடங்கு ஆனால் F-ன் வயதில் பாதி. C -ன் வயது A -ன் வயதில் பாதி ஆனால் D-ன் வயதில் இருமடங்கு. இதில் இளையவர் மற்றும் முதியவர் இணை எது?', 'லதா, சுனிதாவை விட ஒரு வயது பெரியவர். சுனிதா, பிந்துவை விட 2 ஆண்டுகள் பெரியவர். ராஜன், பிந்துவை விட ஒரு வயது பெரியவர். எனில் மூவரில் யார் சிறியவர்?', 'இன்று அபியின் வயது ரீட்டாவின் வயதை போல இரு மடங்கு. 7 வருடங்களுக்கு பின்னர் அவர்களின் வயது வித்தியாசம் 5, எனில் ரீட்டாவின் இன்றைய வயது என்ன?', 'ஒரு பையனின் தற்போதைய வயது அவனது தங்கையின் வயதைப்போல் இரு மடங்கு, 4 ஆண்டுகளுக்கு - முன்பு அவனது வயது அவன் தங்கையின் வயதைப்போல மூன்று மடங்கு எனில், அவர்களது தற்போதைய வயது என்ன?', 'முத்து மற்றும் கார்த்தி ஆகியோரின் தற்போதைய வயதுகளின் விகிதம் 5:3. ஆனால் 6 வருடங்களுக்கு முன் அதுவே 3:1 என இருந்தது. எனில், தற்போதிலிருந்து 5 வருடங்களுக்குப் பிறகு அவர்களுடைய வயதுகளின் விகிதம் என்னவாக இருக்கும்?', 'தற்போது ஒரு தந்தையின் வயது அவரது மகன். வயதைப்போல் இரு மடங்கு. இருப்து ஆண்டுகளுக்கு முன்பு, தந்தையின் வயது மகனின் வயதைப் போல ஆறு மடங்கு எனில், அவர்களது தற்போதைய வயது என்ன ?', 'தந்தை மற்றும் மகனின் தற்போதைய வயதுகளின் கூடுதல் 60 வருடங்கள். 6 வருடங்களுக்கு முன்பு, தந்தையின் வயது மகனின் வயதைப் போல் 5 மடங்கு எனில் 6 வருடங்களுக்குப் பிறகு மகனின் வயது என்ன ?']

a = ['A)\t321 கிமு', 'A)\tகுஷானர்கள்', 'A)\tகாணபத்தியம்', 'A)\tசோழர்கள்', 'A)\tமுத்ரா ராட்சஸம்', 'A)\tபாஹியான்', 'A)\tஅஷ்டசாஸ்திரம்', 'A)\tபிர்கா', 'A)\tகுப்தர்', 'A)\t1', 'A)\t12', 'A)\tதட்சீலம்', 'A)\tபராபர்', 'A)\tஅலகாபாத்', 'A)\tசிங்கம்', 'A)\tஎருது ', 'A)\tஎருது ', 'A)\tஎருது', 'A)\tசிங்கம்', 'A)\t3', 'A)\tகனிஷ்கர்', 'A)\tசாரநாத்', 'A)\tஸ்தூபி', 'A)\tவிகாரம்', 'A)\tபள்ளி', 'A)\tகிரேக்க சிற்பக்கலை', 'A)\tபாலி', 'A)\tபிராகிருதம்', 'A)\tஅஷ்டத்யாயி', 'A)\tசிரவணபெலகுலா', 'A)\tசீனம்', 'A)\tசீனம்', 'A)\tமஹாயனம்', 'A)\tஉபகுப்தர்', 'A)\tஇலங்கை', 'A)\t1', 'A)\tதுறவறம்', 'A)\tசந்திர பாஸ்டி', 'A)\tபத்ரபாகு', 'A)\tரூபயா', 'A)\tநிஷ்கா', 'A)\tஜிடால்', 'A)\tதாமிரலிப்தி', 'A)\tகௌசம்பி', 'A)\tபோர்\u200c படை', 'A)\tஉஜ்ஜயினி', 'A)\tபிளினி', 'A)\tஆயுதத் தயாரிப்பு மற்றும் அணிகலன் தயாரிப்பு', 'A)\tசமணப்பள்ளி', 'A)\tதட்சசீலம் ', 'A)\tதண்டகர்', 'A)\tபலி', 'A)\tபஞ்சா ', 'A)\t325கிமு', 'A)\tதர்மஸ்தானியம்', 'A)\t மெகஸ்தனிஸ்', 'A)\tமுக்தர்', 'A)\tகிராம நிர்வாக அதிகாரிகள்', 'A)\t2', 'A)\tமத்தியஸ்தர்கள்', 'A)\tதுர்கா பாலா', 'A)\tபிரதிஹாரா', 'A)\tஆண் காவல் அதிகாரி', 'A)\tபௌர்', 'A)\tஸ்தானியம்', 'A)\t7,6', 'A)\tநாணயதர்சிகா', 'A)\tசேனாபதி', 'A)1872', 'A)1872', 'A)1872', 'A) உத்திரப்பிரதேசம்', 'A)உத்திரபிரதேசம்', 'A)117', 'A)ஒளிப்படவியல்', 'A)5846 Km', 'A)1993', 'A) பெங்களூரு', 'A) அகமதாபாத்', 'A)18', 'A) சதாப்தி', 'A)1921', 'A) பிறப்பு விகிதம்', 'A)A37', 'A)29.5%', 'A)  A) 1 B) 3 C) 4 D) 2 ', 'A) இந்தியா----80.04%', 'A)கேரளா', 'A) கேரளா', 'A) தமிழ்நாடு', 'A) தமிழ்நாடு', 'A)  A) 1 B) 3 C) 4 D) 2 ', 'A)377', 'A) அமர்த்தியா சென்', 'A) மக்கள் தொகை போக்குகள்,ஆரோக்கியம் வெளிப்பாடு', 'A) ஆரோக்கியம்', 'A)  A) 1 B) 3 C) 4 D) 2 ', 'A)56,03,293', 'A)39,35,337', 'A)NH47 A', 'A)NH47 A', 'A)39,35,337', 'A)39,35,337', 'A)39,35,337', 'A)1960', 'A)1960', 'A) பஞ்சாப்', 'A) புதுடெல்லி', 'A)1960', 'A)  A) 1 B) 3 C) 4 D) 2 ', 'A) கேரளா', 'A) கேரளா', 'A)3', 'A)18', 'A)1952', 'A)1952', 'A) டெல்லி', 'A)  A) 1 B) 3 C) 4 D) 2 ', 'A)5', 'A) இந்தியாவின் மிக அதிவேக ரயில் ----வண்டி த்திமண்', 'A)1952', 'A) மகாராஷ்டிரா', 'A) வடமேற்கு', 'A) கொல்கத்தா மற்றும் சென்னை', 'A) கொல்கத்தா', 'A)500', 'A) பிஹர்', 'A) நீர்வழி போக்குவரத்து', 'A)1987', 'A)  A) 1 B) 3 C) 4 D) 2 ', 'A) கொல்கத்தா ,ஹால்தியா மற்றும் விசாகப்பட்டினம்', 'A) காண்ட்லா மற்றும் மும்பை', 'A)  A) 1 B) 3 C) 4 D) 2 ', 'A)2', 'A)1987', 'A)1987', 'A)19', 'A)1995', 'A)1995', 'A)1995', 'A) கராச்சி', 'A)1995', 'A)1936', 'A)1936', 'A)1936', 'A)5', 'A)1936', 'A)1 A', 'A)  A) 1 B) 3 C) 4 D) 2 ', 'A)39.79%', 'A) மார்ச் 01 ', 'A) இந்தியா ', 'A) புனே பன்னாட்டு மையம் ', 'A) வானிலிருந்து தாக்கும் ஏவுகணை ', 'A) சொத்து மேலாண்மை தளம்  ', 'A) வீட்டுவசதி & நகர்ப்புற வறுமை ஒழிப்பு அமைச்சகம்  ', 'A) ADB ', 'A) வியாழன் ', 'A) சென்னை ', 'A) மார்ச்  02', 'A) மார்ச் 01 ', 'A) தமிழ்நாடு ', 'A) தமிழ்நாடு  ', 'A) இந்திய வான்படை ', 'A) பிரான்ஸ் ', 'A) தமிழ்நாடு ', 'A) காங்கோ ', 'A) அஸ்ஸாம் ', 'A) சென்னை ', 'A) A ஆனவர் C-ஐ விடப் பெரியவர் ', 'A) சரி ', 'A) A', 'A) 55 years', 'A) 16', 'A) 40 ஆண்டுகள், 10 ஆண்டுகள் ', 'A) 12 ', 'A) 28:23 ', 'A) 75 ஆண்டுகள்', 'A) 12', 'A) 2', 'A) 2 மடங்கு', 'A) 12 ஆண்டுகள்', 'A) 12 ', 'A) 24 ', 'A) 24 ', 'A) 14 ', 'A) 14 ', 'A) 12', 'A) 21.5 ', 'A) 20, 32, 40 ', 'A) 30 ', 'A) 12', 'A) F மற்றும் A ', 'A) சுனிதா', 'A) 5', 'A) 18, 9. ', 'A) 5:4', 'A) 60, 30 ', 'A) 12 வருடங்கள்']

b = ['B)\t322 கிமு', 'B)\tமௌரியர்கள்', 'B)\tஆசிவகம்', 'B)\tபல்லவர்கள்', 'B)\tதேவி சந்திரகுப்தம்', 'B)\tமெகஸ்தனிஸ்', 'B)\tஅர்த்தசாஸ்திரம்', 'B)\tஜமின்தாரி', 'B)\tசாளுக்கியர்', 'B)\t5', 'B)\t11', 'B)\tஉஜ்ஜயினி', 'B)\t அஜந்தா', 'B)\tபாக்', 'B)\tவெள்ளை தாமரை', 'B)\tசிங்கம்', 'B)\tசிங்கம்', 'B)\tசக்கரம்', 'B)\tயானை', 'B)\t13', 'B)\tஅசோகர்', 'B)\tவைசாலி', 'B)\tவிகாரம்', 'B)\tமடாலயம்', 'B)\tதூண்கள்', 'B)\tமௌரிய சிற்பக்கலை', 'B)\tசமஸ்கிருதம்', 'B)\tசமஸ்கிருதம்', 'B)\tவியாக்கரணம்', 'B)\tபாடலிபுத்திரம்', 'B)\tஇலங்கை', 'B)\tஇலங்கை', 'B)\t பீடகம்', 'B)\tபத்ரபாகு', 'B)\tதிபெத்', 'B)\t7', 'B)\tசல்லேகனம்', 'B)\tசப்த புரி', 'B)\tஜீன சேனா', 'B)\tகங்கா', 'B)\tபானா', 'B)\tஅனா', 'B)\tபிரிதிலிப்தி', 'B)\tதட்சீலம்', 'B)\tஉளவுப்\u200cபிரிவு', 'B)\tதட்சசீலம்', 'B)\tபாணிணி', 'B)\tகைத்தொழில் மற்றும் மட்பாண்ட உற்பத்தி', 'B)\tவைணவ கோயில்கள்', 'B)\tநாளந்தா', 'B)\tசலிசா', 'B)\tகலி', 'B)\tபாகா', 'B)\t321கிமு', 'B)\tகண்டக ஸ்தானியம்', 'B)\tபிளினி', 'B)\tயுக்தர்', 'B)\tமாகாண நிர்வாக அதிகாரிகள்', 'B)\t7', 'B)\tமகா மாவீரர்கள்', 'B)\tஅந்த பாலா', 'B)\tசன்னி தத்தா', 'B)\tபெண் காவல் அதிகாரி', 'B)\tபிரவுர்', 'B)\tஸ்தானிகர்', 'B)\t6,5', 'B)\tநிஷ்கதர்சிகா', 'B)\tபன்யதக்ஷா', 'B)1881', 'B)1881', 'B)1881', 'B)மகாராஷ்டிரா', 'B)சிக்கிம்', 'B)325', 'B)மக்கள் இயல்', 'B)5847 Km', 'B)1994', 'B)சென்னை', 'B) கராச்சி', 'B)14', 'B)ராஜ்தானி', 'B)1951', 'B) இறப்பு விகிதம்', 'B)45', 'B)8%', 'B)  A) 2 B) 4 C) 3 D) 1 ', 'B) இந்தியா ஆண்கள்----82.14%', 'B) லட்சத்தீவுகள்', 'B) லட்சத்தீவுகள்', 'B) கோவா', 'B) கோவா', 'B)  A) 2 B) 4 C) 3 D) 1 ', 'B)350', 'B) ஜவஹர்லால் நேரு', 'B) கல்வி சாதனைகள் மற்றும் தேசிய வருமானம்', 'B) கல்வி', 'B)  A) 2 B) 4 C) 3 D) 1 ', 'B)65,03,293', 'B)5,61,940', 'B)NH7', 'B)NH7', 'B)5,61,940', 'B)5,61,940', 'B)5,61,940', 'B)1995', 'B)1995', 'B) குஜராத்', 'B) கொல்கத்தா', 'B)1999', 'B)  A) 2 B) 4 C) 3 D) 1 ', 'B) ஜம்மு காஷ்மீர்', 'B) ஜம்மு காஷ்மீர்', 'B)5', 'B)13', 'B)1853', 'B)1853', 'B) கொல்கத்தா', 'B)  A) 2 B) 4 C) 3 D) 1 ', 'B)6', 'B) இதன் வேகம் 160 கிலோமீட்டர்', 'B)1853', 'B) கர்நாடகா', 'B) கொங்கன் ரயில்வே', 'B) புதுடெல்லி மற்றும் மும்பை', 'B) சென்னை', 'B)507', 'B) ராஜஸ்தான்', 'B) குழாய் வழிப் போக்குவரத்து', 'B)1986', 'B)  A) 2 B) 4 C) 3 D) 1 ', 'B) தூத்துக்குடி ,சென்னை, எண்ணூர்', 'B) நவ சேவா மற்றும் கொச்சின்', 'B)  A) 2 B) 1 C) 4 D) 3', 'B)16', 'B)1986', 'B)1986', 'B)16', 'B)2007', 'B)2007', 'B)1857', 'B) லாகூர்', 'B)2007', 'B)1957', 'B)1957', 'B)1957', 'B)3', 'B)1957', 'B)1 B', 'B)  A) 2 B) 3 C) 4 D) 1 ', 'B)53.25%', 'B) மார்ச் 02 ', 'B) ஜப்பான் ', 'B) ஐஐடி - மெட்ராஸ் ', 'B) தரையிலிருந்து தாக்கும் ஏவுகணை ', 'B) ஆவணக்களஞ்சியம்', 'B) உள்துறை அமைச்சகம் ', 'B) உலக வங்கி ', 'B) வெள்ளி ', 'B) கொச்சின் ', 'B) மார்ச் 01', 'B) மார்ச் 02 ', 'B) கேரளா ', 'B) கேரளா ', 'B) இந்திய இராணுவம் ', 'B) பிரேஸில்  ', 'B) கேரளா ', 'B) கானா  ', 'B) சிக்கிம் ', 'B) கொச்சின் ', 'B) D ஆனவர் Cஐ விடப் பெரியவர் ', 'B) தவறு', 'B) B', 'B) 45 years ', 'B) 24  ', 'B) 41 ஆண்டுகள், 9 ஆண்டுகள்', 'B) 10 ', 'B) 20:17', 'B) 80 ஆண்டுகள் ', 'B) 14 ', 'B) 4', 'B) 4 மடங்கு', 'B) 10 ஆண்டுகள் ', 'B) 10 ', 'B) 14 ', 'B) 14 ', 'B) 16', 'B) 16', 'B) 21 ', 'B) 22.5 ', 'B) 12, 24, 32 ', 'B) 35', 'B) 16', 'B) D மற்றும் F', 'B) லதா ', 'B) 7  ', 'B) 14, 7 ', 'B) 10:7 ', 'B) 40, 20  ', 'B) 14 வருடங்கள் ']

c = ['C)\t320 கிபி', 'C)\tபாண்டியர்கள்', 'C)\tபௌத்தம்', 'C)\tபாண்டியர்கள்', 'C)\tகல்பசுத்திரம்', 'C)\tகௌடில்யர்', 'C)\tவியாகரணம்', 'C)\tராயத்வாரி', 'C)\tராஷ்டிரகூடர்', 'C)\t7', 'C)\t7', 'C)\tதோசாலி', 'C)\tஎல்லோரா', 'C)\tசாரநாத்', 'C)\tவெள்ளை காளை', 'C)\tயானை ', 'C)\tயானை', 'C)\tஸ்தூபி', 'C)\tபோதிமரம்', 'C)\t7', 'C)\tசதகர்னி', 'C)\tஅனுராதபுரம்', 'C)\tசைத்தியம்', 'C)\tபள்ளி ', 'C)\tஸ்தூபிகள்', 'C)\tகாந்தாரக் கலை', 'C)\tநாகரி', 'C)\tதமிழ்', 'C)\tசூத்திர விருத்தி', 'C)\tசப்த புரி', 'C)\tநேபாளம்', 'C)\tநேபாளம்', 'C)\tதீபவம்சம்', 'C)\tமோகலிபுத்த திசா', 'C)\tநேபாளம்', 'C)\t3', 'C)\tஅத்வைதம்', 'C)\tசரவெணபெலகுலா', 'C)\tபிங்கலி', 'C)\tசுவர்ணம்', 'C)\tகர்சபனா', 'C)\tகர்சபனா', 'C)\tஎலிபெண்டா', 'C)\tபாடலிபுத்திரம்', 'C)\tவரி\u200c குழு', 'C)\tகௌசம்பி', 'C)\tஆர்ரியன்', 'C)\tநாணய தயாரிப்பு', 'C)\tசைவ வைப்புத் தலங்கள்', 'C)\tவிக்கரமசீலா', 'C)\tகுதபுருஷர்', 'C)\tபாகா', 'C)\tவாகா', 'C)\t324கிமு', 'C)\tகண்டக சோதனா', 'C)\tயுவான் சுவாங்', 'C)\t கிராமினி', 'C)\tஅரசரின் ஆலோசனைக்குழு', 'C)\t4', 'C)\tமகா மாதிரர்கள்', 'C)\tமகா மாத்திரர்', 'C)\tநியாயதிஷ்', 'C)\tஎல்லைக் காவல் அதிகாரி', 'C)\tமத்தியார்', 'C)\tஸ்தானம்', 'C)\t7,8', 'C)\tதிடிகதர்சிகா', 'C)\tஅகஷபாடலா', 'C)2001', 'C)2001', 'C)2001', 'C) பீகார்', 'C)டெல்லி', 'C)382', 'C)ஆடற்கலையில்', 'C)5849 Km', 'C)1996', 'C)புதுடெல்லி', 'C)புனே', 'C)12', 'C) காத்திமண்', 'C)1961', 'C) இடப்பெயர்வு', 'C)48', 'C)37.5%', 'C)  A) 3 B) 4 C) 2 D) 1   ', 'C) இந்தியா பெண்கள்----65.46%', 'C) பீகார்', 'C) பீகார்', 'C) ஹிமாச்சல் பிரதேஷ்', 'C) ஹிமாச்சல் பிரதேஷ்', 'C)  A) 2 B) 4 C) 1 D) 3', 'C)397', 'C) மெஹபூப் உல் ஹக்', 'C) வள கூட்டமைப்பு மற்றும் தொழில் மற்றும் வேலை வாய்ப்பு', 'C) வருமானம்', 'C)  A) 3 B) 1 C) 4 D) 2  ', 'C)45,03,293', 'C)1,01,011', 'C)NH1', 'C)NH1', 'C)1,01,011', 'C)1,01,011', 'C)1,01,011', 'C)1952', 'C)1952', 'C) சண்டிகர்', 'C) சென்னை மற்றும் மும்பை', 'C)1952', 'C)  A) 3 B) 1 C) 4 D) 2  ', 'C) குஜராத்', 'C) குஜராத்', 'C)2', 'C)11', 'C)1925', 'C)1925', 'C) மும்பை', 'C)  A) 3 B) 1 C) 4 D) 2  ', 'C)3', 'C) புதுடெல்லி யையும் ஆதரவையும் 200 கிலோமீட்டர் தொலைவை நூற்றி ஐந்து நிமிடங்களில் கடக்கிறது', 'C)1998', 'C) மேற்கூறிய இரண்டும் சரியானவை', 'C) மேற்கு ரயில்வே', 'C) பெங்களூர்,கொச்சின்,ஹரியானா மற்றும் ஜெய்ப்பூர்', 'C) மும்பை', 'C)407', 'C) மேகாலயா', 'C) சாலைப்போக்குவரத்து', 'C)1918', 'C)  A) 3 B) 1 C) 4 D) 2  ', 'C) பாரதீப்', 'C) மர்மகோவா,நியூ மங்களூர்', 'C)  A) 3 B) 1 C) 4 D) 2  ', 'C)8', 'C)1918', 'C)1918', 'C)11', 'C)1975', 'C)1975', 'C)1975', 'C) கொல்கத்தா', 'C)1975', 'C)1923', 'C)1923', 'C)1923', 'C)2', 'C)1923', 'C)1 C', 'C)  A) 3 B) 1 C) 4 D) 2  ', 'C)25.51%', 'C) மார்ச் 03 ', 'C) மாண்டினீக்ரோ  ', 'C) ஐஐம் - ஆமதாபாத் ', 'C) கண்டம் விட்டு கண்டம் பாயும் ஏவுகணை', 'C) சமூக ஊடகம் ', 'C) புவி அறிவியல் அமைச்சகம்', 'C) AIIB ', 'C) செவ்வாய்  ', 'C) மும்பை ', 'C) மார்ச் 03', 'C) மார்ச் 03  ', 'C) கர்நாடகா ', 'C) கர்நாடகா ', 'C) இந்திய கடலோரக் காவல்படை ', 'C) பின்லாந்து ', 'C) கர்நாடகா ', 'C) சூடான் ', 'C) அருணாச்சல பிரதேசம்  ', 'C) மும்பை ', 'C) A ஆனவர் B-ஐ விடப் பெரியவர் ', 'C) முடிவானது அல்ல', 'C) C', 'C) 35 years', 'C) 12', 'C) 38 ஆண்டுகள், 12 ஆண்டுகள் ', 'C) 14 ', 'C) 26:21 ', 'C) 60 ஆண்டுகள் ', 'C) 16 ', 'C) 6', 'C) 1 மடங்கு', 'C) 16 ஆண்டுகள்', 'C) 14 ', 'C) 18 ', 'C) 18 ', 'C) 18 ', 'C) 18', 'C) 15', 'C) 24.5 ', 'C) 16, 28, 36 ', 'C) 40', 'C) 14', 'C) B மற்றும் F', 'C) பிந்து', 'C) 9', 'C) 16, 8 ', 'C) 10:8', 'C) 58, 29', 'C) 18 வருடங்கள்']

d = ['D)\t550  கிபி', 'D)\tகுப்தர்கள்', 'D)\tசமணம்', 'D)\tகளப்பிரர்', 'D)\tஅஷ்டாங்க சம்கிரஹம்', 'D)\tபிளினி', 'D)\tஇண்டிகா', 'D)\tமன்சப்தாரி', 'D)\tகுஷானர்', 'D)\t12', 'D)\t8', 'D)\tராஜகிருகம் ', 'D)\tகாலா', 'D)\tஅனுராதபுரம்', 'D)\tவெள்ளை யானை', 'D)\tகுதிரை', 'D)\tகுதிரை', 'D)\tசிங்கம்', 'D)\tதர்மச்சக்கரம்', 'D)\t14', 'D)\tபிந்துசாரர்', 'D)\tதோசாலி', 'D)\tபள்ளி', 'D)\tசைத்தியம்', 'D)\tவிகாரம்', 'D)\tநகரக் கலை', 'D)\tபிராகிருத மொழி', 'D)\tதிராவிட மொழி', 'D)\tபீடகம்', 'D)\tசந்திர பாஷ்டி', 'D)\tதிபெத்', 'D)\tதிபெத்', 'D)\tமகாவம்சம்', 'D)\tஅனுலா', 'D)\tசீனம்', 'D)\t13', 'D)\tதிக்கஜம்', 'D)\tஅயோத்தி', 'D)\t பார்சவர்', 'D)\t நிஷ்கா', 'D)\tஜிடால்', 'D)\tபானா', 'D)\tதோசாலி', 'D)\tஇவையனைத்தும்', 'D)\tவணிகக் குழு', 'D)\tசோட்டா நாக்பூர்', 'D)\tமெகஸ்தனிஸ்', 'D)\tஇவற்றுள் ஏதுமில்லை', 'D)\tபௌத்த விகாரங்கள்', 'D)\tஏதுமில்லை', 'D)\tஏதுமில்லை', 'D)\tபஞ்சா', 'D)\tசாகா', 'D)\t326கிமு', 'D)\tஏதுமில்லை', 'D)\tகௌடில்யர்', 'D)\tகோபன்', 'D)\tநகர நிர்வாக தலைமை', 'D)\t5', 'D)\tஉபரிகர்கள்', 'D)\tசன்னி தத்தா', 'D)\tசம்ஹர்தர்', 'D)\tஅரண்மனை சோதனையாளர்', 'D)\tவிசாரகர்', 'D)\tஏதுமில்லை', 'D)\t9,8', 'D)\tரூபதர்சிகா', 'D)\tஆயுதகரதக்ஷா', 'D)2011', 'D)2011', 'D)2011', 'D) மேற்கு வங்கம்', 'D)அருணாச்சலப் பிரதேசம்', 'D)555', 'D)மக்களடர்த்தி', 'D)5800 Km', 'D)1995', 'D)ஹைதராபாத்', 'D) கொல்கத்தா', 'D)10', 'D) சார்மினார்', 'D)2011', 'D) அனைத்தும் சரியானவை', 'D)52', 'D)62.5%', 'D)  A) 3 B) 4 C) 2 D) 1 ', 'D) ஆண் பெண் வித்தியாசம்----16.68%', 'D) தமிழ்நாடு', 'D) தமிழ்நாடு', 'D) மகாராஷ்டிரா', 'D) கேரளா', 'D)  A) 3 B) 4 C) 2 D) 1 ', 'D)400', 'D) அம்பேத்கர்', 'D) அனைத்தும் சரியானவை', 'D) அனைத்தும் சரியானவை', 'D)  A) 3 B) 4 C) 2 D) 1 ', 'D)60,03,293', 'D)1,76,166', 'D)NH2', 'D)NH2', 'D)1,76,166', 'D)1,76,166', 'D)1,76,166', 'D)1925', 'D)1925', 'D) ஜம்மு காஷ்மீர்', 'D) அனைத்தும் சரியானவை', 'D)1925', 'D)  A) 3 B) 4 C) 2 D) 1 ', 'D) அருணாச்சல் பிரதேசம்', 'D) அருணாச்சல் பிரதேசம்', 'D)7', 'D)9', 'D)1953', 'D)1953', 'D) சென்னை', 'D)  A) 3 B) 4 C) 2 D) 1 ', 'D)7', 'D) அனைத்தும் சரியானவை', 'D)1953', 'D) மேற்கூறிய எதுவும் இல்லை', 'D) கிழக்கு ரயில்வே', 'D) அனைத்தும்', 'D) கொச்சின்', 'D)307', 'D) அருணாச்சல் பிரதேசம்', 'D) ரயில் போக்குவரத்து', 'D)1953', 'D)  A) 4 B) 3 C) 1 D) 2', 'D) அனைத்தும் சரியானவை', 'D) அனைத்தும் சரியானவை', 'D)  A) 4 B) 3 C) 1 D) 2', 'D)4', 'D)1953', 'D)1953', 'D)8', 'D)1972', 'D)1972', 'D)1972', 'D)டெல்கி', 'D)1972', 'D)1983', 'D)1983', 'D)1983', 'D)6', 'D)1983', 'D)1 D', 'D)  A) 3 B) 4 C) 2 D) 1 ', 'D)75.23%', 'D) மார்ச் 04', 'D) இத்தாலி', 'D) BITS பிலானி', 'D) தரையிலிருந்து வானுக்குத் தாக்கும் ஏவுகணை', 'D) செய்தியிடல் செயலி ', 'D) எரிசக்தி அமைச்சகம்', 'D) புதிய வளர்ச்சி வங்கி', 'D) புதன்', 'D) கொல்கத்தா', 'D) மார்ச் 04', 'D) மார்ச் 04', 'D) தெலங்கானா', 'D) உத்தர பிரதேசம்', 'D) இந்தியக் கடற்படை', 'D) பிலிப்பைன்ஸ்', 'D) தெலங்கானா', 'D) எத்தியோப்பியா', 'D) ஹிமாச்சல பிரதேசம்', 'D) மெய்நிகர் முறையில்', 'D) B-யும் D-யும் சமவயதுடையவர்கள்', 'D) முடிவானது', 'D) D', 'D) 25 years', 'D) 30 ', 'D) 42 ஆண்டுகள், 8 ஆண்டுகள்', 'D) 8', 'D) 30:23', 'D) 85 ஆண்டுகள்', 'D) 10', 'D) 5', 'D) 3 மடங்கு', 'D) 14 ஆண்டுகள்', 'D) 8', 'D) 22', 'D) 22', 'D) 20', 'D) 20', 'D) 18', 'D) 26.5', 'D) மேற்கண்ட எதுவுமில்லை', 'D) 45', 'D) 28', 'D) F மற்றும் C', 'D) ராஜன்', 'D) 10', 'D) 12, 6', 'D) 4:3', 'D) 50, 25 ', 'D) 20 வருடங்கள்']

correct_answer = ['A)\t321 கிமு', 'D)\tகுப்தர்கள்', 'A)\tகாணபத்தியம்', 'C)\tபாண்டியர்கள்', 'A)\tமுத்ர ராட்சஸம்', 'B)\tமெகஸ்தனிஸ்', 'A)\tஅஷ்டசாஸ்திரம்', 'A)\tபிர்கா', 'D)\tகுஷானர்', 'C)\t7', 'A)\t12', 'D)\tராஜகிருகம்', 'A)\tபராபர்', 'C)\tசாரநாத்', 'D)\tவெள்ளை யானை', 'A)\tஎருது', 'D)\tகுதிரை', 'D)\tசிங்கம்', 'D)\tதர்மச்சக்கரம்', 'C)\t7', 'B)\tஅசோகர்', 'C)\tஅனுராதபுரம்', 'B)\tவிகாரம்', 'D)\tசைத்தியம்', 'C)\tஸ்தூபிகள்', 'C)\tகாந்தாரக் கலை', 'B)\tசமஸ்கிருதம்', 'A)\tபிராகிருதம்', 'B)\tவியாக்கரணம்', 'D)\tசந்திர பாஷ்டி', 'A)\tசீனம்', 'B)\tஇலங்கை', 'C)\tதீபவம்சம்', 'C)\tமோகலிபுத்த திசா', 'A)\tஇலங்கை', 'D)\t13', 'B)\tசல்லேகனம்', 'C)\tசரவெணபெலகுலா', 'A)\tபத்ரபாகு', 'D)நிஷ்கா', 'B)\tபானா', 'C)\tகர்சபனா', 'A)\tதாமிரலிப்தி', 'A)\tகௌசம்பி', 'D)\tவணிகக் குழு', 'D)\tசோட்டா நாக்பூர்', 'A)\tபிளினி', 'A)\tஆயுதத் தயாரிப்பு மற்றும் அணிகலன் தயாரிப்பு', 'D)\tபௌத்த விகாரங்கள்', 'A)\tதட்சசீலம்', 'C)\tகுதபுருஷர்', 'A)\tபலி', 'B)\tபாகா', 'D)\t326கிமு', 'C)\tகண்டக சோதனா', 'B)\tபிளினி', 'D)\tகோபன்', 'D)\tநகர நிர்வாக தலைமை', 'B)\t7', 'C)\tமகா மாதிரர்கள்', 'D)\tசன்னி தத்தா', 'D)\tசம்ஹர்தர்', 'B)\tபெண் காவல் அதிகாரி', 'A)\tபௌர்', 'B)\tஸ்தானிகர்', 'B)\t6,5', 'D)\tரூபதர்சிகா', 'D)\tஆயுதகரதக்ஷா', 'A)1872', 'B)1881', 'D)2011', 'A) உத்திரப்பிரதேசம்', 'B)சிக்கிம்', 'C)382', 'B)மக்கள் இயல்', 'A)5846 Km', 'D)1995', 'D)ஹைதராபாத்', 'B) கராச்சி', 'A)18', 'C) காத்திமண்', 'A)1921', 'D) அனைத்தும் சரியானவை', 'B)45', 'D)62.5%', 'C)  A) 3 B) 4 C) 2 D) 1   ', 'A) இந்தியா----80.04%', 'A)கேரளா', 'C) பீகார்', 'B) கோவா', 'C) ஹிமாச்சல் பிரதேஷ்', 'C)  A) 2 B) 4 C) 1 D) 3', 'A)377', 'C) மெஹபூப் உல் ஹக்', 'D) அனைத்தும் சரியானவை', 'D) அனைத்தும் சரியானவை', 'C)  A) 3 B) 1 C) 4 D) 2', 'A)56,03,293', 'C)1,01,011', 'B)NH7', 'A)NH47 A', 'D)1,76,166', 'B)5,61,940', 'A)39,35,337', 'B)1995', 'A)1960', 'C) சண்டிகர்', 'D) அனைத்தும் சரியானவை', 'B)1999', 'C)  A) 3 B) 1 C) 4 D) 2  ', 'A) கேரளா', 'B) ஜம்மு காஷ்மீர்', 'C)2', 'A)18', 'B)1853', 'A)1952', 'C) மும்பை', 'C)  A) 3 B) 1 C) 4 D) 2  ', 'B)6', 'D) அனைத்தும் சரியானவை', 'C)1998', 'C) மேற்கூறிய இரண்டும் சரியானவை', 'B) கொங்கன் ரயில்வே', 'D) அனைத்தும் ', 'A) கொல்கத்தா', 'B)507', 'C) மேகாலயா', 'A) நீர்வழி போக்குவரத்து', 'B)1986', 'D)  A) 4 B) 3 C) 1 D) 2', 'D) அனைத்தும் சரியானவை', 'D) அனைத்தும் சரியானவை', 'B) A) 2 B) 1 C) 4 D) 3', 'B)16', 'C)1918', 'D)1953', 'A)19', 'A)1995', 'B)2007', 'B)1857', 'A) கராச்சி', 'C)1975', 'C)1923', 'A)1936', 'B)1957', 'C)2\n', 'D)1983', 'B)1 B', 'B)  A) 2 B) 3 C) 4 D) 1 ', 'A)39.79%', 'A) மார்ச் 01', 'C) மாண்டினீக்ரோ', 'A) புனே பன்னாட்டு மையம்', 'D) தரையிலிருந்து வானுக்குத் தாக்கும் ஏவுகணை', 'A) சொத்து மேலாண்மை தளம்', 'A) வீட்டுவசதி & நகர்ப்புற வறுமை ஒழிப்பு அமைச்சகம்', 'C) AIIB', 'C) செவ்வாய்', 'C) மும்பை', 'C) மார்ச் 03', 'C) மார்ச் 03', 'B) கேரளா', 'A) தமிழ்நாடு', 'B) இந்திய இராணுவம்', 'B) பிரேஸில்', 'C) கர்நாடகா', 'B) கானா', 'C) அருணாச்சல பிரதேசம்', 'D) மெய்நிகர் முறையில்', 'A) A ஆனவர் C-ஐ விடப் பெரியவர்', 'B) தவறு', 'D) D', 'B) 45 years', 'C) 12', 'D) 42 ஆண்டுகள், 8 ஆண்டுகள்', 'D) 8', 'C) 26:21', 'B) 80 ஆண்டுகள்', 'A) 12', 'B) 4', 'A) 2 மடங்கு', 'D) 14 ஆண்டுகள்', 'B) 10', 'A) 24', 'D) 22', 'B) 16', 'D) 20', 'C) 15', 'C) 24.5', 'C) 16, 28, 36', 'C) 40', 'C) 14', 'B) D மற்றும் F', 'C) பிந்து', 'A) 5', 'C) 16, 8', 'B) 10:7', 'D) 50, 25', 'D) 20 வருடங்கள்']

@app.route("/", methods=["GET", "POST"])
def home():
    warning = request.args.get("warn")

    if current_user.is_authenticated:
        completed = Test21.query.filter_by(examinee_id=current_user.user_id).first()

        if request.args.get("fee"):
            name = request.args.get("name")
            bending = request.args.get("bending")
            logged_in = request.args.get("logged_in")

            return render_template("index.html", fee=True, name=name, bending=bending, logged_in=logged_in,
                                   completed=completed)

        else:
            if completed:
                return render_template("index.html", warning=warning, completed=completed)

            else:
                return render_template("index.html", warning=warning)

    else:
        return render_template("index.html", warning=warning)


@app.route("/register", methods=['GET', 'POST'])
def register():
    form = RegisterForm()
    errors = []

    if form.validate_on_submit():
        hash_and_salted_password = generate_password_hash(
            request.form.get('password'),
            method='pbkdf2:sha256',
            salt_length=8
        )

        new_user = User(
            email=request.form.get('email'),
            username=request.form.get('name'),
            password=hash_and_salted_password,
        )

        if User.query.filter_by(email=request.form.get('email').lower()).first():
            return redirect(url_for('login', msg="You've already been registered. Please Login!"))

        elif User.query.filter_by(username=request.form.get('name')).first():
            errors.append('The username has already been taken')
            return render_template("register.html", errors=errors, form=form)

        else:
            errors.clear()

            if request.form.get('email') in verified_emails:

                db.session.add(new_user)
                db.session.commit()

                login_user(new_user)

                # redirect to the home page with fee details.
                return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                        bending=student_mails[request.form.get('email')][1]))

            else:
                return redirect(url_for('home', warn=True))

    return render_template("register.html", form=form)


@app.route("/login", methods=['GET', 'POST'])
def login():
    form = LoginForm()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        password = request.form.get('password')

        # Find user by email entered.
        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, password):
            login_user(user)
            errors.clear()

            # checking the user's payment details
            # redirect to the home page with fee details.
            return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                    bending=student_mails[request.form.get('email')][1]))

        else:
            errors.append('Incorrect Password! Try Again')
            return render_template("login.html", errors=errors, form=form)

    msg = request.args.get("msg")
    return render_template("login.html", form=form, errors=errors, msg=msg)


@app.route("/exam", methods=["GET", "POST"])
def exam():
    global attended
    test_no = request.args.get("test_no")
    opentime = exam_sites[test_no][0]
    closetime = exam_sites[test_no][1]

    # if test_no == "15":
    #     attended = Test15.query.filter_by(examinee_id=current_user.user_id).first()

#     if test_no == "16":
#         attended = Test16.query.filter_by(examinee_id=current_user.user_id).first()

#     if test_no == "17":
#         attended = Test17.query.filter_by(examinee_id=current_user.user_id).first()

    if test_no == "18":
        attended = Test18.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "19":
        attended = Test19.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "20":
        attended = Test20.query.filter_by(examinee_id=current_user.user_id).first()
        
    elif test_no == "21":
        attended = Test21.query.filter_by(examinee_id=current_user.user_id).first()
        
    else:
        return redirect(url_for("home", warn="Sorry the results are no longer available!"))

    if attended is None:
        return render_template("exam.html", opentime=json.dumps(opentime), closetime=json.dumps(closetime),
                               sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d, correct_answer=correct_answer,
                               answers=[], test_no=test_no)
    else:
        return redirect(url_for("home", warn="You have already committed this exam. Check the results instead."))


@app.route('/evaluate', methods=["GET", "POST"])
def evaluate():

    global new_examinee
    answers = []
    final_result = []
    marks = 0

    for i in range(0, len(sl_no)):
        user_answer = request.form[f'answers{i}']

        if user_answer is None:
            answers.append("None")

        else:
            answers.append(user_answer)

    for j in range(len(correct_answer)):

        if answers[j].strip() == correct_answer[j].strip():
            marks += 1
            final_result.append("Correct")

        else:
            final_result.append("Wrong")

    # return f"{final_result, answers, correct_answer}"

    st_answers = '#||#'.join(answers)
    f_result = "#||#".join(final_result)

    # return f"{correct_answer, answers}"
    # return f"{[s_answers for s_answers in correct_answer]}"
    # return f"{[s_answers for s_answers in answers]}"
    # return f"{final_result}"

    actual_time = datetime.datetime.now()
    s_time = actual_time.strftime('%Y-%m-%d %H:%M:%S.%f')

    new_examinee = Test21(
        test_author=current_user,
        user_answers=st_answers,
        marks=marks,
        final_result=f_result,
        date=s_time[:-7],
        examinee_name=current_user.username
    )

    db.session.add(new_examinee)
    db.session.commit()

    return redirect(url_for('home', warn="You have successfully completed the exam. Click results to see results."))


@app.route("/result", methods=["GET", "POST"])
def result():
    global answers, final_result, time, marks
    test_no = request.args.get("test_no")

    if test_no == "15":
        attended_student = Test15.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "16":
        attended_student = Test16.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "17":
        attended_student = Test17.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "18":
        attended_student = Test18.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "19":
        attended_student = Test19.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "20":
        attended_student = Test20.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "21":
        attended_student = Test21.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date
        
    return render_template("results.html", answers=answers, marks=marks, sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d,
                           correct_answer=correct_answer, final_result=final_result, time=time)


@app.route("/dashboard")
def dashboard():
    all_record = Test21.query.all()

    return render_template("dashboard.html", all_record=all_record)


@app.route("/change_details", methods=["GET", "POST"])
def change_password():
    form = ChangeDetails()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        old_password = request.form.get('old_password')
        new_password = request.form.get('new_password')

        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, old_password):

            if User.query.filter_by(email=email).first():
                old = User.query.filter_by(email=email).first()
                pass_to_update = User.query.get(old.user_id)

                hash_and_salted_password = generate_password_hash(
                    new_password,
                    method='pbkdf2:sha256',
                    salt_length=8
                )

                pass_to_update.password = hash_and_salted_password

                db.session.commit()

                logout_user()
                return redirect(url_for('login', msg="Your password has been changed successfully. "
                                                     "Please Login with your new password."))

        else:
            errors.append("Please check your password.")
            return render_template("change_details.html", form=form, errors=errors)

    return render_template("change_details.html", form=form, errors=errors)


@app.route('/logout')
@login_required
def logout():
    logout_user()
    return redirect(url_for('home'))


@app.route("/admission", methods=["GET", "POST"])
def new_admission():
    form = AdmissionForm()

    if form.validate_on_submit():
        new_member = Admission(
            name=form.name.data,
            mobile_number=form.number.data,
            email=form.email.data,
        )

        db.session.add(new_member)
        db.session.commit()

        verification_code = random.randint(2000, 10000)

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=request.form.get('email'),
                                msg=f"Subject:WELCOME TO SENA CAREER INSTITUTE\n\nWelcome {request.form.get('name')}!"
                                    f" Happy to see you with us. Thanks for supporting us! Keep rocking! "
                                    f"Here is our Educators' number: 8610642720".encode('utf-8'))

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=MY_EMAIL,
                                msg=f"Subject:NEW ADMISSION\n\n{request.form.get('name')} has made an "
                                    f"admission sign up on Sena site Here is details {request.form.get('name')},"
                                    f" {request.form.get('number')}, {request.form.get('email')}!")

        return redirect(url_for('home'))

    return render_template("register.html", form=form, admission=True)


if __name__ == '__main__':
    app.run(debug=True)
