import datetime
import random
import smtplib
import pandas
from flask import Flask, render_template, redirect, url_for, flash, request, abort
from flask_bootstrap import Bootstrap
from flask_ckeditor import CKEditor
from werkzeug.security import generate_password_hash, check_password_hash
from flask_sqlalchemy import SQLAlchemy
from flask_login import UserMixin, login_user, LoginManager, login_required, current_user, logout_user
from flask_wtf import FlaskForm
from sqlalchemy.orm import relationship
from wtforms import StringField, SubmitField, PasswordField
from wtforms.fields.html5 import EmailField
from wtforms.validators import DataRequired
from functools import wraps
import os
import json

app = Flask(__name__)
app.config['SECRET_KEY'] = os.environ.get("SECRET_KEY")
ckeditor = CKEditor(app)
Bootstrap(app)

app.config['SQLALCHEMY_DATABASE_URI'] = os.environ.get("DATABASE_URL", "sqlite:///sena-base.db")
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
db = SQLAlchemy(app)

admin = False
login_manager = LoginManager()
login_manager.init_app(app)

MY_EMAIL = os.environ.get("MY_EMAIL")
SENA_EMAIL = 'sivagangainagarajan@gmail.com'
MY_PASSWORD = os.environ.get("MY_PASSWORD")


@login_manager.user_loader
def load_user(user_id):
    return User.query.get(int(user_id))


def admin_only(f):
    @wraps(f)
    def decorated_function(*args, **kwargs):
        # If id is not 1 then return abort with 403 error
        if current_user.user_id != 1:
            return abort(403)
        # Otherwise continue with the route function
        return f(*args, **kwargs)

    return decorated_function


class User(UserMixin, db.Model):
    __tablename__ = "User"
    user_id = db.Column(db.Integer, primary_key=True)
    email = db.Column(db.String(100), unique=True)
    password = db.Column(db.String(100))
    username = db.Column(db.String(100))
    test = relationship("Test15", back_populates="test_author")
    test = relationship("Test16", back_populates="test_author")

    def get_id(self):
        return self.user_id


class Test15(db.Model):
    __tablename__ = "Test_15"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test")
    marks = db.Column(db.Integer)
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test16(db.Model):
    __tablename__ = "Test_16"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Admission(db.Model):
    __tablename__ = "New_Admission"
    user_id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(100))
    mobile_number = db.Column(db.Integer)
    email = db.Column(db.String(100), unique=True)


db.create_all()
db.session.commit()


class RegisterForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Register')


class LoginForm(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Login')


class AdmissionForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    number = StringField("Phone*", validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    submit = SubmitField('Submit')


class ChangeDetails(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    old_password = PasswordField('Old Password*', validators=[DataRequired()])
    new_password = PasswordField('New Password*', validators=[DataRequired()])
    submit = SubmitField('Submit')


student_mails = {
    "mgopalakrishnan075@gmail.com": ["Gopal", 2000],
    "nivir6558@gmail.com": ["Nivetha", 7000],
    "jaya26jj@gmail.com": ["Christy", 5000],
    "srjamuna1003@gmail.com": ["jamuna", 7000],
    "satheshpandian1997@gmail.com": ["Satheshpandian", 4000],
    "lakshmiraja412@gmail.com": ["Rajalaskhmi", 5000],
    "tamilarasanbe9597@gmail.com": ["Anitha", 1000],
    "rajeshkannan6341@gmail.com": ["Rajesh kannan", 3000],
    "jaishreeramgp@gmail.com": ["Yogapriya", 3000],
    "irudhayasubiksha2001@gmail.com": ["Subiksha", 0],
    "abinayaabi257@gmail.com": ["Abi", 1000],
    "shanthirasu1991@gmail.com": ["Shanthi", 0],
    "pradee1296@gmail.com": ["Pradeepa", 5000],
    "jeniferj0204@gmail.com": ["Janifer", 7000],
    "Krish47457@gmail.com": ["Krishna", 0],
    "naveenaryan440@gmail.com": ["Naveen", 0],
    "veerasurya250899@gmail.com": ["Suriya", 3000],
    "amin2svg@gmail.com": ["Amin", 3000],
    "jjprincy06@gmail.com": ["Jeba Josepin Princy", 0],
    "jancybetsia20@gmail.com": ["Jancy", 0],
    "cottonpanju9@gmail.com": ["Panju", 2000],
    "rameswariv1999@gmail.com": ["Rameshwari", 2000],
    "vimaladharmar2002@gmail.com": ["Vimala", 1000],
    "devahi1993@gmail.com": ["Devahi", 0],
    "sarojiniganesan96@gmail.com": ["Sarojini", 0],
    "gangadha91@gmail.com": ["Gangadharan", 0],
    "krishnannk498@gmail.com": ["Kamatchi", 0],
    "indhuindhumathi141@gmail.com": ["Indhumathi", 4000],
    "jamespurysh@gmail.com": ["Purushothaman", 0],
    "sivagangainagarajan@gmail.com": ["Nagarajan", 0],
    "matheshsethu22@gmail.com": ["Mathesh", 4000],
    "nagarajnkarthika@gmail.com": ["Karthika", 2000],
    "keviraj482@gmail.com": ["Yogesh", 2000],
    "christyjeslina98@gmail.com": ["Christy", 3500]
}

verified_emails = [mail.strip() for mail in student_mails.keys()]

exam_sites = {

    "15": ["June 14, 2021 10:00:00", "June 14, 2021 13:30:00"]

}

sl_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
         31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58,
         59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
         87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
         112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133,
         134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
         156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177,
         178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199,
         200]

ques = ['ஒரு நாட்டில், ஒரு ஆண்டில் உற்பத்தி செய்யப்பட்ட பண்டங்கள் மற்றும் பணிகளின் மொத்த பண மதிப்பை குறிப்பது எது?',
        'IMF இன்  அக்டோபர் 2016 அறிக்கையின்படி, பின்வரும் எது சரி?\n1. இந்தியாவின் வளர்ச்சி விகிதம் நீடித்ததாகவும் '
        'நிலையானதாகவும் உள்ளது\n2. இந்தியாவானது வளர்ச்சிக்கான வாய்ப்புகளை பெருமளவில் கொண்டிருக்கிறது\n3. இந்திய '
        'பொருளாதாரம் பின்தங்கி இருப்பதற்கான அறிகுறிகளும் காணப்படுகின்றன\n', 'உலகப் பொருளாதாரத்தில், '
                                                                            'வாங்கும் சக்தியின் அடிப்படையில் இந்தியா '
                                                                            'வகிக்கும் இடம் என்ன?\n',
        ' இந்திய நிலவியல் கள ஆய்வு நிறுவனத்தின் தலைமை இடம் எங்குள்ளது?\n', ' நிலக்கரிகளின் வகைகளையும் அவை கொண்டுள்ள '
                                                                           'கரிம அளவுகளையும் பொருத்துக:\ni) '
                                                                           'ஆந்திரசைட் - 1. 40  சதவீதத்திற்கும் '
                                                                           'குறைவு\nii) பிட்டுமினஸ் - 2. 80 முதல் 90 '
                                                                           'சதவீதம்\niii)பழுப்பு நிலக்கரி -  3. 60 '
                                                                           'முதல் 80 சதவீதம்\niv) மரக்கரி  -  4. 40 '
                                                                           'முதல் 60 சதவீதம்\n    ', 'நம் நாட்டின் '
                                                                                                     'கல்வி '
                                                                                                     'கொள்கைகளையும் '
                                                                                                     'திட்டங்களையும் '
                                                                                                     'வகுத்து '
                                                                                                     'நடைமுறைப்படுத்தி  வருவது எது?\n',
        'காந்தியடிகள் இயந்திரங்களை எவ்வாறு வர்ணித்தார்?\n', 'பின்வருவனவற்றுள் எது அம்பேத்கருடைய கூற்று?\n',
        ' ஜே. சி. குமரப்பா பின்வரும் எவற்றின் மதிப்பீடுகளை உள்ளடக்கி கோட்பாடுகளை கொண்டு வந்தார் ?\n',
        ' இந்தியாவில் உற்பத்தி செய்யப்படும் அனல் மின் சக்தியில்  எத்தனை சதவீதத்தை தமிழ்நாடு உற்பத்தி செய்கிறது?\n',
        'தமிழ்நாட்டில் உள்ள முக்கிய அனல்மின் நிலையங்களில் சேராதது எது ?\n',
        'போதுமான காற்றோட்ட வசதி அற்ற இடங்களில் வேலை செய்யும் பஞ்சாலை தொழிலாளர்களுக்கு, பஞ்சு நுண்துகள்களால் ஏற்படும் நோய் எது?\n',
        'யாருடைய வருகைக்குப் பின்னர்\nஇந்தியாவிற்கும் ஐரோப்பாவிற்கும் கடல் வணிகம் ஆரம்பித்தது?\n',
        '1793 இல் நிரந்திர சொத்துரிமை சட்டம் அறிமுகப்படுத்தப்பட்ட பிறகு, ஆங்கில கிழக்கிந்திய கம்பெனி உருவாக்கிய நில வருவாய் முறை எது ?\n',
        'கூற்று: 1992 ஆம் ஆண்டு இந்திய பொருளாதாரத்தில் ஒரு திருப்புமுனையாக அமைந்தது.\nகாரணம்: ஒரு பெரிய பொருளாதார நெருக்கடியை இந்தியா சந்தித்தது. எனவே இந்தியா புதிய பொருளாதாரக் கொள்கைகளை கொண்டு வரவேண்டியிருந்தது\n',
        'ஏற்றுமதி செயலாக்க மண்டல மாதிரிகளின்(Export Processing Zone - EPZ) பயன்பாட்டை உணர்ந்த நாடுகளில் முதன்மையான நாடு எது?\n\n\n\n',
        '"மொத்த நாட்டு மகிழ்ச்சி" என்ற தொடர் 1972ஆம் ஆண்டு பூடான் நாட்டின் நான்காவது மன்னரான____ என்பவரால் உருவாக்கப்பட்டது\n',
        'இந்திய பொருளாதாரத்தின் பலமாகக் கருதப்படுபவை எவை?\n1) கலப்பு பொருளாதாரம்\n2) பொருளாதாரத்தில் வேளாண்மையின் முக்கிய பங்கு\n3) அதிக மக்கள்தொகை\n4) பழமையான தொழில்நுட்பம்\n5)வேகமாக வளரும் பணிகள் துறை\n',
        ' மிக முக்கியமான அடிப்படை மற்றும் கனரக தொழில்கள் எவற்றால் நிர்வகிக்கப்படுகின்றன?\n',
        'இந்தியாவில் காணப்படும் இரும்புத்தாது வளங்களில் அதிகமாக கிடைக்கும் வகை எது ?\n',
        'இரும்புத்தாது படிவையும், அதிலுள்ள இரும்பின் அளவையும் பொருத்துக \ni) மேக்னடைட்  - 1. 62.9%\nii)ஹேமடைட்  - 2.72.4%\niii) கோதைட் - 3.69.9%\niv) லைமனைட் - 4.48.2%\nv) சிடரைட் - 5.55\n',
        'மாநில அரசின் பொறுப்பில் இருந்த கல்வி எந்த ஆண்டு முதல் மத்திய மாநில அரசுகளின் கூட்டுப் பொறுப்பில்  வந்தது?\n',
        'இந்திய கல்விமுறை அடிப்படையில் எத்தனை நிலைகளைக் கொண்டுள்ளது\n',
        '1921இல் “ ஒரு தேசத்தின் அல்லது ஒரு தனியாரின் தார்மீக ஒழுக்க நெறிகளை காயப்படுத்தினால் அந்த பொருளாதார நடவடிக்கை இழுக்கானது; மேலும் அது பாவமானது" என எழுதியவர் யார்?\n',
        'இந்தியாவில் அணுமின் திட்டம் தொடங்கப்பட்ட ஆண்டு எது?\n',
        'இந்தியாவில் உள்ள அணு மின் நிலையங்களில் அதிக உற்பத்தி திறன் கொண்டது எது?\n',
        'வணிக மூலதனக் காலம் எது?\nஇருந்து வரை முதல் வரை\n',
        'இரயத்துவாரி முறை அல்லது சொந்த சாகுபடி முறை முதன் முதலில் எந்த மாநிலத்தில் அறிமுகம் செய்யப்பட்டது?\n',
        '1924 முதல் 1939 வரையிலான காலகட்டத்தில் கீழ்காணும் எந்தத் தொழில் நிறுவனங்கள் பாதுகாப்பு வளையத்தின் கீழ் கொண்டுவரப்பட்டன?\n',
        'LPG (Liberalization, Privatization & Globalization) - க்கு முந்தைய நிலை பற்றிய கருத்துகளில் சரியானவை எவை?\nI) இந்தியாவில் பொருளாதார நடவடிக்கைகளை எளிதாக துவங்க இயலாத அளவுக்கு கட்டுப்பாடுகள் இருந்தன\nII) பொருளாதார வளர்ச்சியில் தனியார் துறைக்கு போதுமான வாய்ப்புகள் வழங்கப்படவில்லை\nIII) அரசு உரிமை கொள்கைகளை சற்றே தளர்த்துவது அவசியமாக இருந்தது\n',
        'தாராளமயமாக்கபடுவதற்கு முன் நாடு முழுவதும் விவசாயிகள் எங்கிருந்து விதைகளை பெற்று வந்தனர்?\n\n',
        '1991ஆம் ஆண்டு எந்த குழுவின் பரிந்துரைப்படி, சட்டரீதியான நீர்மை விகிதம் (Statutory\nLiquidity Ratio SLR)  மற்றும் ரொக்க இருப்பு வீதம்  (Cash Reserve Ratio)  குறைக்கப்பட்டது ?\n',
        'மொத்த நாட்டு மகிழ்ச்சி குறியீடு(GNHI) என்பது பின்வருவம் எவற்றை உள்ளடக்கியது?\n1) நிலைத்த முன்னேற்றம்\n2) மக்களாட்சி\n3)சுற்றுச்சூழல் பாதுகாப்பு\n4)கலாச்சார மேம்பாடு\n5) சிறந்த நிர்வாகம்',
        'இந்தியாவின் மொத்த உள்நாட்டு உற்பத்தியில் பெரும்பங்கு அளிப்பது?', '\nபின்வரும் வாக்கியங்களில் தவறானது எது?\n',
        ' 2011 ஆம் ஆண்டு கணக்கெடுப்பின்படி, மிக அதிக அளவு(9.2%) &  மிகக் குறைந்த அளவு(6.3%) இறப்பு விகிதங்களை கொண்டுள்ள மாநிலங்கள் முறையே எவை?',
        'பிமாரு மாநிலங்கள் எனப்படுபவை?', '2011 மக்கள் தொகை கணக்கீட்டின் படி இந்தியாவின் மக்கள் தொகை அடர்த்தி என்ன?',
        'ஒரு சதுர கிலோ மீட்டருக்கு 17 நபர்கள் என்ற அளவில் மிகக் குறைவான மக்கள் தொகை அடர்த்தியை பெற்றுள்ள மாநிலம் எது ?',
        '2011 ஆம் ஆண்டு கணக்கெடுப்பின்படி, 877 என்ற மிகக்குறைந்த பாலின விகிதத்தை கொண்டுள்ள மாநிலம் எது?\n',
        'இரும்புதாதுக்களில் அதிகம் உள்ளது எது?',
        'நாட்டின் மொத்த இரும்புத்தாது உற்பத்தியில் 25 சதவீதம் உற்பத்தி செய்து முதன்மையான உற்பத்தியாளராக திகழும் மாநிலம் எது?\n',
        'மைக்காவில் தரமான  வகை எது ?\n', 'அதிக மைக்கா படிவுகளை கொண்டுள்ள(41%) மாநிலம் எது?\n\n',
        'பல்கலைக்கழகங்களின் தரம் பின்வரும் எந்த சட்டத்தின்படி அளவிடப்படுகிறது?\n',
        'இந்தியாவில் தற்போது அனைத்து மருத்துவம் நடைமுறைகளும் பின்வரும் இதன் கீழ் உள்ளன?\n',
        'வள்ளுவரின் பொருளாதார கருத்துக்கள் மிகுதியாக  காணப்படுவது ?\n\n',
        'இந்திய அணு மின்சக்தி நிறுவனம்  (The Nuclear Power Corporation of India Limited) எதை தலைமையிடமாகக் கொண்டு இயங்குகிறது?\n',
        'இந்திய தேசிய நீர் மின்சக்தி நிறுவனம் (National Hydroelectric Power Corporation)  எங்கு அமைந்துள்ளது?\n',
        'உலகிலேயே ஒரு பகுதியில் அதிக காற்றாலைகளை கொண்ட பெரிய காற்றாலை பண்ணை எது?\n',
        'பிரிட்டிஷ் துணிமணிகளின்  சந்தையாக இந்தியா விளங்கிய காலம்  எது ?\n',
        'கீழ்காணும்  எந்த ஆண்டின் தொழில் கொள்கை பொதுத் துறைக்கு முக்கியத்துவம் கொடுத்தது?\n',
        'பொருத்துக :\nI) மஞ்சள் புரட்சி - A) பெட்ரோலியம்\nII) நீலப்புரட்சி - B) இறால்\nIII) கருப்புப் புரட்சி - C) மீன்\nIV) இளஞ்சிவப்பு புரட்சி - D) எண்ணெய் வித்துக்கள்\n',
        'பொதுத்துறையில் எஃகு நிறுவனங்களின் இடங்களையும் அவை அமைய உதவி செய்த நாடுகளையும் பொருத்துக\nI) ரூர்கேலா ( ஒடிசா) -  A) ரஷ்ய அரசு\nII) பிலாய் ( ம. பி) - B) இங்கிலாந்து அரசு\nIII) துர்காபூர் ( மே. வ) - C) ஜெர்மனி\nIV) பர்னபூர் ( மே. வ) - D) தனியார்துறை\n',
        'இந்தியாவில் நைட்ரஜனை பயன்படுத்தி தயாரிக்கும்  உரத்தொழிலானது உலகின் எத்தனையாவது பெரிய தொழிலாகும்?\n',
        ' இந்தியா உற்பத்தி செய்யும் பட்டு வகைகள் எவை?\nI)மல்பெரி பட்டு\nII) வெப்பமண்டல டஸ்சர் பட்டு\nIII) ஓக் டஸ்சர் பட்டு\nIV)  பட்டு எரி\nV)  முகா பட்டு\n',
        'பன்னாட்டு பண நிதியத்தின் கணிப்புப்படி(IMF), 2016 இல் இந்தியாவின் உள்நாட்டு மொத்த உற்பத்தியின் அளவு______ பில்லியன் அமெரிக்க டாலராக இருந்தது\n',
        '1991இன் புதிய தொழிற்கொள்கை ஆனது பின்வரும் எம்முறையை முடிவுக்குக் கொண்டுவந்தது?\n',
        'பிரதம மந்திரி பயிர் காப்பீட்டு திட்டம்  (The Pradhan Mantri Fasal Bima)  அறிமுகப்படுத்தப்பட்டது எப்போது?\n',
        'வளர்ந்து கொண்டிருக்கும் பொருளாதார நாடுகளின் பண்புகள் எவை?\n1. தன் வளங்களான நிலம், சுரங்கங்கள், உழைப்பாளர்கள் ஆகியவற்றை முழுமையாகப் பயன்படுத்துதல்\n2. தன் வளங்களை முழுமையாக பயன்படுத்தாமை\n3. அதிக தலா  வருமானம்\n4. குறைந்த தலா வருமானம்\n',
        'IMF இன் அக்டோபர் 2016 அறிக்கையின்படி, உலகின் வலிமையான மற்றும் பெரிய பொருளாதாரங்களின் வரிசையில் இந்தியா வகிக்கும் இடம் என்ன?\n',
        'இந்தியாவில் இரும்பு எஃகு தொழிற்சாலைகள் திட்டமிடல் மற்றும் வளர்ச்சிக்கு முக்கிய பங்காற்றும் அமைப்பு எது?\n',
        'ஒரு நாட்டின் தொழிற்சாலை வளர்ச்சிக்கு மிக இன்றியமையாததாக இருப்பதால்  கருப்புத் தங்கம் என அழைக்கப்படுவது எது?\n',
        ' தமிழ்நாட்டில் இயற்கைவாயு காணப்படும் பகுதி எது?\n',
        'பின்வரும் எதை திருவள்ளுவர் அடிப்படை பொருளாதார நடவடிக்கை என்கிறார்?\n',
        ' திட்டமிடுதல் ஏன் அவசியமானது என்று ஜவஹர்லால் நேரு கருதினார்?\n',
        'அண்ணல் அம்பேத்கர் அவர்கள் 1915இல் கொலம்பியா பல்கலைக்கழகத்தில் முதுகலைப் பட்ட படிப்பிற்காக சமர்ப்பிக்கப்பட்ட ஆய்வுக் கட்டுரை எது?\n',
        'காற்றுவள மதிப்பீடு ஆய்வு மற்றும் சான்றிதழ் அளித்தல் பணிகளைச் செய்யும் தேசிய காற்றாற்றல் நிறுவனம்(National Institute of wind energy) எங்கு உள்ளது?\n',
        'தேசிய செய்திகள் மற்றும் காகித ஆலைகள் நிறுவனம்(NEPA) எங்கு உள்ளது?\n',
        ' இரும்பு மற்றும் எஃகு உற்பத்தி தொழிற்சாலை முதன் முதலில் 1830ல்  தமிழ்நாட்டில் எங்கு அமைக்கப்பட்டது?\n',
        'கீழ்காணும் வினாக்களின் அடிப்படையில் சுதந்திரத்திற்கு முன் மூன்று விதமான நிலவுடைமை முறைகள் இருந்தன. அவற்றில் சேராதது எது? \n1. நிலம் யாருக்கும் சொந்தமானது?\n2. நிலத்தில் யார் அறுவடை செய்வது?\n3. நில வருவாய் அரசுக்கு செலுத்துவதற்கு பொறுப்பானவர்  யார் ?\n\n',
        'தவறான இணை எது?\n\n',
        'இந்தியாவில் முதன் முதலில் நிறுவப்பட்ட பொதுத்துறை நிறுவனமான விஸ்வேஸ்வரையா இரும்பு எஃகு தொழிலகம் எந்த இடத்தில் நிறுவப்பட்டது?\n',
        'பொருத்துக:\nI) சணல் தொழிற்சாலை - A) செராம்பூர் ( மே. வ)\nII) துணி ஆலை - B)குளோஸ்டர் ( கல்கத்தா)\nIII) காகித தொழிற்சாலை - C)ஜாம்ஷெட்பூர்\nIV) இரும்பு தொழிற்சாலை - D) ரேஸ்ரா ( மே. வ)\n',
        'பின்வருவனவற்றுள் கடன் தேவைப்படுகிற ஒரு விவசாயியின் தகுதிக்கேற்ப மிக எளிதாக மற்றும் சரியான நேரத்தில் கடன் வழங்குவதற்கான ஒரு ஏற்பாடு  எது?\n',
        ' 1965ஆம் ஆண்டில் ஆசியாவின் முதல் ஏற்றுமதி செயலாக்க மண்டலத்தை இந்தியா துவங்கிய இடம் எது?\n',
        'இந்தியாவின் மொத்த உள்நாட்டு உற்பத்தியில் வேளாண்மை துறையில் இருந்து கிடைப்பது?\n',
        '2017 ஆம் ஆண்டு அறிக்கையின்படி, இணையதள சேவையை அதிக அளவு பயன்படுத்தும் பயனாளர்களை கொண்டுள்ள  நாடுகளின் வரிசையில் இந்தியா வகிக்கும் இடம் என்ன?\n\n',
        '2011 ஆம் ஆண்டு கணக்கெடுப்பின்படி, 61.8%  எழுத்தறிவு விகிதத்துடன் கடைசி இடம் வகிக்கும் மாநிலம் எது?\n',
        'UNECE (United Nations Economic Commission for Europe)  அறிக்கையின்படி இந்தியா முழுவதிலும் எத்தனை காரட் வைரங்கள் கிடைக்கின்றன ?\n',
        'கூற்று: சில நேரங்களில் புதுப்பிக்கக்கூடிய வளங்களை, வழக்கில் இல்லாத ஆற்றல் எனவும் அழைப்பதுண்டு.\nகாரணம் : இவ்வளங்களைக் கொண்டு முன்காலங்களில் மின்னாற்றல்  உற்பத்தி செய்யப்படவில்லை அல்லது வழக்கத்தில் இல்லை\n',
        'மாங்கனீசு படிவு அதிகம் காணப்படும் (44%) மாநிலம் எது?\n',
        'இந்தியாவிலேயே அதிகமாக நிலக்கரி உற்பத்தி செய்யும் நாடு எது ?\n',
        'இந்தியாவின் மிகப் பழமையான எண்ணெய் வயல் எது?\n', 'திருவள்ளுவர் பரிந்துரை செய்யும் நிதிநிலை அறிக்கை எது ?\n',
        '1923 இல் லண்டன் பொருளாதார பள்ளி பின்வரும் எந்த ஆய்வுக்கட்டுரையை ஏற்று அம்பேத்கருக்கு டிஎஸ்சி பட்டம் வழங்கியது\n',
        'பின்வரும் எப்போராட்டத்தின் போது ஜே.சி.குமரப்பா ஓராண்டிற்கு மேல் சிறையில் அடைக்கப்பட்டார்\n',
        '88) இந்தியாவில் தனிநபர் வருமானம் குறைவிற்கும் தனிநபர் ஊட்டச்சத்து குறைவிற்குமான காரணங்களை  1938 இல் ராவ்   தனது எந்த சிறு புத்தகத்தில் விளக்குகிறார்\n\n',
        'இடைநிற்றல் பிரச்சனைகளை தீர்க்க அரசாங்கத்தினால் கொண்டுவரப்பட்ட திட்டம் எது?\n',
        'இந்திய தொழில்நுட்ப நிறுவனம் முதன் முதலில் எங்கு நிறுவப்பட்டது ?\n',
        'நச்சு சூழலானது, ஒன்றை தொடர்ந்து மற்றொன்று, ஏழை நாடுகளைத் தொடர்ந்து வறுமை நிலையிலேயே வைத்திருக்கும் விதத்தில் செயல்படுவதை குறிப்பதாக கூறுபவர் யார்?\n',
        'தற்சமயம் 900MW உற்பத்தி திறன் கொண்ட ஓத சக்தி நிலையத்தை எங்கு நிறுவுவதற்காக முன்மொழியப்பட்டுள்ளது?\n',
        'ரஷ்யாவின் தொழில்நுட்ப உதவியுடன் நிறுவப்பட்ட இந்துஸ்தான் எஃகு நிறுவனம் எங்கு அமைந்துள்ளது?\n',
        'பாரத கனரக மின்சாதன(BHEL) நிறுவனம் ஆனது பின்வரும் எங்கு தனது கிளையை கொண்டிருக்கவில்லை?\n',
        'கீழ்காணும் எந்த முறையில் கிராம மக்களால் ஆன குழுவினர் நிலச் சொந்தக்காரர்கள் ஆக இருந்து நிர்வாகம் செய்தனர் ?\n',
        'ஒரு நாட்டின் பொருளாதார முன்னேற்றம் குறிப்பாக எதை சார்ந்துள்ளது?\n',
        'இந்தியா தனது முதல் தொழில் கொள்கையை  எந்த ஆண்டு அறிவித்தது ?\n\n',
        'மேற்கு வங்காளத்தில் உள்ள வங்காள இரும்பு தொழில் கம்பெனி எந்த ஆண்டு நிறுவப்பட்டது?\n',
        'எண்ணிக்கை அடிப்படையில் இந்தியாவில் உள்ள பொதுத்துறை வங்கிகள் மற்றும் தனியார் துறை வங்கிகள் முறையே எத்தனை?\n',
        'மனித மேம்பாட்டு குறியீட்டுக்கான கணக்கீடானது மனித வளர்ச்சிக்கான முக்கிய அம்சங்களை புறக்கணித்துள்ளது என்று கூறியவர் யார்?\n',
        'தாராளமயமாக்கல் கொள்கைகள், பூச்சிக்கொல்லி மற்றும் உர மானியத்தை குறைத்து விட்டதால் உரங்களின் விலைகள் எத்தனை சதவீதம் அதிகரித்தன?\n',
        'பின்வரும் எந்த குழுவின் அறிக்கை இறக்குமதிக்கான தீர்வைகளை பெருமளவு குறைக்க பரிந்துரை செய்துள்ளது?\n',
        'நம் நாடு வேகமாக வளர்ந்துவரும் சந்தையாக இருப்பதன் காரணம்?\n1. குறைந்த முதலீடே போதும்\n2.குறைவான இடர்பாட்டு காரணிகள்\n3. அதிகமான வளர்ச்சி சாத்தியங்கள்\n\n',
        'ஜி 20 நாடுகளில் இந்தியா இடம்பெறக் காரணம் என்ன?\n\n',
        'கடந்த நூறு ஆண்டுகளில் இந்திய மக்கள்தொகை எத்தனை மடங்கு அதிகரித்துள்ளது?\n',
        'காலரா,பிளேக் ,இன்ஃப்ளூயன்சா போன்ற கொள்ளை நோய்கள் மற்றும் பஞ்சம் காரணமாக மக்கள் தொகை எதிர்மறையாக குறைந்த கால கட்டம் எது?\n',
        'மக்கள் தொகை பெருக்க வீதம் 1.33%லிருந்து 1.25%ஆக குறைந்ததால்" சிறு பிளவு ஆண்டு" என அழைக்கப்படும் ஆண்டு எது?\n',
        'எந்த மண் காணப்படும் பகுதிகளில் புவியின் மேற்பரப்பில் பாக்சைட் தாது படிவுகளாக பரவிக் காணப்படுகிறது?\n',
        'இந்தியாவில் அமைந்துள்ள எண்ணெய் வயல்களில் மிகப்பெரியது எது?\n', 'செல்வத்தைப் பற்றி வள்ளுவரின் கருதுகோள் எது\n',
        'இந்திய ரிசர்வ் வங்கியானது அம்பேத்கரின் எந்த நூலில் வழங்கப்பட்டுள்ள வழிகாட்டுதலின்படி கருத்தாக்கம் பெற்றது?\n',
        'சுதந்திரத்திற்கு முன்னும் பின்னும் இந்தியாவின் தலைசிறந்த பொருளியல் அறிஞர்களாக DR காட்கில், CN வக்கீல் மற்றும் VKRV ராவ் ஆகியோரைக் குறிப்பிடலாம். இவர்கள் சிறந்த கனவுகளோடும் இந்திய பொருளாதார பிரச்சினைகளை ஆராய்ந்து கொள்கைகளையும் திட்டங்களையும் இந்தியாவின் முன்னேற்றத்திற்காக வழங்கியிருக்கிறார்கள் என்றவர் யார்?\n\n',
        'பல்வேறு  பஞ்சங்களை பற்றி ஆய்வு செய்யும் “ வறுமை மற்றும் பஞ்சம்; உரிமம் மற்றும்  இழப்பு ” பற்றிய ஒரு கட்டுரையை 1981இல் வெளியிட்டவர் யார்?\n',
        'இந்தியாவில் மொத்தம் எத்தனை வேளாண்மை பல்கலைக் கழகங்கள் உள்ளன?\n\n',
        'இந்தியாவில் தற்போது உள்ள தேசிய தொழில்நுட்ப நிறுவனங்கள்(NIT) & இந்திய தகவல் தொழில்நுட்ப நிறுவனங்கள்(IIIT) முறையே எத்தனை?\n',
        '150 KW உற்பத்தித் திறன் கொண்ட அலை சக்தி ஆலை நிறுவப்பட்டுள்ள விழிஞ்சம் என்ற பகுதி எங்கு உள்ளது?\n',
        'உலகளவில் பருத்தி உற்பத்தியில் இந்தியா வகிக்கும் இடம் என்ன ?\n',
        'பின்வருவனவற்றுள் எது முக்கிய நெசவாலை நகரம் அல்ல ?\n', 'தேசிய சணல் வாரியத்தின் தலைமையகம் எங்கு உள்ளது?\n',
        'பிரதான வாகன தொழிற்சாலைகளும் அதனை சார்ந்த தொழிற்சாலைகளும் சுற்றியுள்ள பகுதிகளில் இருப்பதால், ஆசியாவின் டெட்ரோய்ட் என்று அழைக்கப்படும் நகரம் எது?\n\n',
        '1956 தொழிற்கொள்கை தீர்மானம் பின்வரும் யாருடைய வளர்ச்சி மாதிரியின் அடிப்படையில் அமைக்கப்பட்டது?\n\n',
        'உலக அளவில் இந்தியா கச்சா சணல் உற்பத்தியிலும்  சணல் பொருட்கள் தயாரிப்பிலும் எவ்விடத்தில் உள்ளது?\n\n',
        'இந்திய அரசு எந்த ஆண்டு 14 பெரிய வங்கிகளின் தேசிய மயமாக்க முடிவு செய்தது?\nஜூலை\n',
        'பின்வருவனவற்றுள் இந்திய பொருளாதாரத்தின் பண்பு எது?\n',
        '1951 இல் இந்திய ஆண்களில் எத்தனை பேர் எழுத்தறிவு பெற்றவர்களாக இருந்தனர்?\n',
        'இந்தியாவில் ஹேமடைட் தாது அதிகம் கிடைக்கும் மாநிலங்களில் சேராதது எது?\n',
        'கர்நாடகாவில் குல்பர்கா மாவட்டத்தில் ரெய்சூர் பகுதியில் கிடைப்பது ?\n',
        'இந்திய ரயில்வே முதல் Wi-fi வசதியை எங்கு தொடங்கியது?\n',
        'பின்வரும் எப்பண்புகளால், அலுமினியம் ஆனது விமான கட்டுமானங்களிலும், தானியங்கி இயந்திரங்களும் அதிகம் பயன்படுத்தப்படுகிறது ?\n',
        'ஜிப்சம் உற்பத்தியில் 82% பங்களிப்புடன் முதலிடம் வகிக்கும் மாநிலம் எது?\n',
        ' நிலக்கரி அகலாய்வு மற்றும் உற்பத்தி மேம்பாட்டு கொள்கைகளை முடிவு செய்வது எது ?\n',
        'அறக்கட்டளை கோட்பாட்டில் முதலாளித்துவத்திற்கு பங்கு இல்லை எனினும் இந்தியா பின்வரும் எது சார்ந்த அனுபவங்களை பெற்றுள்ளது ?\n\n',
        'வரலாற்று ஆய்வாளர் ராமச்சந்திர குஹா அவர்கள் குமாரப்பாவை எவ்வாறு அழைத்தார் ?\n\n',
        'VKRV ராவ் யாருடைய மாணவராவார் ?\n',
        'ஜே ஆர் டி டாடா மற்றும் மைசூர் மஹாராஜா ஆகியோரின் நிதி உதவியில் பெங்களூருவில் இந்திய அறிவியல் நிறுவனம் நிறுவப்பட்ட ஆண்டு என்ன?\n',
        'இந்திய சுதந்திரத்துக்குப் பிறகு முதன் முதலாக அமைக்கப்பட்டவைகளில் ஒன்றான தேசிய வேதியியல் ஆய்வகம் எங்கு உள்ளது?\n',
        'இந்தியாவின் முதல் எஃகு தொழிற்சாலை எந்த இடத்தில் நிறுவப்பட்டது?\n',
        'இந்தியாவின் மொத்த சர்க்கரை உற்பத்தி அளவில், மூன்றில் ஒரு பங்கு அளவை எந்த மாநிலம் உருவாக்குகிறது?\n',
        'மக்கள் தொகை அம்சங்கள் பற்றி அறிவியல் நெறிப்படி படிக்கும் பிரிவு எது ?\n\n\n\n',
        ' மக்கள் தொகை அதிகரிக்க துவங்கியதால் "பெரும் பிரிவினை ஆண்டு" என அழைக்கப்படும் ஆண்டு எது?\n',
        '2011 ஆம் ஆண்டு கணக்கெடுப்பின்படி, மிக அதிக அளவு பிறப்பு விகிதத்தை (29.5%) கொண்டுள்ள மாநிலம் எது?\n',
        ' உலகளவில் நிலக்கரி உற்பத்தியில் இந்தியா வகிக்கும் இடம் எது?\n\n\n',
        'இருப்புப் பாதையின் நீளத்தின் அடிப்படையில் உலக அளவில் இந்தியா வகிக்கும் இடம்?\n',
        'இந்தியாவிற்கு மதச்சார்பின்மையானது, யாருடைய பங்களிப்பு\n',
        '\nதிட்டமிடுதல் என்பது பின்வரும் எதனோடு தொடர்புடையது',
        'கிராமப் பொருளாதார முன்னேற்ற கொள்கைகளின் முன்னோடியாக அறியப்படுபவர் யார்?\n\n\n\n\n\n\n\n',
        'ராவ் அவர்களின் பின்வரும் எந்த ஆய்வுக்கட்டுரை, வேலைவாய்ப்புத் துறையில் மிகச் சிறந்த ஒன்றாக கருதப்படுகிறது.\n',
        'விடுதலைக்கு முன்னர் நம் நாட்டில் இருந்த ஒரே ஒரு அறிவியல் ஆய்வு நிறுவனம் எது?\n\n',
        'பெரிய அளவிலான இரும்பு எக்கு தொழிற்சாலையான, TISCO ஜாம்ஷெட்பூரில் எந்த ஆண்டு நிறுவப்பட்டது?\n',
        'கீழ்காணும் எந்த இடத்தில் அமைந்துள்ள பொதுத்துறை  எஃகு நிறுவனம் , எந்த ஒரு நாட்டின் உதவியும் இல்லாமல் இந்திய அரசால் உருவாக்கப்பட்டது ?\n',
        'இந்திய மக்கள் தொகை போக்கின் பல்வேறு கூறுகளில் சேராதது எது?\n\n\n\n\n\n\n\n',
        '2011ஆம் ஆண்டு கணக்கெடுப்பின்படி இந்திய மக்களின் ஒட்டுமொத்த எழுத்தறிவு விகிதம் என்ன?\n',
        'இந்தியாவின் மொத்த நிலப்பரப்பில் காடுகள் வகிக்கும் பங்கு என்ன?\n',
        'இந்தியாவில் மேக்னடைட் தாது அதிகமாக கிடைக்கும் பகுதி எது ?\n',
        ' இந்தியாவானது 30 லட்சம் கி.மீ நீளம் கொண்ட சாலைகளை கொண்டு உலகின் எத்தனையாவது பெரிய சாலை போக்குவரத்து கொண்ட நாடாக திகழ்கிறது?\n',
        'பின்வருவனவற்றுள் அம்பேத்கர் எதை வலியுறுத்தவில்லை:\n\n\n\n\n\n',
        'ராவ் அவர்கள் தேசிய அளவிலான எத்தனை ஆராய்ச்சி நிறுவனங்களை உருவாக்கினார்?\n',
        'ஊட்டச்சத்து,மருத்துவம், உடல்நலம் ,வேலைவாய்ப்பு, பஞ்சத்தின் போது வழங்கப்படும் உணவு ஆகியவை___ ஆக மாற வேண்டும் என்று அமர்த்தியா சென் கருதினார்.\n',
        'ஆசிய கிரிக்கெட் கவுன்சிலின் தலைவராக சமீபத்தில் தேர்வு செய்யப்பட்டவர் யார்?\n',
        '72 ஆவது குடியரசு தின விழா அணிவகுப்பில் எந்த மாநிலத்தின் ஊர்தி முதல் பரிசுக்கு தேர்ந்தெடுக்கப்பட்டது?\n',
        'இந்தியா, ஈரான் மற்றும் ஆப்கானிஸ்தான் ஆகிய நாடுகளுக்கு இடையே வணிகத்தை மேம்படுத்தும் நோக்கில் “ சாபஹார் துறைமுகத்தை” மூன்று நாடுகளும் இணைந்து எங்கு கட்டமைத்து வருகின்றனர்?\n',
        'இந்தியாவின் முதல் “ பாலின பூங்கா ” திறக்கப்பட உள்ள மாநிலம் எது?\n',
        'தமிழ்நாடு பாராலிம்பிக் சங்க மாநிலத் தலைவராக தேர்ந்தெடுக்கப்பட்டுள்ளவர் யார்?\n',
        'ஆசியா-பசிபிக் தனிப்பயனாக்கப்பட்ட சுகாதார குறியீட்டில் இந்தியா எவ்விடத்தில் உள்ளது?\n',
        ' இந்தியாவில் முதல் முறையாக "பனிக்குடில் உணவகம்" திறக்கப்பட்டுள்ள மாநிலம்/ யூனியன் பிரதேசம் எது?\n\n',
        'மத்திய அரசின் தொகுப்பிலிருந்து மாநிலங்களுக்கான வரி பகிர்வினை எத்தனை சதவீதம் ஆக வைத்திருக்க 15வது நிதிக்குழு பரிந்துரைத்துள்ளது?\n\n',
        'காணாமல் போன குழந்தைகளை மீட்க"ஆப்ரேஷன் ஸ்மைல்” என்ற திட்டம் எங்கு தொடங்கப்பட்டுள்ளது?\n',
        '2021 ஆம் ஆண்டிற்கான உலக தொழுநோய் தினம் என்று அனுசரிக்கப்பட்டது?\n\n',
        'வலிப்புநோயை முன்னரே கண்டறிந்து எச்சரிக்கை வழங்கும் தலைக்கவசத்தை எந்த மாநிலத்தை சேர்ந்த பேராசிரியர்கள் கண்டறிந்துள்ளனர்?\n',
        '2020 ஆம் ஆண்டிற்கான தமிழக அரசின் இலக்கிய விருதைப் பெற்ற "அலெக்ஸ்  தேவராசு சென்மார்க்"  எந்த நாட்டைச் சேர்ந்தவர்?\n',
        'எந்த மாநிலத்தின் முதலாவது தாவரவியல் பூங்கா “ சிவாலிக்  ஆர்போரேட்டம்” என்ற பெயரில் திறக்கப்பட்டுள்ளது?\n',
        'பெட்ரோல்,டீசல் மற்றும் திரவ பெட்ரோலிய எரிவாயு ஆகியவற்றிற்கு பதிலாக பயன்படுத்தக்கூடிய எரிபொருள் எது?\n',
        'இயற்கை வாழ்வில் அதிகம் காணப்படுவது எது?\n',
        'பெட்ரோலியம் என்ற சொல் “ பெட்ரோ” (பாறை) மற்றும் “ஒலியம்” (எண்ணெய்) என்ற இரு ___ சொல்லிலிருந்து பெறப்பட்டது.\n\n',
        'சிமெண்ட் ,உரங்கள்,சுவர்பட்டிகள், பாரிஸ் சாந்து(plaster of paris) போன்றவற்றின் உற்பத்திற்கு மூலப்பொருள்கள் ஆகவும், மண் வளமூட்டி ஆகவும் பயன்படுவது எது?\n',
        ' 6 - ஆல் வகுபடும் முதல் 40 இயல் எண்களின் கூடுதல் காண்க?\n\n',
        '-3+3+9+15+...20 உறுப்புகள் வரை உள்ள தொடரின் கூடுதல் காண்க ?\n',
        '3/2, 1/2, -1 /2 , -3/2 .... என்ற கூட்டு தொடரின்  பொது விகிதம் காண்க?\n',
        '5+11+17+......+ 95 என்ற கூட்டுத்தொடரின் கூடுதல் காண்க\n',
        '8% வீதம் தனிவட்டி தரும் நிறுவனத்தின் ஒவ்வொரு ஆண்டும் ₹1000 வைப்புத் தொகை செலுத்தப்படுகிறது. எனில் 30 ஆண்டுகளின் முடிவில் கிடைக்கும் மொத்த வட்டியை காண்க ?\n',
        '₹300 க்கும் ₹500 க்கும் இடையே உள்ள 11 ஆல் வகுபடும் அனைத்து இயல் எண்களின் கூட்டல் பலனை காண்க?\n',
        'ஒரு கூட்டுத்தொடரின்  3 - வது உறுப்பு 7  ஆகும். மேலும் அதன் 7 - வது உறுப்பானது 3 - வது  உறுப்பின் மூன்று மடங்கை விட 2 அதிகம் . அத்தொடரின் முதல் 20 உறுப்புகளின் கூட்டல் பலனை காண்க ?\n',
        '1^2- 2^2 + 3^2-4^2 ...... என்ற தொடரின் முதல் 40 உறுப்புகளின்  கூட்டல் பலனை காண்க?\n',
        '6 + 5 1/4 + 4 1/2..... 25 உறுப்புகள் வரையுள்ள கூட்டத்தொடரின் கூட்டல் பலனை காண்க?\n',
        'a=5, n=30, l=121என்ற விவரங்களை கொண்ட கூட்டத்தொடரின் கூடுதல் (Sn) காண்க ?\n\n',
        'கூட்டுத் தொடர் வரிசையில்  38 + 35 + 32+.....+2 என்ற தொடரின் கூட்டல் பலனை காண்க?\n',
        'n-ஆவது  உறுப்பு 3+2n என்றவாறு அமைந்த ஒரு கூட்டுத் தொடர் வரிசையின் முதல் 30 உறுப்புகளின் கூட்டல் பலனை காண்க?\n',
        'கூட்டுத் தொடர் வரிசையில் முதல் 75 மிகை முழுக்களின் கூடுதல் காண்க ?\n',
        'ஒரு பெருக்குத் தொடர் வரிசையில் 4 மற்றும் 7 வது உறுப்புகள் முறையே 54 மற்றும் 1458 எனில் அத்தொடர் வரிசையை காண்க ?\n',
        '1/4, -1/2, 1, -2....என்ற பெருக்குத் தொடர் வரிசையின் 10- ஆவது உறுப்பை காண்க?\n',
        '√2, 1/√2, 1/2√2, .....என்ற பெருக்குத் தொடர் வரிசையின் பொது விகிதம் காண்க?\n',
        '1/2, 1/3, 2/9, 4/27... என்ற பெருக்குத் தொடர் வரிசையின் பொது விகிதம் காண்க?\n',
        'ஒருவர் வருடத்திற்கு தனிவட்டி 14% தரும் முதலீட்டில் ₹25000 முதலீடு செய்தார். எனில் 20 ஆண்டுகளுக்குப் பிறகு முதலீட்டில் உள்ள தொகையை காண்க?\n',
        'ஒருவர் முதல் மாதம் ₹640, 2 ஆம் மாதம் ₹720, 3 ஆம் மாதம் ₹800 ஐ சேமிக்கிறார். அவர் தன்னுடைய சேமிப்பை இதே தொடர் வரிசையில் தொடர்ந்தால் 25வது மாதம் அவர் சேமிக்கும் தொகையை காண்க?\n',
        '1, 7, 13, 19 மற்றும் 100, 95, 90.... ஆகிய கூட்டுத்தொடர் வரிசைகளின் n-வது உறுப்பு சமம் எனில் n- இன் மதிப்பை காண்க?\n',
        ' 13-ஆல் வகுபடும் ஈரிலக்க மிகை முழு எண்ணிக்கையை காண்க ?\n',
        'பின்வரும் கூட்டு தொடர் வரிசையில் உள்ள மொத்த உறுப்புகளை காண்க? 7, 13, 19,.....205\n',
        ' √2, 3√2, 5√2  என்ற கூட்டு தொடர் வரிசையின் 12வது உறுப்பு யாது?\n',
        ' 24, 23 1/4, 22 1/2, 21 3/4, ...என்ற கூட்டு தொடர் வரிசையில் 3 என்பது எத்தனையாவது உறுப்பு ஆகும்?\n',
        'a,b,c என்பன ஒரு பெருக்குத் தொடர் வரிசையில் உள்ளன. எனில் a-b/b-c=?\n']

a = ['A) GNP', 'A) 1 மட்டும்', 'A) ஆறாமிடம்', 'A) கல்கத்தா', 'A)   2    3    4     1', 'A) தேசிய ஆராய்ச்சிக் கழகம்',
     'A) மிகப் பெரிய வரம்', 'A) சமூகங்கள் தங்களுக்குள் வேலைகளை பரிமாறிக் கொள்ளும் வழி இருக்க வேண்டும்',
     'A) பௌத்த மற்றும் காந்திய',
     'A) 3 %', 'A) மேட்டூர் அனல்மின் நிலையம்', 'A) லூகோகார்டியா', 'A) இபன்பதூதா', 'A)ஜமீன்தாரி முறை', 'A) கூற்றும் '
                                                                                                      'காரணமும் சரி; '
                                                                                                      'மேலும் காரணம் '
                                                                                                      'கூற்றுக்கான '
                                                                                                      'சரியான '
                                                                                                      'விளக்கம்',
     'A) அமெரிக்கா', 'A)  ஜிக்மே - டோர்ஜி - வான்சு', 'A) 1, 2 & 4', 'A) பொதுத் துறைகள்', 'A) மேக்னடைட்', 'A) 2    3   '
                                                                                                         ' 4   5    '
                                                                                                         '1',
     'A) 1972', 'A) 4', 'A) ஜவஹர்லால் நேரு', 'A) 1940', 'A) கல்பாக்கம்', 'A) 1658 இல் இருந்து  1713  வரை',
     'A) ஆந்திரா', 'A) பருத்தி நெசவாலைகள்', 'A) I & III', 'A) மத்திய அரசாங்க நிறுவனங்களில் இருந்து', 'A) ராஜ செல்லையா '
                                                                                                     'குழு', 'A) 1, '
                                                                                                             '2, '
                                                                                                             '3 & 5',
     'A) வேளாண்மைத் துறை', 'A) உலகின் புவிப்பரப்பில் இந்தியா 2.4 சதவீத பரப்பை கொண்டுள்ளது', 'A) பீஹார் & ஹரியானா',
     'A) குறைந்த மக்கள் தொகையைக் கொண்டுள்ள மாநிலங்கள்', 'A) 100-க்கும் கீழே', 'A)சிக்கிம்', 'A) பீகார்', 'A)இரும்பு  '
                                                                                                         'கார்போனேட்கள்',
     'A) உத்தரப் பிரதேசம்', 'A)மஸ்கோவைட் ', 'A) ஆந்திரப் பிரதேசம்', 'A) மனிதவள மேம்பாட்டு சட்டம்', 'A)  ஏய்ம்ஸ்(AIIMS)',
     'A)அறத்துப்பால்', 'A) மும்பை', 'A)  ஃபரிதாபாத்', 'A) விதர்பா- விகாஸ்பகுதி', 'A) வணிக மூலதனக் காலம்',
     'A)1948ஆம் ஆண்டு தொழிற்கொள்கை', 'A) I-d, II-c, III-a, IV-b', 'A) I-c, II-a, III-b, IV-d', 'A)முதலாவது',
     'A) I, II, III  மட்டும்', 'A) 2251', 'A) சிவப்பு நாடா முறை', 'A) 14  செப்டம்பர்  2016', 'A) 1 & 3', 'A) 7',
     'A) தேசிய இரும்பு ஆணையம் SNL', 'A) நிலக்கரி', 'A) நெய்பள்ளத்தூர்', 'A) சுய தொழில்', 'A) தற்சார்பு அணுகுமுறைக்கு',
     'A) பழங்கால இந்திய வர்த்தகம்', 'A) சென்னை', 'A) மத்திய பிரதேசம்', 'A) பரங்கிப்பேட்டை', 'A) ஜமீன்தாரி முறை',
     'A) வெண்மை புரட்சி - பால்', 'A) அமராவதி', 'A) I-c, II-a, III-b, IV-d', 'A) கிசான் கிரெடிட் கார்ட்(KCC)',
     'A) நொய்டா', 'A) 7%', 'A) முதலிடம்', 'A)குஜராத்', 'A) 5482  ஆயிரம் காரட்',
     'A) கூற்றும் காரணமும் சரி; காரணம் கூற்றை சரியாக விளக்குகிறது', 'A) மகாராஷ்டிரா', 'A)ஜார்கண்ட்',
     'A) திக்பாய் எண்ணெய் வயல்', 'A)உபரி நிதிநிலை அறிக்கை',
     'A)இந்தியாவில் குறைந்த நிலவுடைமை மற்றும் தீர்வுகள் B)ரூபாயின் பிரச்சனைகள்', 'A) வெள்ளையனே வெளியேறு இயக்கம்',
     'A)இந்திய பொருளியல் வாழ்வில் என்ன தவறு', 'A) சர்வ சிக்ஷ அபியான்(SSA)', 'A)கான்பூர்', 'A) கிறிஸ் மோர்கன்',
     'A) காம்பே வளைகுடா', 'A) பிலாய் - சத்தீஸ்கர்', 'A) ஹரித்வார் & போபால்', 'A)ஜமீன்தாரி முறை', 'A) உலகமயமாக்கலை',
     'A) ஏப்ரல்  6,1948 இல்', 'A) 1870ஆம் ஆண்டு', 'A) 22 & 27', 'A) மஹபூப் உல் ஹக்', 'A) 50 %', 'A)ராஜா  செல்லையா குழு',
     'A) 1ம் 3ம் மட்டும்', 'A) பாரம்பரியம்', 'A) 6  மடங்கு', 'A) 1911 - 1921', 'A) 1941', 'A) செம்மண்',
     'A) மும்பை ஹய் எண்ணை வயல்', 'A) செல்வம் வாழ்வதற்கான வழியே அன்றி அதுவே இலக்கல்ல\xa0B)செல்வமே எல்லாம் தலை',
     'A) இந்தியாவில் குறைந்த நிலவுடைமை மற்றும் தீர்வுகள்', 'A) பிஆர் அம்பேத்கர்', 'A) ஜகதீஷ் மேவானி', 'A) 37',
     'A) 42 & 33', 'A) புதுவைக்கு அருகில்', 'A)முதலாவது', 'A)சென்னை', 'A) மும்பை', 'A) சென்னை', 'A) ஜவஹர்லால் நேரு',
     'A) முதலிடம்', 'A) ஜூலை  19, 1968 இல்', 'A) வேலை வாய்ப்புள்ள வளர்ச்சி', 'A) மூன்றில் ஒருவர்',
     'A)சத்தீஸ்கர் & ஒடிசா', 'A)வெள்ளி', 'A) சென்னை', 'A) அதிக வெப்ப மற்றும் மின்சார கடத்து திறன்', 'A) ஜம்மு-காஷ்மீர்',
     'A)இந்திய சுரங்க அமைச்சகம்', 'A)சூதாட்ட முதலாளித்துவம் மற்றும் பெருமைமிகு முதலாளித்துவம்', 'A)பச்சை காந்தி',
     'A)மகலநோபிஸ்', 'A) 1889', 'A) புதுடில்லி', 'A) ஜார்கண்ட்', 'A) உத்தரப் பிரதேசம்', 'A)மக்களியல்', 'A) 1951',
     'A) மகாராஷ்டிரா', 'A) முதலிடம்', 'A) முதல் இடம்', 'A) மகாத்மா காந்தியடிகள்', 'A)வேளாண் வளர்ச்சி', 'A) VKRV ராவ்',
     'A) உபரி வேலைவாய்ப்பும்,பொருளாதார முன்னேற்றமும்', 'A) இந்திய அறிவியல் நிறுவனம் பெங்களூரு', 'A) 1905 இல்',
     'A) துர்காபூர்', 'A) மக்கள் தொகை அளவு', 'A) 65.5 %', 'A) 21.02%', 'A) கர்நாடகாவில் உள்ள மேற்கு கடற்கரை',
     'A) முதலாவது', 'A) அனைத்து முக்கியமான தொழில்களையும் நாட்டுடைமை ஆக்க வேண்டும்', 'A) 2', 'A) அரசின் கடமைகளாக',
     'A) சஞ்சய் பங்கர்', 'A) உத்தரப் பிரதேசம்', 'A)ஈரான்', 'A) உத்திரப்பிரதேசம்', 'A) கிருஷ்ணமாச்சாரி', 'A) 5',
     'A) லடாக்', 'A) 45', 'A) ஹைதராபாத்', 'A) ஜனவரி31', 'A) கேரளா', 'A) இந்தியா', 'A)உத்தரகாண்ட்',
     'A) அமுக்கப்பட்ட இயற்கை எரிவாயு(CNG)', 'A) கார்பன்-டை-ஆக்சைடு', 'A) பிரெஞ்சு', 'A) சுண்ணாம்புக்கல்', 'A) 4920',
     'A) 1020', 'A) 3/2', 'A) 600', 'A) ₹32500', 'A) 6327', 'A) 740', 'A) -640', 'A) 75', 'A) 1530', 'A) 180',
     'A) 1020', 'A) 2550', 'A) 2, 4, 8', 'A) -2^4', 'A) 1/4', 'A) 1/3', 'A) ₹90000', 'A) ₹2056', 'A) 10', 'A) 5',
     'A) 32', 'A) 21√2', 'A) 26-ஆவது', 'A) a/b']

b = ['B) GDP', 'B) 1ம் 2ம் மட்டும்',
     'B) மூன்றாம் இடம்', 'B)பம்பாய்', 'B)   2    3     1    4', 'B) மத்திய திறன் மேம்பாட்டு அமைச்சகம்',
     'B)மிகப்பெரிய பாவம்', 'B) தனி நம்பர்கள் தங்களுக்குள் வேலைகளை பரிமாறிக் கொள்ளும் வழி இருக்க வேண்டும்',
     'B) கிறிஸ்துவ மற்றும் காந்திய', 'B) 5 %',
     'B) நெய்வேலி & தூத்துக்குடி அனல்மின் நிலையங்கள் C)எண்ணூர் அனல்மின் நிலையம்', 'B) பைசின்னோசிஸ்', 'B)மார்க்கோபோலோ',
     'B) மகல்வாரி முறை', 'B) கூற்று சரி; ஆனால் காரணம் தவறு', 'B) பிரிட்டன்', 'B) ஜிக்மே - கேசர் - நாம்கியெல்',
     'B) 1, 3 & 5', 'B) தனியார் துறைகள்', 'B)ஹேமடைட் ', 'B) 2    3    1   5    4', 'B) 1974', 'B) 6',
     'B)டாக்டர் அம்பேத்கர்', 'B) 1944', 'B) காக்கரபாரா', 'B) 1757 ல் இருந்து  1813 வரை', 'B)தமிழ்நாடு',
     'B) சனல், தீப்பெட்டி', 'B) I & II', 'B) மாநில அரசாங்க நிறுவனங்களில் இருந்து', 'B) நரசிம்மம் குழு',
     'B) 2, 3, 4 & 5', 'B) தொழில் துறை', 'B) உலக வருவாயில் இந்தியா 1.2% வருவாயை பெற்றுள்ளது', 'B) குஜராத் & மேகாலயா',
     'B) மித  மக்கள் தொகையைக் கொண்டுள்ள மாநிலங்கள்', 'B) 117', 'B)மணிப்பூர்', 'B)ஒடிசா', 'B) இரும்பு நைட்ரேட்டுகள்',
     'B) மேகாலயா', 'B) அப்ராக்', 'B)ராஜஸ்தான்', 'B) தேசிய கல்வி கொள்கை சட்டம்',
     'B) மனித வள மேம்பாட்டு அமைச்சகம் (MRHD)', 'B)பொருட்பால்', 'B)கல்கத்தா', 'B)அகமதாபாத்',
     'B) காக்கிநாடா - செலுகஸ்பகுதி', 'B) தொழில் மூலதன காலம்', 'B) 1956ஆம் ஆண்டு தொழிற்கொள்கை',
     'B) I-b, II-a, III-c, IV-d', 'B) I-b, II-a, III-c, IV-d', 'B)இரண்டாவது', 'B) I, III, IV மட்டும்', 'B) 1522',
     'B) பச்சை நாடா முறை', 'B) 15 ஆகஸ்ட் 2015', 'B) 2 & 3', 'B) 12', 'B) தேசிய இரும்பு எஃகு ஆணையம் SANL',
     'B) கச்சா எண்ணெய்', 'B) மங்கமடம்', 'B) சிறு தொழில்', 'B) பிறசார்பு அணுகுமுறைக்கு', 'B) இந்தியாவில் சாதி',
     'B) மும்பை', 'B) மேற்கு வங்கம்', 'B) லால்குடி', 'B) மகல்வாரி முறை', 'B) தங்கப்புரட்சி- பழங்கள் (ஆப்பிள்)',
     'B) அகமதாபாத்', 'B) I-b, II-a, III-c, IV-d', 'B) கிசான் டெபிட் கார்ட் (KDC)', 'B)சூரத்  ', 'B) 12%',
     'B)இரண்டாமிடம்', 'B) சிக்கிம்', 'B) 4582 ஆயிரம் காரட்', 'B) கூற்று சரி; காரணம் தவறு', 'B) மத்திய பிரதேசம்',
     'B)தமிழ்நாடு', 'B)  நாகர்காட்டியா எண்ணெய் வயல்', 'B) சேமிப்பு நிதிநிலை அறிக்கை', 'B)ரூபாயின் பிரச்சனைகள்',
     'B) கேதா சத்தியாகிரக போராட்டம்', 'B) உலகப் பொருளியல் வாழ்வில் என்ன தவறு', 'B) ராஷ்ட்ரிய மத்யமிக்  சிக்ஷ',
     'B)சென்னை', 'B) ஆடம்ஸ்மித்', 'B) மன்னார் வளைகுடா', 'B) ரூர்கேலா - ஒடிசா', 'B) ஹைதராபாத் ,ஜம்மு & பெங்களூரு',
     'B) மகல்வாரி முறை', 'B) நகர்மயமாதல்', 'B) மே  6,1948 இல்', 'B) 1907 ஆம் ஆண்டு', 'B) 27 & 22',
     'B)அமர்த்தியா குமார் சென்', 'B) 150 %', 'B) நீதிபதி கே. ராஜன் குழு', 'B) 2ம் 3ம்  மட்டும்',
     'B)சீரிய பொருளாதார வளர்ச்சி', 'B) 5  மடங்கு', 'B) 1921 - 1931', 'B) 1931', 'B)கரிசல் மண்',
     'B) குஜராத் கடற்கரை எண்ணெய் வயல்', 'B)செல்வமே எல்லாம் தலை', 'B) ரூபாயின் பிரச்சனைகள்; தோற்றமும் அதன் தீர்வுகளும்',
     'B) ஜவஹர்லால் நேரு', 'B)அமர்த்தியாசென் குமார்', 'B) 47', 'B) 24 & 18', 'B)திருவனந்தபுரத்திற்கு அருகில் ',
     'B)மூன்றாவது', 'B)திருநெல்வேலி', 'B)சென்னை', 'B)மும்பை', 'B) ஜே.சி. குமரப்பா', 'B) இரண்டாமிடம்',
     'B) ஜூலை  19, 1969 இல்', 'B) வேலைவாய்ப்பற்ற  வளர்ச்சி', 'B)பன்னிரண்டில் ஒருவர்', 'B) ஜார்கண்ட் & கோவா',
     'B)இரும்பு', 'B)ஹைதராபாத்', 'B) குறைந்த வெப்ப மற்றும் மின்சார கடத்து திறன்', 'B)ராஜஸ்தான்',
     'B) இந்திய கனிமவளங்கள் அமைச்சகம்', 'B)சூதாட்ட முதலாளித்துவம் மற்றும் குறை கூறும்  முதலாளித்துவம்',
     'B)கருப்பு காந்தி', 'B)ஜே. எம். கின்ஸ்', 'B) 1909', 'B)ஹைதராபாத்', 'B)கர்நாடகா', 'B)மகாராஷ்டிரா',
     'B)மக்கள் தொகையியல்', 'B) 1981', 'B) பஞ்சாப்', 'B) இரண்டாமிடம்', 'B)3ஆம் இடம்', 'B) இந்திரா காந்தி',
     'B) ஒட்டுமொத்த வளர்ச்சி', 'B) அமர்த்தியா சென் குமார்', 'B) முழு வேலை வாய்ப்பும்,பொருளாதார முன்னேற்றமும்',
     'B)டாட்டா  அணு ஆராய்ச்சிக் கழகம் புதுடெல்லி', 'B) 1906 இல்', 'B)விசாகப்பட்டினம்', 'B) மகிழ்ச்சி குறியீடு',
     'B) 82 %', 'B) 31.02%', 'B) ஒடிசாவில் உள்ள கிழக்கு கடற்கரை', 'B)இரண்டாவது', 'B) நிலத்தை  அரசு நிர்வகிக்க வேண்டும்',
     'B) 3', 'B)பன்னாட்டு நீதியாக', 'B)சௌரவ் கங்குலி', 'B)நாகாலாந்து', 'B)இந்தியா', 'B)மேற்கு வங்கம்', 'B)வெங்கடேசன்',
     'B) 8', 'B)ஜம்மு-காஷ்மீர்', 'B) 48', 'B)பெங்களூரு', 'B)  பிப்ரவரி 1', 'B) தமிழ்நாடு', 'B) பிரான்சு', 'B)ராஜஸ்தான்',
     'B) விடுவிக்கப்பட்ட இயற்கை எரிவாயு(CNG)', 'B)நைட்ரஜன்', 'B) இலத்தீன்', 'B)நிலக்கரி', 'B) 4910', 'B) 1040',
     'B) 1/2', 'B) 800', 'B) ₹34800', 'B) 7227', 'B) 840', 'B) -720', 'B) -75', 'B) 1660', 'B) 220', 'B) 1120',
     'B) 2650', 'B) 2, 6, 18', 'B) -2^5', 'B) 1/2', 'B) 2/3', 'B) ₹92000', 'B) ₹2360', 'B) 15', 'B) 7', 'B) 34',
     'B) 23√2', 'B) 27-ஆவது', 'B) b/c']

c = ['C) NNP', 'C) 1ம் 3ம் மட்டும்', 'C) எட்டாமிடம்', 'C)அலகாபாத்', 'C)   2    1     4    3',
     'C)மத்திய மனிதவள மேம்பாட்டுத்துறை அமைச்சகம்', 'C)பரிசுத்தம் கெடுக்கும் செயல்',
     'C) சமூகங்கள் தங்களுக்குள் வேலைகளை பரிமாறிக் கொள்ளும் வழி இருக்கக்கூடாது', 'C) இந்துத்வ மற்றும் காந்திய', 'C) 7 %',
     'C)எண்ணூர் அனல்மின் நிலையம்', 'C)  வெரிகோஸ்', 'C) வாஸ்கோடகாமா', 'C) இரயத்துவாரி முறை',
     'C)கூற்று தவறு; ஆனால் காரணம் சரி', 'C)இந்தியா', 'C) ஜிக்மே - டோர்ஜி - நாம்கியெல்', 'C) 2, 3 & 5',
     'C) பணிகள் துறைகள்', 'C)லிமோநைட்', 'C) 2    1    5   4    3', 'C) 1975', 'C) 8', 'C)காந்தியடிகள்', 'C) 1946',
     'C) கைகா', 'C) 1813 இல் இருந்து  1858 வரை', 'C)மகாராஷ்டிரம்', 'C) இரும்பு , எஃகு', 'C) II & III',
     'C) தனியார் நிறுவனங்களில் இருந்து', 'C) சற்குணம் குழு', 'C) 1, 2 & 5', 'C) பணிகள் துறை',
     'C) உலக மக்கள் தொகையில் இந்தியா 16.5 சதவீதத்தைக் கொண்டுள்ளது', 'C) ஒரிசா & மேற்கு வங்கம்',
     'C)அதிக மக்கள் தொகையைக் கொண்டுள்ள மாநிலங்கள்', 'C) 325', 'C) நாகாலாந்து', 'C)ஹரியானா', 'C) இரும்பு ஆக்சைடுகள்',
     'C) மத்திய பிரதேசம்', 'C) ப்ளோகோபைட்', 'C)ஒடிசா', 'C) பல்கலைக்கழக மானியக்குழு சட்டம்', 'C) ஆயுஸ் (AYUSH)',
     'C)இன்பத்துப்பால்', 'C)சென்னை', 'C) ஹைதராபாத்', 'C) வல்லம் - படுகை பகுதி', 'C) நிதி மூலதன காலம்',
     'C) 1977ஆம் ஆண்டு தொழிற்கொள்கை', 'C) I-a, II-c, III-b, IV-d', 'C) I-a, II-c, III-b, IV-d', 'C)மூன்றாவது',
     'C) II, III, IV, V மட்டும்', 'C) 2552', 'C) நீல நாடா முறை', 'C) 18  பிப்ரவரி 2016', 'C) 1 & 4', 'C) 14',
     'C) இந்திய இரும்பு ஆணையம் SIL', 'C) இயற்கை எரிவாயு', 'C) A & B', 'C) நெசவு', 'C) பொதுத்துறை அணுகுமுறைக்கு',
     'C) ரூபாயின் பிரச்சனை', 'C) கொல்கத்தா', 'C) பீகார்', 'C) துவாக்குடி', 'C) ரயத்துவாரி முறை',
     'C) வெள்ளி புரட்சி-  முட்டை', 'C) பத்ராவதி', 'C) I-a, II-c, III-b, IV-d', 'C) கிசான் ஹோல்டர் கார்ட்(KHC)',
     'C)ஃபால்டா', 'C) 17%', 'C)மூன்றாமிடம்', 'C)பீகார்', 'C) 8452  ஆயிரம் காரட்', 'C) கூற்று தவறு; காரணம் சரி',
     'C)ஒடிசா', 'C) சத்தீஸ்கர்', 'C)  ருத்ரசாகர் - லாவா எண்ணெய் வயல்', 'C) சம நிதிநிலை அறிக்கை',
     'C) பிரிட்டிஷ் இந்தியாவில் மாகாண நிதிகளின் மதிப்பீடு', 'C) உப்பு சத்தியாக்கிரகம்',
     'C) ஆசிய பொருளியல் வாழ்வில் என்ன தவறு', 'C)அபியான்(RMSA) சமக்ர சிக்ஷ அபியான்', 'C)மும்பை', 'C)லயன்ஸ் ராபின்ஸ்',
     'C) சுந்தரவன பகுதி', 'C) துர்காபூர் - மேற்குவங்கம்', 'C) ஜான்சி & திருச்சி', 'C) ரயத்துவாரி முறை',
     'C)தொழில்மயமாதல்', 'C) ஜூன் 6,1948 இல்', 'C) 1897 ஆம் ஆண்டு', 'C) 32 & 27', 'C) பிஸ்வஜித்குஹா', 'C) 200 %',
     'C)சற்குணம் குழு', 'C) 1ம் 2ம்  மட்டும்', 'C)விரைவான பொருளாதார வளர்ச்சி', 'C) 4  மடங்கு', 'C) 1931 - 1941',
     'C) 1961', 'C)சரளை மண்', 'C) அங்கலேஷ்வர் வயல்', 'C) செல்வமே வாழ்வதற்கான வழியும் இலக்கும் ஆகும்',
     'C) பிரிட்டிஷ் இந்தியாவில் மாகாண நிதிகளின் மதிப்பீடு', 'C)  பிஆர்  பிரம்மானந்தா', 'C)மன்மோகன் சிங்', 'C) 57',
     'C) 31 & 23', 'C)டமானுக்கு அருகில்', 'C)ஆறாவது', 'C)விருதுநகர்', 'C) கொல்கத்தா', 'C)கொல்கத்தா',
     'C)எம்.எஸ் .சுவாமிநாதன்', 'C) மூன்றாமிடம்', 'C) ஜூலை  19, 1970 இல்', 'C)மித  வேலைவாய்ப்புள்ள வளர்ச்சி',
     'C)ஆறில் ஒருவர்', 'C)கர்நாடகா', 'C) தாமிரம்', 'C) பெங்களூரு', 'C)குறைந்த எடை மற்றும் கடினத்தன்மை', 'C) ஒடிசா',
     'C) இந்திய நிலக்கரி அமைச்சகம்', 'C)பெருமைமிகு முதலாளித்துவம் மற்றும் குறை கூறும் முதலாளித்துவம்', 'C)நீல காந்தி',
     'C)ஆடம்ஸ்மித்', 'C) 1919', 'C)புனே', 'C)மகாராஷ்டிரம்', 'C)ஜார்கண்ட்', 'C) மக்கள் தொகை புள்ளியியல்', 'C) 1931',
     'C)தமிழ்நாடு', 'C) மூன்றாமிடம்', 'C) 6ஆம் இடம்', 'C)அண்ணல் அம்பேத்கர்', 'C)தொழில்மயமாதலோடு', 'C) கே.பி.பட்டோடி',
     'C) வேலைவாய்ப்பின்மையும், பொருளாதார சிக்கலும்', 'C) இந்திய தொழில்நுட்பக் கழகம் சென்னை', 'C) 1907 இல்', 'C)பொகாரோ',
     'C)வளர்ச்சி வீதம்', 'C) 74.04 %', 'C) 25.62%', 'C) குஜராத்தில் உள்ள மேற்கு கடற்கரை', 'C) மூன்றாவது',
     'C) கூட்டு வேளாண்மை நடத்தப்படவேண்டும்', 'C) 4', 'C) சலுகைகளாக', 'C) ராகுல் திராவிட்', 'C)கேரளா', 'C) வங்கதேசம்',
     'C) கேரளா', 'C) கார்த்திகேயன்', 'C) 10', 'C) திரிபுரா', 'C) 46', 'C)சென்னை', 'C) பிப்ரவரி  2', 'C)கர்நாடகா',
     'C) கனடா', 'C)மேகாலயா', 'C) அமுக்கப்பட்ட செயற்கை எரிவாயு(CNG)', 'C) மீத்தேன் & அல்கலைன்', 'C) கிரேக்கம்',
     'C) ஜிப்சம்', 'C) 5000', 'C) 1050', 'C) -1', 'C) 1000', 'C) ₹36400', 'C) 8427', 'C) 920', 'C) -820', 'C) 80',
     'C) 1890', 'C) 240', 'C) 1220', 'C) 2750', 'C) 2, 8,16', 'C) -2^6', 'C) 3/4', 'C) 2/5', 'C) ₹95000', 'C) ₹2560',
     'C) 20', 'C) 9', 'C) 36', 'C) 25√2', 'C) 28-ஆவது', 'C) a/c']

d = ['D) தலா வருமானம்', 'D) அனைத்தும்', 'D) ஐந்தாமிடம்', 'D)அகமதாபாத்', 'D)   4    3     2    1',
     'D)மாநில மனிதவள மேம்பாட்டுத்துறை அமைச்சகம்', 'D)நிலத்தின் ஜீவாத்மாவை அழித்தல்',
     'D) தனி நம்பர்கள் தங்களுக்குள் வேலைகளை பரிமாறிக் கொள்ளும் வழிஇருக்கக்கூடாது', 'D) சுதேச மற்றும் காந்திய', 'D) 9 %',
     'D)கல்பாக்கம் அனல்மின்நிலையம்', 'D) ரெஸ்பிட்டேரியா ', 'D) கொலம்பஸ்', 'D) இவை எதுவும் இல்லை',
     'D) கூற்றும் காரணமும் தவறு', 'D) ரஷ்யா', 'D) ஜிக்மே -சிங்யே- வான்சுக்', 'D) 1, 2 & 5', 'D) இவை அனைத்தும்',
     'D) கோதைட்', 'D) 4    5    2   3    1', 'D) 1976', 'D) 5', 'D) ஜே.சி.குமரப்பா', 'D) 1948', 'D) கூடங்குளம்',
     'D) 1858 முதல்  1901 வரை', 'D) பஞ்சாப்', 'D) இவை அனைத்தும்', 'D)மேற்கண்ட அனைத்தும்',
     'D)கூட்டுறவு நிறுவனங்களில் இருந்து', 'D) சந்தானம் குழு', 'D) 1, 3, 4 & 5', 'D) கூட்டுறவுத் துறை', 'D) ஏதுமில்லை',
     'D) நாகாலாந்து & மணிப்பூர்', 'D) மிகக்குறைந்த மக்கள் தொகையைக் கொண்டுள்ள மாநிலங்கள்', 'D) 382',
     'D)அருணாச்சலப் பிரதேசம்', 'D)அருணாச்சல பிரதேசம்', 'D) இரும்பு குளோரைடுகள்', 'D) ஜார்கண்ட்', 'D) பையோடைட்',
     'D)ஜார்கண்ட்', 'D)ஏதும் இல்லை', 'D) யுஜிசி (UGC)', 'D)இவை அனைத்தும்', 'D)பெங்களூரு', 'D)செகந்திராபாத்',
     'D) முப்பந்தல் - பெருங்குடி பகுதி', 'D)  இவை அனைத்தும்', 'D) 1991ஆம் ஆண்டு தொழிற்கொள்கை',
     'D) I-c, II-a, III-b, IV-d', 'D) I-c, II-a, III-d, IV-b', 'D)நான்காவது', 'D) இவை அனைத்தும்', 'D) 1552',
     'D) ஊதா நாடா முறை', 'D) 22 டிசம்பர்  2015', 'D) 2 & 4', 'D) 5', 'D) இந்திய இரும்பு எஃகு ஆணையம் SAIL',
     'D) மின்சாரம்', 'D) ஏதுமில்லை', 'D) வேளாண்மை', 'D) ஒருங்கிணைந்த அணுகுமுறைக்கு',
     'D) இந்தியாவின் தேசிய பங்கீடு பற்றிய வரலாறு மற்றும் பகுப்பாய்வு ஆய்வறிக்கை', 'D) டெல்லி', 'D) ஒடிசா',
     'D) பொன் மலை', 'D) வாரிசுரிமை முறை', 'D)வட்ட  புரட்சி - வெங்காயம்', 'D) கான்பூர்', 'D) I-d, II-b, III-a, IV-c',
     'D)  கிசான் கிருபா கார்ட்(KKC)', 'D) காண்ட்லா', 'D) 21%', 'D) நான்காமிடம்', 'D) உத்தரபிரதேசம்',
     'D) 2458 ஆயிரம் காரட்', 'D) கூற்றும் காரணமும் தவறு', 'D)ஆந்திரா', 'D)மேற்கு வங்கம்', 'D) பேஸ்ஸைம்  எண்ணெய் வயல்',
     'D)குறை பற்றாக்குறை நிதிநிலை அறிக்கை', 'D) ஒப்படைப்பு வரவுசெலவுத்திட்டம்', 'D)ஒத்துழையாமை இயக்கம்',
     'D) சுதந்திர பொருளியல் வாழ்வில் என்ன தவறு', 'D)இவை அனைத்தும்', 'D) கரக்பூர்', 'D)  ராகனர் நர்ஸ்',
     'D)கட்ச் வளைகுடா', 'D) சேலம் - தமிழ்நாடு', 'D) தூத்துக்குடி & ராய்கர்', 'D) இவை எதுவும் இல்லை', 'D) நாகரிகமாதல்',
     'D) ஜூலை  6,1948இல்', 'D) 1901 ஆம் ஆண்டு', 'D) 27 & 32', 'D) இவர்கள் யாரும் அல்ல', 'D) 300 %', 'D) சந்தானம் குழு',
     'D) 1, 2 & 3', 'D) இவை அனைத்தும்', 'D) 3  மடங்கு', 'D) 1941 - 1951', 'D) 1951', 'D) உவர் மண்',
     'D) காம்பே - லூனி பகுதிகளில் உள்ள வயல்கள்', 'D) செல்வம் இல்லார்க்கு இவ்வுலகம் இல்லை',
     'D) ஒப்படைப்பு வரவு செலவு திட்டம்', 'D) ஜே சி குமரப்பா', 'D) மஹலநோபிஸ்', 'D) 67', 'D) 40 & 26',
     'D) மாகேவிற்கு  அருகில்', 'D)எட்டாவது', 'D)நாகப்பட்டினம்', 'D)டெல்லி', 'D)லக்னோ', 'D) மஹலநோபிஸ்', 'D) நான்காமிடம்',
     'D) ஜூலை  19, 1971 இல்', 'D)சராசரி வேலை வாய்ப்புள்ள வளர்ச்சி', 'D)நான்கில் ஒருவர்', 'D)கேரளா & மேகாலயா', 'D)வைரம்',
     'D)மும்பை', 'D)அதிக எடை மற்றும் குறைந்த கடினத்தன்மை', 'D)இமாச்சல பிரதேசம்',
     'D) இந்திய கனிம வள மேம்பாட்டு அமைச்சகம்', 'D)  இவை அனைத்தும்', 'D)பழுப்பு காந்தி', 'D) சாமுவெல்சன்', 'D) 1925',
     'D)பம்பாய்', 'D)மத்தியப் பிரதேசம்', 'D)மத்திய பிரதேசம்', 'D) மக்கள் தொகை கணக்கீட்டியல்', 'D) 1921',
     'D) உத்திரப்பிரதேசம்', 'D) நான்காமிடம்', 'D) 4ஆம் இடம்', 'D) ஜவஹர்லால் நேரு', 'D)உலகமயமாக்கல்', 'D)ஜே.சி.குமரப்பா',
     'D) பன்னாட்டு உதவியும்,பொருளாதார முன்னேற்றமும்', 'D) தேசிய இயற்பியல் ஆய்வுக்கூடம் புதுடில்லி', 'D) 1908 இல்',
     'D) சேலம்', 'D)பிறப்பு மற்றும் இறப்பு விகிதம்', 'D) 78.36 %', 'D) 35.62%', 'D) இவை அனைத்தும்', 'D) நான்காவது',
     'D) காப்பீட்டு வணிகத்தை தனியார் செய்ய வேண்டும்', 'D) 5', 'D) உரிமைகளாக', 'D)ஜெய் ஷா', 'D) சிக்கிம்',
     'D)ஆப்கானிஸ்தான்', 'D)கர்நாடகா', 'D) சந்திரசேகர்', 'D) 12', 'D)நாகாலாந்து', 'D) 42', 'D)மும்பை', 'D)  பிப்ரவரி  3',
     'D)தெலுங்கானா', 'D) இலங்கை', 'D) நாகாலாந்து', 'D) விடுவிக்கப்பட்ட செயற்கை எரிவாயு(CNG)', 'D)நைட்ரஜன் சல்பைடு',
     'D) பாரசீகம்', 'D)பொட்டாஷ் டோலமைட்', 'D) 5012', 'D) 1080', 'D) -1/2', 'D) 1200', 'D) ₹37200', 'D) 9527', 'D) 1120',
     'D) -960', 'D) -80', 'D) 1990', 'D) 260', 'D) 1320', 'D) 2850', 'D) 2, 16, 32', 'D) -2^7', 'D) 2/3', 'D) 3/7',
     'D) ₹98000', 'D) ₹2880', 'D) 25', 'D) 11', 'D) 38', 'D) 27√ 2', 'D) 29-ஆவது', 'D) c/b']

correct_answer = ['B) GDP', 'D) அனைத்தும்', 'B) மூன்றாம் இடம்', 'A) கல்கத்தா', 'A)   2    3    4     1',
                  'C)மத்திய மனிதவள மேம்பாட்டுத்துறை அமைச்சகம்', 'B)மிகப்பெரிய பாவம்',
                  'B) தனி நம்பர்கள் தங்களுக்குள் வேலைகளை பரிமாறிக் கொள்ளும் வழி இருக்க வேண்டும்',
                  'B) கிறிஸ்துவ மற்றும் காந்திய', 'B) 5 %', 'D)கல்பாக்கம் அனல்மின்நிலையம்', 'B) பைசின்னோசிஸ்',
                  'C) வாஸ்கோடகாமா', 'A)ஜமீன்தாரி முறை', 'C)கூற்று தவறு; ஆனால் காரணம் சரி', 'C)இந்தியா',
                  'D) ஜிக்மே -சிங்யே- வான்சுக்', 'D) 1, 2 & 5', 'A) பொதுத் துறைகள்', 'B)ஹேமடைட் ',
                  'B) 2    3    1   5    4', 'D) 1976', 'B) 6', 'C)காந்தியடிகள்', 'A) 1940', 'D) கூடங்குளம்',
                  'B) 1757 ல் இருந்து  1813 வரை', 'B)தமிழ்நாடு', 'D) இவை அனைத்தும்', 'D)மேற்கண்ட அனைத்தும்',
                  'B) மாநில அரசாங்க நிறுவனங்களில் இருந்து', 'B) நரசிம்மம் குழு', 'D) 1, 3, 4 & 5', 'C) பணிகள் துறை',
                  'C) உலக மக்கள் தொகையில் இந்தியா 16.5 சதவீதத்தைக் கொண்டுள்ளது', 'C) ஒரிசா & மேற்கு வங்கம்',
                  'C)அதிக மக்கள் தொகையைக் கொண்டுள்ள மாநிலங்கள்', 'D) 382', 'D)அருணாச்சலப் பிரதேசம்', 'C)ஹரியானா',
                  'C) இரும்பு ஆக்சைடுகள்', 'D) ஜார்கண்ட்', 'B) அப்ராக்', 'A) ஆந்திரப் பிரதேசம்',
                  'C) பல்கலைக்கழக மானியக்குழு சட்டம்', 'C) ஆயுஸ் (AYUSH)', 'B)பொருட்பால்', 'A) மும்பை',
                  'A)  ஃபரிதாபாத்', 'D) முப்பந்தல் - பெருங்குடி பகுதி', 'B) தொழில் மூலதன காலம்',
                  'B) 1956ஆம் ஆண்டு தொழிற்கொள்கை', 'A) I-d, II-c, III-a, IV-b', 'A) I-c, II-a, III-b, IV-d',
                  'C)மூன்றாவது', 'D) இவை அனைத்தும்', 'A) 2251', 'A) சிவப்பு நாடா முறை', 'C) 18  பிப்ரவரி 2016',
                  'D) 2 & 4', 'A) 7', 'D) இந்திய இரும்பு எஃகு ஆணையம் SAIL', 'A) நிலக்கரி', 'C) A & B', 'D) வேளாண்மை',
                  'D) ஒருங்கிணைந்த அணுகுமுறைக்கு', 'A) பழங்கால இந்திய வர்த்தகம்', 'A) சென்னை', 'A) மத்திய பிரதேசம்',
                  'A) பரங்கிப்பேட்டை', 'D) வாரிசுரிமை முறை', 'D)வட்ட  புரட்சி - வெங்காயம்', 'C) பத்ராவதி',
                  'D) I-d, II-b, III-a, IV-c', 'A) கிசான் கிரெடிட் கார்ட்(KCC)', 'D) காண்ட்லா', 'C) 17%',
                  'B)இரண்டாமிடம்', 'C)பீகார்', 'B) 4582 ஆயிரம் காரட்',
                  'A) கூற்றும் காரணமும் சரி; காரணம் கூற்றை சரியாக விளக்குகிறது', 'C)ஒடிசா', 'A)ஜார்கண்ட்',
                  'A) திக்பாய் எண்ணெய் வயல்', 'C) சம நிதிநிலை அறிக்கை', 'B)ரூபாயின் பிரச்சனைகள்',
                  'A) வெள்ளையனே வெளியேறு இயக்கம்', 'A)இந்திய பொருளியல் வாழ்வில் என்ன தவறு', 'D)இவை அனைத்தும்',
                  'D) கரக்பூர்', 'D)  ராகனர் நர்ஸ்', 'D)கட்ச் வளைகுடா', 'A) பிலாய் - சத்தீஸ்கர்',
                  'D) தூத்துக்குடி & ராய்கர்', 'B) மகல்வாரி முறை', 'C)தொழில்மயமாதல்', 'A) ஏப்ரல்  6,1948 இல்',
                  'A) 1870ஆம் ஆண்டு', 'B) 27 & 22', 'C) பிஸ்வஜித்குஹா', 'D) 300 %', 'A)ராஜா  செல்லையா குழு',
                  'D) 1, 2 & 3', 'C)விரைவான பொருளாதார வளர்ச்சி', 'C) 4  மடங்கு', 'A) 1911 - 1921', 'D) 1951',
                  'C)சரளை மண்', 'A) மும்பை ஹய் எண்ணை வயல்', 'A) செல்வம் வாழ்வதற்கான வழியே அன்றி அதுவே',
                  'B) ரூபாயின் பிரச்சனைகள்; தோற்றமும் அதன் தீர்வுகளும்', 'C)  பிஆர்  பிரம்மானந்தா',
                  'B)அமர்த்தியாசென் குமார்', 'D) 67', 'C) 31 & 23', 'B)திருவனந்தபுரத்திற்கு அருகில் ', 'B)மூன்றாவது',
                  'D)நாகப்பட்டினம்', 'C) கொல்கத்தா', 'A) சென்னை', 'D) மஹலநோபிஸ்', 'A) முதலிடம்',
                  'B) ஜூலை  19, 1969 இல்', 'B) வேலைவாய்ப்பற்ற  வளர்ச்சி', 'D)நான்கில் ஒருவர்', 'D)கேரளா & மேகாலயா',
                  'D)வைரம்', 'C) பெங்களூரு', 'C)குறைந்த எடை மற்றும் கடினத்தன்மை', 'B)ராஜஸ்தான்',
                  'C) இந்திய நிலக்கரி அமைச்சகம்', 'B)சூதாட்ட முதலாளித்துவம் மற்றும் குறை கூறும்  முதலாளித்துவம்',
                  'A)பச்சை காந்தி', 'B)ஜே. எம். கின்ஸ்', 'B) 1909', 'C)புனே', 'A) ஜார்கண்ட்', 'B)மகாராஷ்டிரா',
                  'B)மக்கள் தொகையியல்', 'D) 1921', 'D) உத்திரப்பிரதேசம்', 'C) மூன்றாமிடம்', 'D) 4ஆம் இடம்',
                  'D) ஜவஹர்லால் நேரு', 'C)தொழில்மயமாதலோடு', 'D)ஜே.சி.குமரப்பா',
                  'B) முழு வேலை வாய்ப்பும்,பொருளாதார முன்னேற்றமும்', 'A) இந்திய அறிவியல் நிறுவனம் பெங்களூரு',
                  'C) 1907 இல்', 'D) சேலம்', 'B) மகிழ்ச்சி குறியீடு', 'C) 74.04 %', 'A) 21.02%',
                  'A) கர்நாடகாவில் உள்ள மேற்கு கடற்கரை', 'A) முதலாவது', 'D) காப்பீட்டு வணிகத்தை தனியார் செய்ய வேண்டும்',
                  'B) 3', 'D) உரிமைகளாக', 'D)ஜெய் ஷா', 'A) உத்தரப் பிரதேசம்', 'A)ஈரான்', 'C) கேரளா', 'D) சந்திரசேகர்',
                  'C) 10', 'B)ஜம்மு-காஷ்மீர்', 'D) 42', 'C)சென்னை', 'A) ஜனவரி31', 'A) கேரளா', 'B) பிரான்சு',
                  'A)உத்தரகாண்ட்', 'A) அமுக்கப்பட்ட இயற்கை எரிவாயு(CNG)', 'C) மீத்தேன் & அல்கலைன்', 'B) இலத்தீன்',
                  'C) ஜிப்சம்', 'A) 4920', 'D) 1080', 'C) -1', 'B) 800', 'D) ₹37200', 'B) 7227', 'A) 740',
                  'C) -820', 'B) -75', 'C) 1890', 'D) 260', 'A) 1020', 'D) 2850', 'B) 2, 6, 18', 'D) -2^7',
                  'B) 1/2', 'B) 2/3', 'C) ₹95000', 'C) ₹2560', 'A) 10', 'B) 7', 'B) 34', 'B) 23√2', 'D) 29-ஆவது',
                  'A) a/b']

report15 = pandas.read_csv('report15.csv')


@app.route("/", methods=["GET", "POST"])
def home():
    warning = request.args.get("warn")

    if current_user.is_authenticated:
        completed = Test15.query.filter_by(examinee_id=current_user.user_id).first()

        if request.args.get("fee"):
            name = request.args.get("name")
            bending = request.args.get("bending")
            logged_in = request.args.get("logged_in")

            return render_template("index.html", fee=True, name=name, bending=bending, logged_in=logged_in,
                                   completed=completed)

        else:
            if completed:
                completed = Test15.query.filter_by(examinee_id=current_user.user_id).first()
                return render_template("index.html", warning=warning, completed=completed)

            else:
                return render_template("index.html", warning=warning)

    else:
        return render_template("index.html", warning=warning)


@app.route("/register", methods=['GET', 'POST'])
def register():
    form = RegisterForm()
    errors = []

    if form.validate_on_submit():
        hash_and_salted_password = generate_password_hash(
            request.form.get('password'),
            method='pbkdf2:sha256',
            salt_length=8
        )

        new_user = User(
            email=request.form.get('email'),
            username=request.form.get('name'),
            password=hash_and_salted_password,
        )

        if User.query.filter_by(email=request.form.get('email').lower()).first():
            return redirect(url_for('login', msg="You've already been registered. Please Login!"))

        elif User.query.filter_by(username=request.form.get('name')).first():
            errors.append('The username has already been taken')
            return render_template("register.html", errors=errors, form=form)

        else:
            errors.clear()

            if request.form.get('email') in verified_emails:

                db.session.add(new_user)
                db.session.commit()

                login_user(new_user)

                # redirect to the home page with fee details.
                return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                        bending=student_mails[request.form.get('email')][1]))

            else:
                return redirect(url_for('home', warn=True))

    return render_template("register.html", form=form)


@app.route("/login", methods=['GET', 'POST'])
def login():
    form = LoginForm()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        password = request.form.get('password')

        # Find user by email entered.
        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, password):
            login_user(user)
            errors.clear()

            # checking the user's payment details
            # redirect to the home page with fee details.
            return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                    bending=student_mails[request.form.get('email')][1]))

        else:
            errors.append('Incorrect Password! Try Again')
            return render_template("login.html", errors=errors, form=form)

    msg = request.args.get("msg")
    return render_template("login.html", form=form, errors=errors, msg=msg)


@app.route("/exam", methods=["GET", "POST"])
def exam():
    if current_user.is_authenticated:
        opentime = exam_sites[request.args.get("test_no")][0]
        closetime = exam_sites[request.args.get("test_no")][1]

        attended = Test15.query.filter_by(examinee_id=current_user.user_id).first()

        if attended is None:
            return render_template("exam.html", opentime=json.dumps(opentime), closetime=json.dumps(closetime),
                                   sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d, correct_answer=correct_answer,
                                   answers=[])
        else:
            return redirect(url_for("home", warn="You have already committed this exam. Check the results instead."))

    else:
        return render_template('login.html', msg="You need to sign to continue this process!")


@app.route('/evaluate', methods=["GET", "POST"])
def evaluate():

    test_no = request.args.get("test_no")
    answers = []
    final_result = []
    marks = 0

    for i in range(0, 200):
        user_answer = request.form[f'answers{i}']

        if user_answer is None:
            answers.append("None")

        else:
            answers.append(user_answer)

    for j in range(len(correct_answer)):

        if answers[j] == correct_answer[j]:
            marks += 1
            final_result.append("Correct")

        else:
            final_result.append("Wrong")

    # return f"{final_result, answers, correct_answer}"

    st_answers = '#||#'.join(answers)
    f_result = "#||#".join(final_result)

    actual_time = datetime.datetime.now()
    s_time = actual_time.strftime('%Y-%m-%d %H:%M:%S.%f')

    new_examinee = test_no(
        test_author=current_user,
        user_answers=st_answers,
        marks=marks,
        final_result=f_result,
        date=s_time[:-7],
    )

    db.session.add(new_examinee)
    db.session.commit()

    if current_user.email in report15.keys():
        report15.loc[1, current_user.email] = marks
        report15.loc[2, current_user.email] = s_time[:-7]
        report15.to_csv("report15.csv", index=False)

    return redirect(url_for('home', warn="You have successfully completed the exam. Click results to see results."))


@app.route("/result", methods=["GET", "POST"])
def result():
    test_no = request.args.get("test_no")

    attended_student = test_no.query.filter_by(examinee_id=current_user.user_id).first()

    answers = attended_student.user_answers.split('#||#')
    final_result = attended_student.final_result.split('#||#')
    marks = attended_student.marks
    time = attended_student.date

    return render_template("results.html", answers=answers, marks=marks, sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d,
                           correct_answer=correct_answer, final_result=final_result, time=time)


@app.route("/dashboard")
def dashboard():
    all_record = Test15.query.all()

    nmarks = []
    ntime = []

    for record in all_record:
        nmarks.append(record.marks)
        ntime.append(record.date)

    student_names = [i for i in report15.values[0][1:]]
    student_marks = [j for j in report15.values[1][1:]]
    student_time = [l for l in report15.values[2][1:]]

    return render_template("dashboard.html", marks=student_marks, names=student_names, times=student_time,
                           nmarks=nmarks, ntime=ntime)


@app.route("/change_details", methods=["GET", "POST"])
def change_password():
    form = ChangeDetails()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        old_password = request.form.get('old_password')
        new_password = request.form.get('new_password')

        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, old_password):

            if User.query.filter_by(email=email).first():
                old = User.query.filter_by(email=email).first()
                pass_to_update = User.query.get(old.user_id)

                hash_and_salted_password = generate_password_hash(
                    new_password,
                    method='pbkdf2:sha256',
                    salt_length=8
                )

                pass_to_update.password = hash_and_salted_password

                db.session.commit()

                logout_user()
                return redirect(url_for('login', msg="Your password has been changed successfully. "
                                                     "Please Login with your new password."))

        else:
            errors.append("Please check your password.")
            return render_template("change_details.html", form=form, errors=errors)

    return render_template("change_details.html", form=form, errors=errors)


@app.route('/logout')
@login_required
def logout():
    logout_user()
    return redirect(url_for('home'))


@app.route("/admission", methods=["GET", "POST"])
def new_admission():
    form = AdmissionForm()

    if form.validate_on_submit():
        new_member = Admission(
            name=form.name.data,
            mobile_number=form.number.data,
            email=form.email.data,
        )

        db.session.add(new_member)
        db.session.commit()

        verification_code = random.randint(2000, 10000)

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=request.form.get('email'),
                                msg=f"Subject:WELCOME TO SENA CAREER INSTITUTE\n\nWelcome {request.form.get('name')}!"
                                    f" Happy to see you with us. Thanks for supporting us! Keep rocking! "
                                    f"Here is our Educators' number: 8610642720".encode('utf-8'))

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=MY_EMAIL,
                                msg=f"Subject:NEW ADMISSION\n\n{request.form.get('name')} has made an "
                                    f"admission sign up on Sena site Here is details {request.form.get('name')},"
                                    f" {request.form.get('number')}, {request.form.get('email')}!")

        return redirect(url_for('home'))

    return render_template("register.html", form=form, admission=True)


if __name__ == '__main__':
    app.run(debug=True)
