import datetime
import random
import smtplib
import pandas
from flask import Flask, render_template, redirect, url_for, flash, request, abort
from flask_bootstrap import Bootstrap
from flask_ckeditor import CKEditor
from werkzeug.security import generate_password_hash, check_password_hash
from flask_sqlalchemy import SQLAlchemy
from flask_login import UserMixin, login_user, LoginManager, login_required, current_user, logout_user
from flask_wtf import FlaskForm
from sqlalchemy.orm import relationship
from wtforms import StringField, SubmitField, PasswordField
from wtforms.fields.html5 import EmailField
from wtforms.validators import DataRequired
from functools import wraps
import os
import json

app = Flask(__name__)
app.config['SECRET_KEY'] = os.environ.get("SECRET_KEY")
ckeditor = CKEditor(app)
Bootstrap(app)

app.config['SQLALCHEMY_DATABASE_URI'] = os.environ.get("DATABASE_URL", "sqlite:///sena-base.db")
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
db = SQLAlchemy(app)

admin = False
login_manager = LoginManager()
login_manager.init_app(app)

MY_EMAIL = os.environ.get("MY_EMAIL")
SENA_EMAIL = 'sivagangainagarajan@gmail.com'
MY_PASSWORD = os.environ.get("MY_PASSWORD")


@login_manager.user_loader
def load_user(user_id):
    return User.query.get(int(user_id))


def admin_only(f):
    @wraps(f)
    def decorated_function(*args, **kwargs):
        # If id is not 1 then return abort with 403 error
        if current_user.user_id != 1:
            return abort(403)
        # Otherwise continue with the route function
        return f(*args, **kwargs)

    return decorated_function


class User(UserMixin, db.Model):
    __tablename__ = "User"
    user_id = db.Column(db.Integer, primary_key=True)
    email = db.Column(db.String(100), unique=True)
    password = db.Column(db.String(100))
    username = db.Column(db.String(100))
    test = relationship("Test15", back_populates="test_author")
    test16 = relationship("Test16", back_populates="test_author")
    test17 = relationship("Test17", back_populates="test_author")
    test18 = relationship("Test18", back_populates="test_author")

    def get_id(self):
        return self.user_id


class Test15(db.Model):
    __tablename__ = "Test_15"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test")
    marks = db.Column(db.Integer)
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test16(db.Model):
    __tablename__ = "Test_16"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test16")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test17(db.Model):
    __tablename__ = "Test_17"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test17")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test18(db.Model):
    __tablename__ = "Test_18"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test18")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Admission(db.Model):
    __tablename__ = "New_Admission"
    user_id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(100))
    mobile_number = db.Column(db.Integer)
    email = db.Column(db.String(100), unique=True)


db.create_all()
db.session.commit()


class RegisterForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Register')


class LoginForm(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Login')


class AdmissionForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    number = StringField("Phone*", validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    submit = SubmitField('Submit')


class ChangeDetails(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    old_password = PasswordField('Old Password*', validators=[DataRequired()])
    new_password = PasswordField('New Password*', validators=[DataRequired()])
    submit = SubmitField('Submit')


student_mails = {
    "mgopalakrishnan075@gmail.com": ["Gopal", 2000],
    "nivir6558@gmail.com": ["Nivetha", 7000],
    "jaya26jj@gmail.com": ["Christy", 5000],
    "srjamuna1003@gmail.com": ["jamuna", 7000],
    "satheshpandian1997@gmail.com": ["Satheshpandian", 4000],
    "lakshmiraja412@gmail.com": ["Rajalaskhmi", 5000],
    "tamilarasanbe9597@gmail.com": ["Anitha", 1000],
    "rajeshkannan6341@gmail.com": ["Rajesh kannan", 3000],
    "jaishreeramgp@gmail.com": ["Yogapriya", 3000],
    "irudhayasubiksha2001@gmail.com": ["Subiksha", 0],
    "abinayaabi257@gmail.com": ["Abi", 1000],
    "shanthirasu1991@gmail.com": ["Shanthi", 0],
    "pradee1296@gmail.com": ["Pradeepa", 5000],
    "jeniferj0204@gmail.com": ["Janifer", 7000],
    "krish47457@gmail.com": ["Krishna", 0],
    "naveenaryan440@gmail.com": ["Naveen", 0],
    "veerasurya250899@gmail.com": ["Suriya", 3000],
    "amin2svg@gmail.com": ["Amin", 3000],
    "jjprincy06@gmail.com": ["Jeba Josepin Princy", 0],
    "jancybetsia20@gmail.com": ["Jancy", 0],
    "cottonpanju9@gmail.com": ["Panju", 2000],
    "rameswariv1999@gmail.com": ["Rameshwari", 2000],
    "vimaladharmar2002@gmail.com": ["Vimala", 1000],
    "devahi1993@gmail.com": ["Devahi", 0],
    "sarojiniganesan96@gmail.com": ["Sarojini", 0],
    "gangadha91@gmail.com": ["Gangadharan", 0],
    "krishnannk498@gmail.com": ["Kamatchi", 0],
    "indhuindhumathi141@gmail.com": ["Indhumathi", 4000],
    "jamespurysh@gmail.com": ["Purushothaman", 0],
    "sivagangainagarajan@gmail.com": ["Nagarajan", 0],
    "matheshsethu22@gmail.com": ["Mathesh", 4000],
    "nagarajnkarthika@gmail.com": ["Karthika", 2000],
    "keviraj482@gmail.com": ["Yogesh", 2000],
    "christyjeslina98@gmail.com": ["Christy", 3500]
}

verified_emails = [mail.strip() for mail in student_mails.keys()]

exam_sites = {

    "15": ["June 14, 2021 10:00:00", "June 14, 2021 13:30:00"],
    "16": ["June 21, 2021 10:00:00", "June 21, 2021 13:30:00"],
    "17": ["June 28, 2021 10:00:00", "June 28, 2021 22:30:00"],
    "18": ["July 05, 2021 07:00:00", "July 05, 2021 22:30:00"], #time

}

sl_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
         31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58,
         59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
         87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
         112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133,
         134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
         156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177,
         178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199,
         200]

ques = ['பின்வருவனவற்றுள் காந்தியடிகள் உறுப்பினராக இருந்த சங்கம் எது?',
        '______இல் ஒரு பங்கு இடங்களை முஸ்லிம்களுக்கு ஒதுக்க வேண்டும் என்று அனைத்து கட்சி மாநாட்டில் ஜின்னா கோரினார்', 'உச்சநீதிமன்றம் முதன்முதலாக கல்கத்தாவிலுள்ள_______ கோட்டையில் நிறுவப்பட்டது ', 'மக்கள் முன்னிலையில், மக்கள் மொழியிலேயே பிரச்சனையை விசாரித்து, விரைவான நீதியை வழங்க அமைக்கப்பட்ட நீதிமன்றம் எது ?', 'இந்தியாவில் இருந்த மாகாணங்களில், வரையறுக்கப்பட்ட அதிகாரங்களுடன், மக்கள் பிரதிநிதிகளைக் கொண்ட சட்டமன்றங்களை  நிறுவ பரிந்துரைத்தது எது ?', '“உங்கள் மாவட்டங்களுக்கு செல்லுங்கள். கதர், இந்து-முஸ்லீம் ஒற்றுமை, தீண்டாமை ஒழிப்பு ஆகியன பற்றிய செய்திகளை பரப்புங்கள். இளைஞர்களை ஒன்று திரட்டி அவர்களை சுயராஜ்யத்தின் உண்மையான வீரர்களாக உருமாற்றங்கள்”. என்று காங்கிரசாருக்கு அறிவுறுத்தியவர் யார்?', '" நீதிமன்றமானது, அந்த நேரத்தில் நடைமுறையிலிருக்கும் சட்டத்தின்படி, நிற்கிறது. அனைவரின் மீதும் பரிவு, நன்மதிப்பு கொண்டுள்ளது. எனினும் அது யாருடனும் அணி சேருவது இல்லை"- எனக் கூறியவர் யார்?', 'பின்வரும் எந்நீதிமன்றத்திற்கு நீதித்துறை சீராய்வு அதிகாரம் வழங்கப்படவில்லை?', 'பத்தொன்பதாம் நூற்றாண்டின் கடைசியில்_______ செயற்கைச் சாயங்களால், இன்டிகோ எனப்படும் நீலச்சாயம் சந்தையில் விற்கப்படுவது குறைந்தது.', ' 1918ஆம் ஆண்டு ஆகஸ்ட் மாதம் எங்கு நடந்த இந்திய தேசிய காங்கிரசின் சிறப்பு அமர்வில் மாண்டேகு செம்ஸ்போர்டு திட்டம் பற்றி விவாதிக்கப்பட்டது?', 'ஒத்துழையாமை இயக்கம் திரும்பப் பெறப்பட்ட உடன், காங்கிரஸ் இரு பிரிவுகளாகப் பிரிந்தது?', 'எந்த நிகழ்விற்குப் பிறகு, ஆர்வலர்களும் மக்களும் அகிம்சை போராட்டம் குறித்த பயிற்சியை மேற்கொள்ள வேண்டும் என்று காந்தி அடிகள் உணர்ந்தார்?', 'முதல் இந்திய தலைமை நீதிபதி யார்?', ' அரசமைப்பின்படி, பின்வரும் எதன்மீது மறுஆய்வு செய்து தீர்ப்பு வழங்கும் அதிகாரம் உயர்நீதிமன்றங்களுக்கும்  உச்சநீதிமன்றத்திற்கும் வழங்கப்பட்டுள்ளது?', 'காந்தியடிகள் தென்னாப்பிரிக்காவிற்கு செல்ல காரணம் என்ன?', 'மாண்டேகு செம்ஸ்போர்டு சீர்திருத்தங்கள் எவ்வாறு அழைக்கப்பட்டது?', 'காங்கிரஸ் உறுப்பினர்கள் கதர்  உடுப்பதை கட்டாயமாக்கியவர் யார்?', 'அரசாங்கத்தின் மூன்று உறுப்புகளில் சேராதது எது?', 'பின்வரும் எச்சட்டம், செல்லாது என நீதிமன்றத்தால் நீக்கப்பட்டது?', 'டர்பனில் இருந்து பிரிட்டோரியாவுக்கு ரயில் பயணம் மேற்கொண்ட போது எந்த ரயில்நிலையத்தில் முதல்வகுப்புப் பெட்டியில் இருந்து காந்தியடிகள் வலுக்கட்டாயமாக வெளியேற்றப்பட்டார் ?', 'எட்வின் மாண்டேகு வகித்த பதவி என்ன?', 'கதர் உடுத்தும் நோக்கம் காரணமாக காங்கிரசால்/காந்தியடிகளால் உருவாக்கப்பட்ட அமைப்பு எது?', 'சட்டங்களுக்கு விளக்கம் அளிப்பதையும், அரசமைப்பை பாதுகாப்பதையும் பணியாக கொண்டிருப்பது எது?', ' நாடு முழுவதும் ஒரே மாதிரியான விதிகளை அமல்படுத்துவது சரியல்ல என்று கூறும் அரசமைப்பு உறுப்பு எது?', 'பின்வரும் எப்புத்தகத்தால் காந்தியடிகள் பெரும்தாக்கத்திற்கு உள்ளானார் ?', 'மாண்டேகு செம்ஸ்போர்டு சீர்திருத்தத்தின் மூலம் அறிமுகப்படுத்தப்பட்டது எது?', ' தேர்தலில் போட்டியிட்டு மாண்டேகு செம்ஸ்போர்டு சீர்திருத்தத்தின் படி அமைக்கப்பட்ட சட்டமன்றங்களுக்குள் நுழைய விரும்பாதோர் யார் ?', 'நீதித்துறையானது \n1.தனிமனித உரிமைகள், முன்னுரிமைகள் ஆகியவற்றின் மீது அரசு மற்றும் தனி மனிதர்களால் மேற்கொள்ளப்படும் மீறல்களில் இருந்து பாதுகாப்பு அளிப்பதை  உறுதிப்படுத்துகிறது 2.கூட்டாட்சியின் பாதுகாவலனாகவும், மத்திய மாநில அரசாங்கங்களுக்கு இடையே எழும் அதிகார வரம்பு கருத்துவேறுபாடுகளுக்கு தீர்வு காணும் அமைப்பாகவும் உள்ளது', ' 24.04.1973-க்குப் பின்னர் அரசமைப்பின் எந்தப் பட்டியலில் சேர்க்கப்பட்டுள்ள சட்டங்கள் தொடர்பாக மறு சீராய்வு கோர முடியாது என்று உச்ச நீதிமன்றம் தீர்ப்பு வழங்கியுள்ளது?', 'பின்வரும் கூற்றுக்களை ஆராய்க :\n1.இந்திய மற்றும் மேற்கத்திய சிந்தனையாளர்களின் கலவையாக காந்தியடிகளின் சிந்தனைகள் உருவாகின.\n2. மேற்கத்திய சிந்தனையாளர்களால் பெரிதும் ஈர்க்கப்பட்டதால் மேற்கத்திய நாகரீகம் மற்றும் தொழில்மயமாக்கல் ஆகியவற்றை காந்தி ஆதரித்தார் ', 'மாண்டேகு செம்ஸ்போர்டு திட்டத்தைப் பற்றிய பின்வரும் கூற்றுகளை ஆராய்க:\n 1.சட்டம் ஒழுங்கு, நிதி ஆகிய துறைகள் இந்திய பிரதிநிதிகளுக்கு மாற்றப்பட்டது \n2.சுகாதாரம், கல்வி, உள்ளாட்சி போன்ற துறைகள் ஆங்கிலேயருக்கு ஒதுக்கீடு செய்யப்பட்டு அவைகள் அனைத்தும் ஆளுநரின் நேரடி கட்டுப்பாட்டின் கீழ் வந்தன ', 'எந்தக் குறிக்கோளை அடையாமல் சுயராஜ்யத்தை அடைய முடியாது என காந்தியடிகள் உறுதியாக நம்பினார் ?', ' _____ & _____ நீதித்துறையை உருவாக்குவது ஒரு நாகரீக அரசு செயல்படுவதற்கு முன் நிபந்தனையாகும்.', 'பின்வரும் வாக்கியங்களில் சரியானது எது?\n 1.நீதிமன்ற மறுசீராய்வு என்பது அரசியல் சம்பந்தமாக எழும் பிரச்சினைகளுக்கு மட்டுமே ஆகும்\n 2.நீதிமன்ற மறுசீராய்வை  சட்டம் குறித்த வினாக்களுக்கு செயல்படுத்தமுடியாது', 'ரஸ்கின் அவர்களால் பெரிதும் ஈர்க்கப்பட்ட காந்தியடிகள்  ஃபீனிக்ஸ் குடியிருப்பை  நிறுவிய ஆண்டு என்ன?', 'பின்வரும் கூற்றுகளை ஆராய்க :\n1. ஒதுக்கீடு செய்யப்பட்ட துறைகளுக்கு பொறுப்பேற்றவர்கள் சட்டப்பேரவைகளுக்கு கடமைப்பட்டவர்கள் இல்லை 2.மாற்றப்பட்ட துறைகளுக்கு பொறுப்பேற்ற அமைச்சர்கள் சட்டப்பேரவைகளுக்கு கடமைப்பட்டவர்கள் ஆவர்', 'பின்வரும் வாக்கியங்களில் சரியானது எது?', 'தமிழில் பண்டைய இலக்கியங்களில் உலகின் 60க்கும் மேற்பட்ட மொழிகளில் மொழியாக்கம் செய்யப்பட்ட இலக்கியம் எது?', 'பின்வரும் கூற்றுகளில் சரியானது எது?\n 1.உச்சநீதிமன்றத்திற்கு தானாகவே எந்த ஒரு சட்டத்தையும் மறுசீராய்வுக்கு உட்படுத்த அதிகாரம் உள்ளது \n2.ஒரு குறிப்பிட்ட விதி அல்லது சட்டம் ஆகியவற்றை எதிர்த்து வரும் வழக்கில் மட்டுமே உச்சநீதிமன்றத்தால் மறுசீராய்வு அதிகாரத்தை பயன்படுத்த முடியும் ', 'காந்தியடிகள் டால்ஸ்டாய் பண்ணையை நிறுவிய ஆண்டு என்ன?', 'ஒத்துழையாமை இயக்கத்திற்கு பிறகு, சித்தரஞ்சன் தாஸ், மோதிலால் நேரு ஆகியோர் விரும்பியது எதை ?', 'வகுப்புவாத அரசியலில் ஈடுபட்ட இந்துக்கள் மற்றும் முஸ்லிம்களின் இதயங்களை ஈர்க்கும் வகையில் காந்தியடிகள் 21 நாட்கள் உண்ணாவிரதம் மேற்கொண்ட ஆண்டு எது?', 'திருக்குறளை ஆழமாக கற்பதற்கு வழிவகுத்த நீதிமன்றம் எது?', 'பொதுமக்கள் நலன் கருதி எந்த ஒரு தனிநபரும் நீதிமன்றத்தை நாடி மனு அளிக்க முடியும். இது எவ்வாறு அழைக்கப்படுகிறது?', ' தென்னாப்பிரிக்காவில் ஒப்பந்த தொழிலாளர்கள் மீது விதிக்கப்பட்ட தலைவரி எந்த ஒப்பந்தத்தின்படி ரத்து செய்யப்பட்டது?', 'சுரேந்திரநாத் பானர்ஜி தலைமையிலான மிதவாத/தாராளக் கொள்கை உடைய அரசியல் தலைவர்களின் குழு, எப்பெயரில் தனது சொந்த கட்சியைத் தொடங்க காங்கிரசிற்கு வழியமைத்தது ?', 'வங்காளத்திலும் இந்தியாவின் கிழக்குப் பகுதிகளிலும் தொடங்கப்பட்ட பிராமணரல்லாதோர் இயக்கம் எது?', 'மத்திய சட்டப்பேரவைக்கு நடந்த தேர்தல்களில் சுயராஜ்ய கட்சி சிறப்பாக பங்கேற்று 101 இடங்களில் எத்தனை இடங்களை கைப்பற்றியது?', 'இந்திய அரசியல் சாசன சீர்திருத்தங்களுக்கான இந்திய சட்டப்பூர்வ ஆணையத்தை ஆங்கில அரசு யார் தலைமையில் அமைத்தது?', 'பள்ளிப்பாடத்திட்டத்தில் திருக்குறளின் எத்தனை அதிகாரங்கள் சேர்க்கப்படவேண்டும் என 2017 ஆம் ஆண்டு உயர்நீதிமன்ற மதுரை கிளை பள்ளிக்கல்வித்துறைக்கு உத்தரவிட்டது?', 'உயர் நீதிமன்றத்தில் பொதுநல மனு அளிக்க வகைசெய்யும் அரசியலமைப்பு உறுப்பு எது?', 'ஆண்கள், பெண்கள், இளைஞர்கள், முதியோர் என அனைவரும் பின்பற்றத்தக்க _______என்ற புதிய வழிமுறையை காந்தி அறிமுகம் செய்தார். ', 'தவறான இணை எது?', 'இரட்டை ஆட்சி முறை முடிவுக்கு வந்தது?', ' சர் ஜான் சைமன் தலைமையிலான குழுவில் இருந்த இந்திய உறுப்பினர்களின் எண்ணிக்கை என்ன?', 'வேத காலத்தின் போது குடும்பத் தலைவனின் அதிகாரமானது மன்னர் வழி குறியீடுகளில் இருந்து பாதுகாக்கப்பட்டிருந்தது. குடும்பத் தலைவனின் அதிகாரம் எவ்வாறு அழைக்கப்பட்டது?', 'வழிகாட்டு நெறிமுறைகளின்படி, பின்வரும் எப்பிரச்சனைக்காக பொதுநல வழக்கு தொடர முடியாது?', 'இந்திய மக்களை ஒன்றிணைக்கும் முதல் முயற்சியை காந்தியடிகள் எப்போராட்டத்தின்போது மேற்கொண்டார்?', ' தீவிரமான தலித் பகுஜன் இயக்கம் யார் தலைமையில் உருவானது?', 'இந்தியாவில் விவசாயிகள் மற்றும் தொழிலாளர்  கட்சிகளை தொடங்கியவர் யார் ?', 'முதல் முறையாக லாகூரில் மூவர்ண கொடி ஏற்றப்பட்ட நாள் எது? ', 'காலனி ஆதிக்க சுரண்டல் மற்றும் உள்நாட்டில் முதலாளிகள் நடத்திய சுரண்டல் இரண்டுக்கும் எதிராக சண்டையிட வேண்டும் வாதித்தவர்கள் யார் ?', 'ரவுலட் சட்டத்தை மீறுவது என்று முதன் முதலில் உறுதி ஏற்ற அமைப்பு எது?', 'தமிழ்நாட்டில் யாருடைய தலைமையில் உப்பு சத்தியாகிரக யாத்திரை நடந்தது?', 'கல்கத்தா, மதராஸ் ,பம்பாய் ஆகிய நகரங்களில் நீதி வழங்கும் அதிகாரம் கொண்ட உயர் நீதிமன்றங்களை அமைக்க மன்னருக்கு அதிகாரம் அளித்த சட்டம் எது?', 'காயமடைந்த எந்த ஒரு குடிமகனுக்கும் வழக்கமான நடைமுறைகளை காரணங்காட்டி காத்திருக்க வைக்காமல் மருத்துவ உதவியை செய்ய வேண்டும் என்ற தீர்ப்பினை எவ்வழக்கில் உச்ச நீதிமன்றம் வழங்கியது ?', " 'நாடு முதன்முதலாக ஒத்துழையாமை இயக்க செயல்முறை பாடத்தை கற்றுக் கொண்டதாக ' தெரிவித்தவர் யார்?", "______ என்றழைக்கப்பட்ட 'குடை கிட்மட்கர் இயக்கத்தை கான் அப்துல் காபர்கான் நடத்தினார் ?", "மாவோயிஸ்டுகள் ஊடுருவல்கள் தடுக்க 'கோயா கமாண்டோஸ்' சல்வாஜூடும் என்ற பெயர்களில் பழங்குடி இளைஞர்களை சிறப்பு காவல்படை அலுவலர்களாக நியமித்த மாநிலம் எது ?", 'நிர்வாக சட்டங்கள் என்பவை, நிர்வாகத்துடன் தொடர்பு உடையவை என விளக்கம் அளிப்பவர் யார்?', 'தீன் காதியா முறையின்படி, சம்பரானின்  விவசாயிகள்  தங்களின் நிலத்தில் _____ பங்கு பகுதியில் அவுரி (இண்டிகோ) பயிரிட வேண்டும் என்று ஐரோப்பிய பண்ணையாளர்களால் கட்டாயப்படுத்தப்பட்டனர் .', 'இந்திய உச்சநீதி மன்றத்தை பொருத்த வரை ஒரு மைல்கல் சட்டமாக கருதப்படுவது எது ?', 'ரௌலட் சட்டத்திற்கு எதிராக 1919இல் எந்தெந்த மாதங்களில் வேலை நிறுத்தத்தை கடைபிடிக்குமாறு காந்தியடிகள் அழைப்பு விடுத்தார்?', 'சாண்டர்ஸ் என்ற அதிகாரி எங்கு நடத்திய தடியடிக்காக கொல்லப்பட்டார் ?', 'உப்பு சட்டத்தை மீறியதால் கைது செய்யப்பட்ட காந்தியடிகள் எச்சிறையில் அடைக்கப்பட்டார் ?', 'இந்தியாவில் சட்ட ஆட்சியின் மூல ஊற்றாக அமைந்திருப்பது எது ?', 'இந்தியாவில் அமைக்கப்பட்ட முதல் சட்ட ஆணையத்தின் பரிந்துரையின் கீழ் 1860 ஆம் ஆண்டு தயாரிக்கப்பட்ட சட்டம் என்ன ?', 'பீகாரில் உள்ள சம்பரானில் _____முறை பின்பற்றப்பட்டது.', 'ஜாலியன் வாலாபாக் பகுதி எந்நகரில் உள்ளது?', 'முதலாவது வட்டமேசை மாநாட்டில், மாகாண சுயாட்சியுடன் கூடிய மத்திய அரசு பற்றிய யோசனையை அறிவித்தவர் யார்?', 'உச்ச நீதிமன்றத்திடம் எந்த ஒரு சட்ட விவகாரம் குறித்தும் ஆலோசனை கேட்டு அணுக முடிந்தவர் யார்?', 'ஒரு நபர் மேற்கொள்ளும் அனைத்து குற்றங்களுக்கான வழக்குகள், அவற்றுக்கான தண்டனைகள் ஆகியவற்றின் பட்டியல் கொண்ட ஆவணத்திற்கு என்ன பெயர்?', 'சம்பரானை சேர்ந்த விவசாயியான யார், சம்பரானுக்கு வருகை புரியுமாறு காந்தியடிகளை கேட்டுக்கொண்டார்?', 'ஜாலியன் வாலாபாக் படுகொலையின் போது பஞ்சாபின் துணை நிலை  ஆளுநராக பதவி வகித்தவன் யார்?', 'லண்டனில் நடைபெற்ற இரண்டாவது வட்டமேசை மாநாட்டில் கலந்து கொண்ட காங்கிரஸின் பிரதிநிதிகள் எத்தனை பேர்?', 'உச்ச நீதிமன்றமானது இந்திய அரசமைப்பு பகுதி _____ அத்தியாயம் ____ மூலம் நிறுவப்பட்டுள்ளது.', 'இந்திய உச்சநீதிமன்றத்தின் வடிவம் மற்றும் அதிகார வரம்புகள் குறித்துக் கூறும் அரசமைப்பு உறுப்புகள் யாவை ?', 'தொழில்நுட்ப வளர்ச்சியினால், புதிய குற்றவியல் சட்டம் தேவைப்பட்டதையொட்டி அதற்காக இந்திய அரசு ஒரு குழுவை அமைத்த ஆண்டு என்ன ?', 'பின்வருபவர்களுள், சம்பரான் விவசாயிகளின் பிரச்சினைகள் குறித்து விசாரிக்க பீகாரின் துணைநிலை ஆளுநரால்  அமைக்கப்பட்ட விசாரணைக் குழுவில் இடம் பெற்றிருந்தவர் யார் ?', 'அரசின் தகவலின்படி, ஜாலியன் வாலாபாக்கில் கொல்லப்பட்ட மக்களின் எண்ணிக்கை என்ன?', ' இரண்டாவது முறையாக காந்தி சட்டமறுப்பு இயக்கத்தை கையிலெடுத்தும், ஆங்கில அரசு அமல்படுத்திய சட்டம் எது?', ' உச்சநீதிமன்ற நீதிபதிகளின் எண்ணிக்கையை அதிகரிக்க, அரசமைப்பு யாருக்கு / எதற்கு அதிகாரம் வழங்கியுள்ளது?', 'கோவா, டையூ டாமன், தாத்ரா, ராம்நகர், அவேலி ஆகியவைகளின் உயர்நீதிமன்றம் எது?', ' சென்னை உயர்நீதிமன்றம் நிறுவப்பட்ட நாள் எது?', 'லட்சத்தீவிற்கான உயர்நீதிமன்றம் எது ?', 'காந்தியடிகளை ஒரு மக்கள் தலைவராக உருவாக்கிய அகமதாபாத் துணி ஆலை வேலைநிறுத்தப் போராட்டம் மற்றும் கேதா சத்தியாக்கிரகம் ஆகியன நடைபெற்ற ஆண்டு என்ன?', ' 1919ஆம் ஆண்டு நவம்பர் மாதம் தில்லியில் நடைபெற்ற அகில இந்திய கிலாபத் இயக்க மாநாட்டிற்கு தலைமை ஏற்றவர் யார் ?', 'ராம் பிரசாத் பிஸ்மில் அஷ்பகுல்லா ஆகிய இருவர்  மரண தண்டனையும், வேறு 17 பேருக்கு நீண்ட கால சிறை தண்டனையும் ____சதித்திட்ட  வழக்கில் வழங்கப்பட்டது.', 'பின்வருவனவற்றுள் காங்கிரஸ் கட்சி பங்கேற்ற வட்டமேசை மாநாடு எது ?', 'உச்சநீதிமன்ற நீதிபதியை நியமனம் செய்வதற்கு பின்வரும் எக்குழுவுடன் ஆலோசனை மேற்கொள்ளப்படுகிறது ?', 'துணை நீதிமன்றங்களின் பணி என்ன?', 'அகமதாபாத் துணி ஆலை பணியாளர்களுக்கு ஊக்கம் தரும் வகையில், காந்தியடிகள் எப்போராட்டத்தில் இறங்கினார்?', 'அம்பேத்கர் 1916 இல் மானுடவியல் தொடர்பான சர்வதேச மாநாட்டில் கலந்துகொண்டு எத்தலைப்பிலான ஆராய்ச்சிக் கட்டுரை சமர்ப்பித்தார்?', 'கொலிஜியம் என்பது?', 'மாவட்ட நீதிமன்றங்களின் பணி என்ன?', 'ஆங்கில அரசின் பஞ்சகால விதியின்படி, பயிர்சாகுபடி சராசரியாக எத்தனை சதவீதத்துக்கும் குறைவாக இருந்தால் பயிரிடுவோர் முழு நிலவரி ரத்துக்கு  தகுதி பெறுவர்?', 'பஞ்சாப் கொடுமை என அழைக்கப்படுவது எது ?', 'அம்பேத்கர் தனது செயல்பாடுகளுக்காக தொடங்கிய அமைப்பான பஹிஷ்கிரித் ஹிடாகரினி சபை என்பதன் பொருள் என்ன?', 'ஒடுக்கப்பட்ட வகுப்பினரை சிறுபான்மையினர் பட்டியலில் சேர்ப்பதை வலுவாக எதிர்த்தவர் யார் ?', 'உச்ச நீதிமன்ற நீதிபதியை நாடாளுமன்றத்தில்______ தீர்மானம் நிறைவேற்றுவதன் மூலம் பதவி நீக்கம் செய்ய முடியும்.', 'ஒரு சுதந்திரமான நீதித்துறை என்ற கருத்தை முன்மொழிந்த முதல் அரசியல் தத்துவஞானி யார் ?', 'லோக் அதாலத்திற்கு தலைமை வகிக்கும் மூன்று நபர்கள் கொண்ட அமர்வு எது?', '1918-ல் நில வருவாய் வசூலை ரத்து செய்யுமாறு காலனி ஆட்சி நிர்வாகத்திடம் கோரிக்கை வைத்த விவசாயிகள் யார்?', 'ஜாலியன் வாலாபாக் படுகொலை உள்ளிட்ட கொடுமைகளுக்கு எதிர்ப்புத் தெரிவித்து தமக்கு வழங்கப்பட்ட எப்பட்டத்தை தாகூர் திருப்பிக் கொடுத்தார் ?', 'ஒடுக்கப்பட்ட மக்களுக்கான தனித்தொகுதிகள் ஒதுக்கீட்டிற்கு எதிராக சாகும் வரை உண்ணாவிரதம் இருக்கும் போராட்டத்தை காந்தி எங்கிருந்து தொடங்கினார்?', 'இந்தியாவின் முதல் பட்டியலின உச்சநீதிமன்ற நீதிபதி யார்?', 'கிராமப்புற மக்களுக்கு சட்ட உதவி மற்றும் சேவைகளை வழங்குவதற்காக பின்வரும் எந்த அமைச்சகத்தின் முயற்சியால் “தொலைதூர சட்ட முன்னெடுப்பு” என்ற திட்டம் தொடங்கப்பட்டது?', 'காந்தியடிகள் யாரை தனது அரசியல் தலைவராக கொண்டார்?', 'இந்தியர்கள் ஒத்துழையாமை இயக்கத்தை வன்முறையற்ற வகையில் பின்பற்றினால் எவ்வளவு காலத்திற்குள் சுயராஜ்யத்தை பெற்றுத்தருவதாக காந்தியடிகள் உறுதி கூறினார்?', 'பின்வரும் எச்சட்டப்பேரவையின் உறுப்பினர் ஆக அண்ணல் அம்பேத்கர் தேர்ந்தெடுக்கப்பட்டிருக்கிறார்?', 'துவக்கத்தில் இந்திய உச்சநீதிமன்றம் எங்கு செய்யப்பட்டது?', 'உயர்நீதிமன்றத்தின் தலைமை நீதிபதியை நியமிக்கும் போது குடியரசுத் தலைவர் யாரிடம் கலந்து ஆலோசிப்பது இல்லை?', 'கிராமப்புற மக்களிடையே நீதி அமைப்பு பற்றி அதிக விழிப்புணர்வை உருவாக்கி, அவர்களது செலவை குறைத்து, அவர்களின் வாழிடங்களிலேயே நீதி வழங்க வழி செய்யும் நீதிமன்றம் எது ?', 'சம்பரான் போராட்டத்தில், காந்தியடிகளின் செயல்பாடுகளுக்கு துணையாக நின்றவர்கள் யார்?', '1942ல் அம்பேத்கர் துவங்கிய கட்சி எது ?', "அடிப்படை உரிமைகளை பாதுகாப்பதற்காக எத்தனை வகையான 'நீதிப்பேராணைகள் மற்றும் இடைக்கால உத்தரவு வழங்கும் அதிகாரங்களை' உச்ச நீதிமன்றமும் உயர் நீதிமன்றங்களும் கொண்டுள்ளன ?", 'சமுதாயத்தின் நலிந்த பிரிவினருக்கு இலவச சட்ட உதவிகள் வழங்குவதோடு பிரச்சனைகளுக்கு இணக்கமான தீர்வு காண லோக் அதாலத்தை ஏற்பாடு செய்வது எது?', 'முதல் லோக் அதாலத் நடைபெற்ற ஜீனாகத் , எம்மாநிலத்தில் உள்ளது?', '1937 இல் அம்பேத்கர் துவங்கிய கட்சி எது ?', 'அம்பேத்கர் தோற்றுவித்த பத்திரிக்கையான“ மூக் நாயக் ”என்பதன் பொருள் என்ன ?', 'இந்தியாவை விட்டு 20 ஆண்டுகள் வெளியே இருந்த காந்தியடிகள் யாருடைய அறிவுரையை ஏற்று இந்தியா திரும்பினார்?', 'ஒத்துழையாமை இயக்கத்தில் ஈடுபட்டு, ஆந்திராவின் எப்பகுதியைச் சேர்ந்த அனைத்து மக்களும் வரி செலுத்த மறுத்து கூட்டம் கூட்டமாக நகரங்களை காலி செய்து வெளியேறினர்?', 'பண்டைய காலத்தில் நீதி என்ற கருத்து எதனுடன் தொடர்புடையதாக இருந்தது?', 'துக்ளக் ஆட்சி காலத்தில் உரிமையியல் நடைமுறை சட்டங்கள் தொகுக்கப்பட்டு அது எவ்வாறு அழைக்கப்பட்டது ?', 'இ-நீதிமன்றங்கள் திட்டம் தொடங்கப்பட்ட ஆண்டு எது?', 'உத்திரப் பிரதேசம் ,வங்காளம், அசாம், பீகார், ஒடிசா ஆகியவற்றின் பல பகுதிகளில் , ஒத்துழையாமை போராட்டங்கள் காரணமாக யார் தீவிரமாக அவமதிக்க பட்டதாக இந்திய அரசுத்துறை செயலாளருக்கு எழுதிய கடிதத்தில் வைஸ்ராய் ஒப்புக்கொண்டிருந்தார்?', 'ஒத்துழையாமை இயக்கத்தில் ஈடுபட்டதால் காந்தியடிகளுக்கு எத்தனை ஆண்டுகள் சிறை தண்டனை விதிக்கப்பட்டது?', 'மாற்றம் வேண்டுவோர் குழுவில்(Pro - changers) இணைந்த தமிழ்நாட்டைச் சேர்ந்தவர் யார்?', 'தீண்டத்தகதோருக்கு தனித்தொகுதிகள் வழங்கப்பட்டுள்ளதை தனது வாழ்நாள் முழுவதும் இருக்கப்போவதாக மிகவும் வருத்தத்துடன் அறிவித்தவர் யார்?', 'இரண்டாவது வட்டமேசை  மாநாடு லண்டனில் நடைபெற்ற நாள் எது?', 'ஃபைகா-இ-பெரோஸ்-ஷாகி யாருடைய காலத்தில் 1670 ஆம் ஆண்டு ஃபட்வா-இ-ஆலம்கீர் என்ற சட்டத்தொகுப்பின்படி மாற்றி அமைக்கப்பட்டது ?', 'நாட்டின் மிகப்பழமையான  உயர்நீதிமன்றம் எது ?', 'உயர் நீதிமன்றம் ஆனது எந்த சட்ட உறுப்பின் கீழ் , பொதுமக்கள் நலன்கருதி வழிகாட்டுதல்கள் , உத்தரவுகள் பிறப்பிக்கிறது?', 'சிவில் வழக்குகளை தீர்ப்பதற்காக ஊரக குடிமையியல் நீதிமன்றத்தையும் குற்றவியல் வழக்குகளை தீர்ப்பதற்காக ஊரக குற்றவியல் நீதிமன்றத்தையும் அமைத்தவர் யார் ?', '_____ ஆம் ஆண்டு பிரிவு கவுன்சில் நீதி வரையறை ஒழிப்பு சட்டத்தின் மூலம் பிரிவு கவுன்சில் நீதி வரையறை நீக்கப்பட்டது.', 'பொதுவான உயர்நீதிமன்றத்தை கொண்டுள்ள மாநிலங்களில் சேராதது எது?', 'நில ஆவணங்கள் தொடர்பான வழக்குகளை  விசாரித்ததோடு, நிலவருவாயை நிர்ணயம் செய்து, நில உரிமையாளர்களிடம் இருந்து அதனை வசூலிக்கும் அமைப்பு எது?', 'உயர் நீதிமன்ற சட்டம் 1861 இல் படி நிறுவப்பட்ட உயர்நீதிமன்றங்களில் சேராதது எது ?', 'உயர் நீதிமன்றத்தின் அதிகாரங்களில் சேராதது எது?', 'மாவட்ட அளவில் சிவில் வழக்குகளை விசாரிக்கும் நீதிமன்றங்கள் எவ்வாறு அழைக்கப்படுகிறது ?', 'மகாத்மா காந்தி தென் ஆப்பிரிக்காவில் வாழ்ந்த இந்தியர்களின் சமூக உரிமைகளுக்காக எத்தனை ஆண்டுகள் போராடிய பிறகு இந்தியா திரும்பினார்?', 'யார் தலைமையிலான மிதவாத / தாராளக் கொள்கையை உடைய அரசியல் தலைவர்களின் குழு , மாண்டேகு செம்ஸ்போர்டு திட்டத்தின் பெரும்பான்மை கருத்தை எதிர்த்தது?', '“நமது நீதித்துறை நிர்வாகத்திடம் இருந்து சுதந்திரமாக இருக்க வேண்டும் அதே வேளையில் திறமை மிக்கதாகவும் இருக்க வேண்டும் என்பதில் அவையில் மாறுபட்ட கருத்து இருக்க முடியாது .மேலும் வினா என்னவென்றால் எப்படி இந்த இரண்டு நோக்கங்களையும் பாதுகாக்க முடியும் என்பதே ஆகும் ”என்று கூறியவர் யார்?', 'உயர்நீதிமன்றத்தில் பொதுநல மனு அளிக்க வகைசெய்யும் அரசியலமைப்பு உறுப்பு எது?', 'பின்வரும் எந்த சட்டத்தின்படி, நடுவர் நீதி மன்றங்களில் பொதுநல வழக்கிற்கான மனுவைத் தாக்கல் செய்ய முடியும்?', 'எந்த அரசியலமைப்பு உறுப்புபடி,  பொதுநல மனுக்களை விசாரணைக்கு ஏற்றுக்கொள்ளும் அதிகாரத்தை உச்சநீதிமன்றம் தனக்குள் இணைத்துக் கொண்டுள்ளது ?', 'அமெரிக்காவில் 1947 ஆம் ஆண்டு,“ உச்சநீதிமன்றம் 1947” என்று தலைப்பிட்ட கட்டுரை ஒன்றில் "Judicial Activism" ( நீதித்துறை செயல்பாட்டு முறை) என்ற சொல்லை அறிமுகப்படுத்தியவர் யார் ?', 'யாருடைய சட்ட அகராதி,"Judicial  Activism" என்பது ஒரு "நீதித்துறை தத்துவம் " என்று கூறுகிறது .', 'காந்தியடிகள் சபர்மதி ஆசிரமத்தை எங்கு நிறுவினார்?', '1872 ஆம் ஆண்டு வெளிவந்த ஜோதிராவ் பூலேவின் புத்தகம் எது ?', 'இரண்டாவது வட்டமேசை மாநாட்டிற்கு பிறகு காந்தி மீண்டும் கையிலெடுத்த போராட்டம் எது?', 'மூன்றாவது வட்டமேசை மாநாடு நடத்தப்பட்ட ஆண்டு எது?', 'இந்திய வாக்காளர்களுக்கு வாக்குரிமை பெற வயது மற்றும் தகுதி பற்றிய தகவல் சேகரித்து எக்குழுவுடன் கலந்துரையாட வருமாறு அண்ணல் அம்பேத்கருக்கு ஆங்கில அரசு அழைப்பு விடுத்தது?', 'ஒடுக்கப்பட்ட மக்களுக்கான தனித்தொகுதிகள் ஒதுக்கீட்டிற்கு எதிராக சாகும்வரை உண்ணாவிரதம் இருக்கும் போராட்டத்தை காந்தி எப்போது தொடங்கினார்?', 'யாருடைய ஆட்சியில் மாவட்ட குற்றவியல் நீதிமன்றங்கள் நீக்கப்பட்டு, கொல்கத்தா, டாக்கா, முர்ஷிதாபாத் மற்றும் பாட்னா ஆகிய இடங்களில் மாகாண மேல்முறையீட்டு நீதிமன்றங்கள் அமைக்கப்பட்டன?', 'கல்கத்தாவில் அமைக்கப்பட்ட முதல் உச்ச நீதிமன்றத்தின் தலைமை நீதிபதியாக நியமிக்கப்பட்டவர் யார்?', 'எந்தவித நீதிமன்ற விசாரணையும் இன்றி எவரையும் சிறையில் அடைக்க அரசுக்கு அதிகாரம் அளித்த சட்டம் எது?', 'உயர்நீதிமன்ற நீதிபதி ஆவதற்கான தகுதிகளில் ஒன்று மற்றும் தவறு. அது எது?', 'மாறிக் கொண்டிருக்கும் ஒரு சமூகத்தில் நீதித்துறை மேற்கொள்ளும் வீரியமிக்க செயல்பாடுகள் எவ்வாறு அழைக்கப்படுகிறது?', 'உச்சநீதிமன்றத்தால் அடிக்கடி எடுத்தாளப்படும் அரசமைப்பு உறுப்பு எது?', 'பின்வரும் வாக்கியங்களில் சரியானது எது?\n1. அரசமைப்பு என்பது வலியுறுத்துவதும் வழிகாட்டுவதுமான விதிகளின், ஒரு தொகுப்பு ஆகும்.\n2. அரசமைப்பு என்பது நாட்டு மக்கள் அனைவருக்கும் ஒரு விதி முறைகளின் தொகுப்பை மும்மொழிப்தன் மூலம் தேசத்தில் ஒழுங்குபடுத்துகிறது', 'ஒவ்வொரு தனிநபரின், தனிநபர் சுதந்திரத்தை பாதுகாக்கும் நீதிப்பேராணை எது?', '1919 ஆம் ஆண்டில் இயற்றப்பட்ட சட்டம் (கள்)  எது?\n1. இந்திய கவுன்சில் சட்டம்\n2.வெளிநாடு வாழ் இந்தியர் கட்டுப்பாட்டு சட்டம்\n3. ரவுலட் சட்டம்\n4. இந்திய பத்திரிக்கைகள் சட்டம்', 'பஞ்சாயத்து நீதிமன்றங்கள், கிராம் அளவில் என்ன வழக்குகளை விசாரிக்கிறது?', 'சத்தியாகிரக சபையை நிறுவியவர் யார்?', 'காந்தியடிகள் ரௌலட் சட்டத்தை எதிர்த்து நாடு தழுவிய சத்யாகிரக போராட்டத்திற்கு அழைப்பு விடுத்த நாள் எது?', 'ஜாலியன் வாலாபாக்கில் குழுமியிருந்தவர்களை குறிவைத்து எந்திர துப்பாக்கிகளில் குண்டுகள் தீரும் வரை சுடுமாறு உத்தரவிட்டது யார்?', 'கிலாபத், பஞ்சாப் கொடுமை ஆகிய இரண்டு காரணங்களால் தொடங்கப்பட்ட இயக்கம் எது?', 'ஜாலியன் வாலாபாக் படுகொலைக்கு பழிதீர்க்கும் விதமாக 1940 மார்ச் 30ல் லண்டனின்  காக்ஸ்டன் அரங்கில் மைக்கேல் ஓ டயரை  படுகொலை செய்தவர் யார் ?', 'நாட்டிலேயே முதன்முறையாக இடி மின்னலை ஆய்வு செய்யும், ஆராய்ச்சி நிலையமானது அமைய உள்ள மாநிலம் எது?', 'இந்திய வானிலை ஆய்வு மையத்தின் தலைவராக பொறுப்பேற்றுள்ள “மிருத்யுஞ்சய் மொகபத்ரா” எவ்வாறு அழைக்கப்படுகிறார்?', '_____ நாட்டின் "அமேசானியா - I" என்ற செயற்கை கோளானது,PSLV - C51 ராக்கெட் மூலமாக பிப்ரவரி 28ஆம் தேதி விண்ணில் செலுத்தப்பட்டது.', 'முதல் முறை விண்ணப்பித்தவர்களுக்கு இலவசமாக வாக்காளர் அடையாள அட்டையை வீட்டிற்கே வந்து வழங்க தேர்தல் ஆணையம் ஆனது பின்வரும் எந்த துறையுடன் புரிந்துணர்வு ஒப்பந்தம் போட்டுள்ளது ?', '2020-21 நிதியாண்டில், இந்தியாவின் ஒட்டுமொத்த உள்நாட்டு உற்பத்தி எத்தனை சதவீத அளவுக்கு இருக்கும் என RBI கணிப்பு வெளியிட்டுள்ளது?', 'புதுப்பிக்கத்தக்க எரிசக்தித் துறையில் இந்தியாவோடு ஒத்துழைப்புடன் செயற்படுவதற்கு முடிவெடுத்துள்ள நாடு எது?', 'டாக்டர் ஜெ.ஜெயலலிதா பல்கலைக்கழகம் பின்வரும் எம்மாவட்டத்தில் அமைய உள்ளது?', '020 ஆம் ஆண்டின் ஜனநாயக குறியீட்டில் இந்தியா வகிக்கும் இடம் என்ன?', 'கிராமப்புற வீடுகளில் 100% குழாய் குடிநீர் வழங்க “ஹர் கார் பாணி, ஹர் கார் சபை மிஷன்” தொடங்கப்பட்டுள்ள மாநிலம் எது?', 'உலகின் முதல் எரிசக்தி தீவு எந்த நாட்டில் அமைக்கப்படள்ளது?', 'மத்திய ரிசர்வ் போலீஸ் படையின்______  கமாண்டோ படை பிரிவில் முதன்முறையாக பெண் கமாண்டோக்கள் சேர்க்கப்பட்டுள்ளனர்.', ' இ - லோக் அதாலத் திட்டமானது தற்போது எத்தனை மாநிலங்களில் அமலில் உள்ளது?', '" இ - கேபினட்" முறையை செயல்படுத்திய முதல் மாநிலம் எது?', '13வது யானகள் நலவாழ்வு முகாம் எங்கு நடைபெற்றது?', 'உலகின் மிகப்பெரிய கடலோர காற்றாலை பண்ணை அமைய உள்ள நாடு எது?', 'பிப்ரவரி 7ஆம் தேதி திடீரென ஏற்பட்ட பனிச்சரிவு காரணமாக பெரும் வெள்ளப்பெருக்கு ஏற்பட்ட மாநிலம் எது?', 'மதராஸ், பம்பாய், கல்கத்தா ஆகிய மூன்று மாகாணங்களிலும் ஒவ்வொரு மேயர் நீதிமன்றங்களை அமைத்த சட்டம் எது?', 'இந்து சட்டங்களை தொகுப்பதற்கு காரணமானவர் யார்?', 'கல்கத்தாவில் ஒரு உச்சநீதிமன்ற நீதி நிர்வாகம் அமைக்க மன்னருக்கு அதிகாரமளித்த சட்டம் எது?', 'உயர்நீதிமன்றங்களில் அதிகார வரம்பில் பெருமளவு மாற்றத்தினை கொண்டு வந்த சட்டத்திருத்தம் எது?', 'கண்டன தீர்மானமானது, நாடாளுமன்றத்தில் எந்த அவையில் விவாதிக்கப்பட்டு நிறைவேற்றப்பட வேண்டும்?']

a = ['A) இந்திய பணியாளர் சங்கம்', 'A) மூன்றில் ஒரு பங்கு', 'A)ஜார்ஜ் ', 'A)இ-நீதிமன்றங்கள்', 'A)மின்டோ மார்லி சீர்திருத்தம்',
     'A) மௌலான அபுல்கலாம் ஆசாத் ', 'A) ஹரிலால் ஜே.கனியா ', 'A) உச்ச நீதிமன்றம் ', 'A) இங்கிலாந்து செயற்கை சாயம்', 'A) பூனே ', 'A) மாற்றத்தை விரும்புவோர்,மாற்றத்தை விரும்பாதோர்', 'A)சௌரி சௌரா ', 'A) ஹரிலால் ஜே.கனியா ', 'A) புதிய சட்டம் இயற்றுவது ', 'A) தென்னாப்பிரிக்காவில் இருந்த குஜராத்தி நிறுவனம் ஒன்றிற்கு சட்ட உரிமை சம்பந்தமான சேவை வழங்க', 'A) பிரிட்டிஷ் அரசு சட்டம் 1919', 'A) காந்தியடிகள்', 'A) சட்டமன்றம் ', 'A) பேருந்துகள் தேசியமயமாக்க சட்டம் ', 'A)குயின்ஸ்பெர்க் ', 'A) இந்தியாவிற்கான பிரிட்டிஷ் வெளியுறவு அமைச்சர்', 'A) அகில இந்திய கதர் சங்கம்', 'A) சட்டமன்றம் ', 'A) 11(2) ', "A)டால்ஸ்டாயின் 'கடவுளின் அரசாங்கம் உன்னில் உள்ளது' ", 'A) ஒற்றையாட்சி முறை ', 'A)மோதிலால் நேரு தலைமையிலான காங்கிரசார்', 'A) 1 மட்டும் சரி ', 'A) 8வது ', 'A)1 மட்டும் தவறு', 'A)1 மட்டும் சரி ', 'A)காதி இயக்க மேம்பாடு', 'A) சுதந்திரமான & பாகுபாடற்ற', 'A) 1 மட்டும் ', 'A) 1912', 'A) 1 மட்டும் சரி', 'A) கிலாபத் இயக்கம், ஒத்துழையாமை இயக்கம் ஆகியவற்றின் போது இந்துக்கள் மற்றும் முஸ்லிம்களின் ஒத்துழைப்பு இருந்தபோதிலும் அந்த ஒற்றுமை விரிசல் அடைய கூடியதாகவே இருந்தது', 'A) புறநானூறு ', 'A)1 மட்டும் ', 'A) 1912', 'A)காங்கிரஸ் தீவிர அரசியலுக்குத் திரும்ப வேண்டும்', 'A) 1922 ', 'A) உச்ச நீதிமன்றம் ', 'A) பொதுநலன் மனு ', 'A) கிரீம்ஸ் - காந்தி ', 'A)இந்திய லிபரல் கூட்டமைப்பு', 'A) நாமசூத்ரா இயக்கம் ', 'A) 70', 'A) சர் ஜான் சைமன்', 'A) 133', 'A) 133', 'A)சத்யாகிரகம் ', 'A)ஆதி தர்மா இயக்கம் - வடமேற்கு இந்தியா ', 'A) 1930', 'A) 1 ', 'A) குலபா (அ) குலபாடோ', 'A) கொத்தடிமை தொழிலாளர்கள் முறை தொடர்பான விவகாரங்கள் ', 'A) சாந்தலர்கள் கிளர்ச்சி ', 'A) தீனபந்து மிஸ்ரா ', 'A)எஸ்.ஏ.டாங்கே', 'A) 1929 டிசம்பர் 10', 'A)வலது சாரியினர்', 'A) இந்திய லிபரல் கூட்டமைப்பு', 'A) எஸ்.சத்தியமூர்த்தி ', 'A) இந்திய உயர் நீதிமன்ற சட்டம் 1801  ', 'A)சுப்பிரமணிய சிம்ஹா vs இந்திய அரசு', 'A) ராஜேந்திரபிரசாத் ', 'A)கருஞ்சட்டைகள் ', 'A)மிசோரம் ', 'A) காரல் சாப்ஸ் ', 'A)பத்தில் ஆறு பகுதி', 'A)இந்திய உயர் நீதிமன்ற சட்டம் 1861', 'A) மார்ச் - ஏப்ரல் ', 'A)பூனே ', 'A)கல்கத்தா சிறை ', 'A)அரசியல் அமைப்பு ', 'A)இந்திய நிர்வாக சட்டம் ', 'A) தீன்  காதியா ', 'A) நாசிக் ', 'A) இர்வின் ', 'A) பிரதமர் ', 'A) இந்திய தண்டனைச் சட்டம் ', 'A) ஆச்சாரிய கிருபாளினி ', 'A)  ரெஜினால்டு டயர் ', 'A) 1', 'A) 4 & 5', 'A) 124  முதல் 147 வரை', 'A) 1996', 'A)மஜாருல்  ஹக்  ', 'A) 222', 'A) ரவுலட் சட்டம்', 'A) அமைச்சரவை ', 'A) கல்கத்தா உயர் நீதிமன்றம் ', 'A) மார்ச் 15, 1862', 'A) கல்கத்தா உயர் நீதிமன்றம்', 'A) 1919', 'A)மகாத்மா காந்தி', 'A) காக்கோரி ', 'A)ஒன்று  ', 'A)அகில இந்திய பார் கவுன்சில் ', 'A) கடுமையான குற்றவியல் தொடர்பான வழக்குகளை தீர்மானிக்கிறது', 'A) சிறை நிரப்பும் போராட்டம்', 'A) அணிஹிலேஷன்  ஆஃப் கேஸ்ட்', 'A) உச்ச நீதிமன்ற தலைமை நீதிபதி & 8 மூத்த நீதிபதிகளின் குழு', 'A) கடுமையான குற்றவியல் தொடர்பான வழக்குகளை தீர்மானிக்கிறது ', 'A) 30 ', 'A)அமிர்தசரஸ் பொற்கோவில் அழிப்பு ', 'A) ஒடுக்கப்பட்டவர்களின் அமைப்பு ', 'A)அண்ணல் அம்பேத்கர்', 'A) சாதாரண', 'A)கன்பியூசியஸ் ', 'A) ஒரு இளைய நீதிபதி, ஒரு மூத்த நீதிபதி & ஒரு வழக்கறிஞர்', 'A) கோல் மாவட்ட விவசாயிகள்', 'A)வீரத்திருமகன் ', 'A) தண்டி ', 'A) எல்.இளையபெருமாள்', 'A) சட்டம் மற்றும் நீதி அமைச்சகம்', 'A) லாலா லஜபதி ராய்', 'A) 5 ஆண்டுகளுக்குள்', 'A) பம்பாய்', 'A) நாடாளுமன்ற மகாராணி மாடம் ', 'A) மாநில முதலமைச்சர்', 'A)இ - நீதிமன்றம் ', 'A) ராஜேந்திர பிரசாத் & பிரஜ்கிஷோர்  பிரசாத் ', 'A)சுதந்திர தொழிலாளர் கட்சி', 'A) 3 ', 'A) தேசிய சட்ட சேவைகள் அதிகாரம்', 'A) உத்தரபிரதேசம் ', 'A)சுதந்திர தொழிலாளர் கட்சி', 'A)ஒடுக்கப்பட்டவர்களின் தலைவர் ', 'A) லாலா லஜபதி ராய் ', 'A) சித்தூர் ', 'A) பதவி', 'A) ஃபட்வா-இ-பெரோஸ்-ஷாகி', 'A) 2000', 'A) மேல்தட்டு மக்கள் ', 'A) 4', 'A) சி. ராஜகோபாலச்சாரி', 'A) மதன்மோகன் மாளவியா', 'A) 1931 அக்டோபர் 7', 'A)அக்பர் ', 'A)சென்னை உயர்நீதிமன்றம்', 'A) 166 ', 'A)வாரன் ஹாஸ்டிங்ஸ்', 'A) 1937 ', 'A) பஞ்சாப் ', 'A) வருவாய் வாரியம்', 'A)அலகாபாத் உயர்நீதிமன்றம்', 'A) கீழ் நீதிமன்றங்களில் இருந்து வரும் மேல் முறையீடுகளை விசாரித்தல் ', 'A)அமர்வு நீதிமன்றங்கள்', 'A) 11', 'A) காந்தியடிகள்', 'A) ஜவஹர்லால் நேரு', 'A) 133', 'A) குற்றவியல் நடைமுறைச் சட்டம் 133 ', 'A) 133', 'A)ஜார்ஜ் வாஷிங்டன்', 'A)ஜார்ஜ் புஷ் ', 'A) அகமதாபாத் ', 'A)தீனபந்து ', 'A) ஒத்துழையாமை இயக்கம்', 'A) 1935', 'A) ஈஸ்ட்பொரோ ', 'A) 1932 அக்டோபர் 10', 'A) வாரன் ஹஸ்டிங்ஸ் ', 'A) சர் எலிஜா இம்ஃபே ', 'A) மாண்டேகு செம்ஸ்போர்டு சட்டம்', 'A) இந்திய குடிமகனாக இருக்க வேண்டும்', 'A) சமூக நீதி செயல்பாட்டு முறை', 'A) 11', 'A) 1 மட்டும்', 'A) ஆட்கொணர்வு நீதிப்பேராணை ', 'A) 1ம் 2ம்', 'A)உரிமையியல்', 'A) காந்தியடிகள்', 'A) 1919  மார்ச் 6 ', 'A) ஜெனரல் ரெஜினால்டு டயர் ', 'A) வெள்ளையனே வெளியேறு இயக்கம்', 'A)உத்தம் சிங் ', 'A) மத்திய பிரதேசம்', 'A) இந்தியாவின் காற்று மனிதர் ', 'A) பிரான்ஸ் ', 'A)தபால் துறை ', 'A) 9.5%', 'A) பக்ரைன் ', 'A) கடலூர் ', 'A) 100', 'A) மத்தியப்பிரதேசம்', 'A) டென்மார்க் ', 'A) கோப்ரா', 'A) 20 ', 'A) உத்தரப் பிரதேசம் ', 'A) மேட்டுப்பாளையம் ', 'A) தென்கொரியா', 'A) உத்தரகாண்ட் ', 'A) 1726 ஆம் ஆண்டு சாசன சட்டம் ', 'A) காரன் வாலிஸ்', 'A) ஒழுங்குமுறை சட்டம் 1773 ', 'A) 40 ஆவது திருத்தம்', 'A) மேலவை ']

b = ['B) இந்திய விவசாய சங்கம் ', 'B) ஆறில் ஒரு பங்கு ', 'B)வில்லியம் ', 'B) விரைவு நீதிமன்றங்கள் ', 'B) இந்திய அரசுச் சட்டம் 1935',
     'B)பண்டித நேரு ', 'B)பதஞ்சலி சாஸ்திரி ', 'B)மாநில உயர் நீதிமன்றங்கள் ', 'B) அமெரிக்க செயற்கை சாயம் ', 'B)சூரத் ', 'B) ஆங்கில அரசை விரும்புவோர்,ஆங்கில அரசை விரும்பாதோர்', 'B)மலபார் மாப்பிள்ளை கிளர்ச்சி ', 'B)பதஞ்சலி சாஸ்திரி ', 'B)சட்டத்தை செயல்படுத்துவது', 'B) தென்னாப்பிரிக்காவில் இருந்த நிறவெறிக்கு எதிராகப் போராட ', 'B) இந்திய கவுன்சில்கள் சட்டம் 1919', 'B) பண்டித நேரு ', 'B)ஆட்சித்துறை ', 'B)வங்கிகள் தேசியமயமாக்க சட்டம் ', 'B)பிரின்ஸ்பெர்க் ', 'B) சர்வதேச பார்வையாளர்', 'B) அகில இந்திய கதர் கூட்டமைப்பு', 'B)ஆட்சித்துறை ', 'B) 12(3) ', "B)ஜான் ரஸ்கினின் 'அண்டு திஸ் லாஸ்ட்' ", 'B)இரட்டை ஆட்சிமுறை ', 'B) சி.ஆர்.தாஸ் தலைமையிலான காங்கிரசார்', 'B)2 மட்டும் சரி ', 'B)6வது', 'B) 2 மட்டும் தவறு ', 'B)2 மட்டும் சரி ', 'B) இந்து - முஸ்லீம் மேம்பாடு ', 'B) கட்டற்ற அதிகாரம் கொண்ட &  பாகுபாடற்ற', 'B)2 மட்டும்', 'B) 1910', 'B) 2 மட்டும் சரி ', 'B) 1920களின் காலம் இந்துக்கள் மற்றும் முஸ்லிம்களிடையே தொடர்ச்சியான வகுப்பு மோதல்களை கண்ட காலமாகவே இருந்தது ', 'B)தொல்காப்பியம் ', 'B)2 மட்டும் ', 'B) 1910', 'B) காங்கிரஸ் தேர்தல் அரசியலில் ஈடுபடவேண்டும்', 'B) 1921', 'B)சென்னை உயர்நீதிமன்றம்', 'B)சமூகநலன் மனு', 'B)ஸ்மித் - காந்தி', 'B) இந்திய தேசிய காங்கிரஸ்', 'B)ஆதிதர்மா இயக்கம்', 'B) 82', 'B) ஃப்ரெட்ரிக் ஏங்கல்ஸ்', 'B) 118', 'B) 32', 'B)உண்ணாவிரதம் ', 'B)சத்திய சோதக் இயக்கம் - கிழக்கு இந்தியா', 'B) 1935', 'B) 2', 'B) தலபா (அ) தலபாடோ ', 'B)கைவிடப்பட்ட (ஆதரவற்ற) குழந்தைகள் ', 'B)கோல் கிளர்ச்சி ', 'B)மகாத்மா ஜோதிராவ் பூலே ', 'B) எம்.என்.ராய் ', 'B) 1929 டிசம்பர்  20', 'B) இடது சாரியினர்  ', 'B) சுயராஜ்ஜியக் கட்சி ', 'B) சி. ராஜகோபாலச்சாரி ', 'B)இந்திய உயர் நீதிமன்ற சட்டம்1824 ', 'B) ஆர்த்தர் சன் சிங்கர் vs இந்திய அரசு', 'B)ராமச்சந்திர பிடாரி ', 'B)வெண்சட்டைகள் ', 'B)சத்தீஸ்கர்', 'B) போரியர் டைட்டஸ் ', 'B) பதினைந்தில் ஐந்து பகுதி ', 'B) இந்திய அரசாங்கச் சட்டம் 1909', 'B)ஏப்ரல் - மே ', 'B)மீரட் ', 'B)மீரட் சிறை ', 'B)உச்ச நீதிமன்றம் ', 'B)இந்திய குடிமை சட்டம்', 'B)இலாகி மதாயா', 'B)வாரநாசி ', 'B)கிளமெண்ட் அட்லி ', 'B)மாநில ஆளுநர்கள் ', 'B)இந்திய பொது சட்டம் ', 'B)மகாதேவ தேசாய் ', 'B)மைக்கேல் ஓ டயர் ', 'B) 2', 'B) 5 & 4', 'B) 124  முதல் 137 வரை', 'B) 2000', 'B)ராமச்சந்திர பிடாரி ', 'B) 384', 'B) படைத்துறை சட்டம் ', 'B)குடியரசுத் தலைவர் ', 'B)கேரள உயர்நீதிமன்ற', 'B)  ஏப்ரல் 15, 1862', 'B) கேரள உயர்நீதிமன்ற', 'B) 1920', 'B) மௌலானா முகமது அலி', 'B)மீரட் ', 'B)இரண்டு ', 'B)உச்சநீதிமன்ற பார் கவுன்சில்', 'B)கீழ் நீதிமன்றங்கள் வழங்கிய தீர்ப்பின் மேல் முறையீடுகளை விசாரிக்கிறது', 'B)ஒத்துழையாமை போராட்டம்', 'B)  கேஸ்ட்ஸ் இன் இந்தியா ', 'B) உச்ச நீதிமன்ற தலைமை நீதிபதி & 4 மூத்த நீதிபதிகளின் குழு', 'B)கீழ் நீதிமன்றங்கள் வழங்கிய தீர்ப்பின் மேல் முறையீடுகளை விசாரிக்கிறது ', 'B) 35 ', 'B)அமிர்தசரஸ் சீக்கிய குரு படுகொலை', 'B)ஒடுக்கப்பட்டவர்களின் நலனுக்கான அமைப்பு', 'B) மதன்மோகன் மாளவியா', 'B) கவனயீர்ப்பு ', 'B)மாண்டெஸ்கியூ ', 'B) ஒரு ஓய்வு பெற்ற நீதிபதி, ஒரு மூத்த நீதிபதி & ஒரு வழக்கறிஞர் ', 'B) கேதா மாவட்ட விவசாயிகள் ', 'B)கவிதிருமகன்', 'B)பம்பாய்', 'B) கே.ஜி.பாலகிருஷ்ணன் ', 'B) மின்னணு மற்றும் தகவ தொழில் நுட்ப அமைச்சகம் ', 'B) பிபின் சந்திரபால் ', 'B) 7 ஆண்டுகளுக்குள்', 'B) கல்கத்தா ', 'B)நாடாளுமன்ற அரசர் மாடம்', 'B) மாநில ஆளுநர்', 'B)கிராம நீதிமன்றம்', 'B)ராமச்சந்திர பிடாரி & ராஜேந்திர பிரசாத் ', 'B) சுதந்திரப் பாட்டாளி வர்க்க கட்சி ', 'B) 4', 'B) தேசிய நீதி சேவைகள் அதிகாரம் ', 'B)மகாராஷ்டிரா ', 'B) சுதந்திரப் பாட்டாளி வர்க்க கட்சி', 'B)தாழ்த்தப்பட்டவர்களின் தலைவர் ', 'B)ஜவஹர்லால் நேரு', 'B)அனந்தபூர்', 'B) செல்வம்', 'B) ஃபைகா-இ-பெரோஸ்-ஷாகி', 'B) 2008', 'B)கீழ்வகுப்பு மக்கள்', 'B) 5', 'B) ஈ.வே.ராமசாமி  ', 'B) ராஜேந்திர பிரசாத் ', 'B) 1931 ஆகஸ்ட் 7', 'B)ஹூமாயூன்', 'B) மும்பை உயர்நீதிமன்றம்', 'B) 124 ', 'B) காரன்வாலிஸ் ', 'B) 1945 ', 'B)ஹரியாணா ', 'B)  வருவாய் ஆணையம்', 'B) மெட்ராஸ் உயர்நீதிமன்றம் ', 'B)அடிப்படை உரிமைகளைப் பெறுவதற்காக நீதிப் பேராணைகள் வழங்குதல் அதிகாரம் ', 'B) மாவட்ட நீதிமன்றங்கள்', 'B) 15', 'B) கோபால கிருஷ்ண கோகலே', 'B) ராஜேந்திரப் பிரசாத்', 'B) 32', 'B)குற்றவியல் நடைமுறைச் சட்டம் 144 ', 'B) 226', 'B) ஜான் கென்னடி ', 'B)ஜான் கென்னடி', 'B)அலகாபாத் ', 'B)தலித் பேந்தர்', 'B) வெள்ளையனே வெளியேறு இயக்கம் ', 'B) 1932', 'B)வெஸ்ட்பொரோ  ', 'B) 1932 செப்டம்பர் 20', 'B)காரன்வாலிஸ் ', 'B)சர் ஜார்ஜ் காம்யூன்', 'B) மின்டோ மார்லி சட்டம் ', 'B) 10 ஆண்டுகள் நீதித் துறையில் பணிபுரிந்து இருக்க வேண்டும்', 'B) நீதித்துறை சமூக செயல்பாட்டு முறை', 'B) 21', 'B) 2 மட்டும்', 'B) நெறி உறுத்தும் நீதிப்பேராணை', 'B) 1ம் 3ம்', 'B) குற்றவியல்', 'B) வல்லபாய் பட்டேல்', 'B) 1919 ஏப்ரல் 6', 'B)ஜெனரல் ஓ டயர்', 'B) சௌரி சௌரா இயக்கம்', 'B)சுர்ஜித் சிங்', 'B) ஒடிசா ', 'B)இந்தியாவின் மழை மனிதர் ', 'B)இந்தோனேசியா', 'B)வீட்டுவசதித் துறை ', 'B) 12.5%', 'B)குவைத் ', 'B)திருவண்ணாமலை', 'B) 143', 'B) உத்தரப்பிரதேசம் ', 'B)பிரேசில் ', 'B) டைகர்', 'B) 28 ', 'B)ஆந்திரபிரதேசம்', 'B)பொள்ளாச்சி', 'B) சிங்கப்பூர்', 'B)திரிபுரா ', 'B)1753 ஆம் ஆண்டு சாசன சட்டம்', 'B) வாரன் ஹேஸ்டிங்ஸ்', 'B)சாசன சட்டம் 1774 ', 'B) 42ஆவது திருத்தம்', 'B)கீழவை']

c = ['C)இந்திய வாழ்வுரிமை சங்கம்', 'C)நான்கில் ஒரு பங்கு ', 'C)ரிப்பன் ', 'C)லோக் அதாலத் ', 'C) மாண்டேகு செம்ஸ்போர்டு சீர்திருத்தம்',
     'C)காந்தி அடிகள் ', 'C)சையத் பாசல் அலி ', 'C)மாவட்ட மற்றும் அமர்வு நீதி மன்றங்கள் ', 'C)ரஷ்ய செயற்கை சாயம்', 'C)பம்பாய்', 'C) காலனிய விசுவாசிகள், தேசிய விசுவாசிகள்', 'C)லாகூர் சதி ', 'C)சையத் பாசல் அலி ', 'C) A & B ', 'C)தென்னாப்பிரிக்காவில் இருந்த இந்தியர்களின் விடுதலைக்கு போராட', 'C) இந்திய உள்ளாட்சி சட்டம் 1919', 'C)சுபாஷ் சந்திரபோஸ்', 'C)நீதித்துறை ', 'C)கனிமவளங்கள் தேசியமயமாக்க சட்டம்', 'C)பீட்டர்மாரிட்ஸ்பெர்க்', 'C) இந்தியாவிற்கான அரசப்பிரதிநிதி(வைஸ்ராய்)', 'C) அகில இந்திய நெசவாளர் அமைப்பு ', 'C)நீதித்துறை', 'C) 13(2) ', "C)தாரோவின் 'சட்டமறுப்பு' ", 'C)மும்மை ஆட்சி முறை ', 'C) வல்லபாய் படேல் தலைமையிலான காங்கிரசார்', 'C)இரண்டும் சரி ', 'C) 12வது', 'C)இரண்டும் சரி ', 'C)இரண்டும் சரி ', 'C)தீண்டாமை ஒழிப்பு', 'C) சுதந்திரமான & கட்டற்ற அதிகாரம் கொண்ட', 'C) இரண்டும்', 'C) 1905', 'C)இரண்டும் சரி', 'C)1920களில் இந்து மகாசபை சாவர்க்கர் தலைமையிலும், முஸ்லிம் லீக் அலி சகோதரர்கள் தலைமையிலும் பிரபலம் அடைந்து கொண்டிருந்தன ', 'C)சிலப்பதிகாரம் ', 'C)இரண்டும்', 'C) 1905', 'C) 1910', 'C) 1923', 'C) உயர்நீதிமன்ற மதுரை கிளை ', 'C) அரசுநலன் மனு ', 'C) ஸ்மட்ஸ் - காந்தி ', 'C) இந்திய தேசியக் கூட்டமைப்பு ', 'C) சத்யசோதக் இயக்கம்', 'C) 42', 'C) இர்வின்', 'C) 108', 'C) 226', 'C)அடங்க மறுத்தல்', 'C) திராவிட இயக்கம் - தென்னிந்திய ', 'C) 1938', 'C) 3 ', 'C)கலபா (அ)கலபாடோ ', 'C)கைவிடப்பட்ட (ஆதரவற்ற) முதியவர்கள்', 'C)சம்பரான் இயக்கம் ', 'C)கன்சிராம் ', 'C)முசாபர் அகமது ', 'C) 1929  டிசம்பர்25', 'C)நடுநிலையாளர்கள்', 'C)கதார் கட்சி ', 'C) எஸ்.வைத்தியநாதன் ', 'C)இந்திய உயர் நீதிமன்ற சட்டம்1861 ', 'C) பரமானந் கட்டாரா vs இந்திய அரசு ', 'C)காந்தியடிகள் ', 'C)செஞ்சட்டைகள்', 'C) திரிபுரா', 'C)ஐவேர் ஜெண்ணிங்ஸ் ', 'C)இருபதில் மூன்று  பகுதி', 'C) இந்திய அரசாங்கச் சட்டம் 1919', 'C)ஜூன் - ஜூலை ', 'C)லாகூர் ', 'C)எரவாடா சிறை ', 'C)குடியரசுத் தலைவர் ', 'C) இந்திய பொதுச் சட்டம் ', 'C) ஜமீன் மதாயா', 'C)அமிர்தசரஸ்', 'C)வின்ஸ்டன் சர்ச்சில்', 'C)குடியரசுத் தலைவர்', 'C)இந்திய காவல் சட்டம் ', 'C)ராஜ்குமார் சுக்லா', 'C) எமரால்டு டயர் ', 'C) 3', 'C) 5 & 5', 'C) 124  முதல் 157 வரை', 'C) 2003', 'C)காந்தியடிகள்', 'C) 379', 'C)இவை இரண்டும்', 'C)நாடாளுமன்றம் ', 'C) மும்பை உயர்நீதிமன்றம் ', 'C) ஜூலை 15, 1862', 'C) மும்பை உயர்நீதிமன்றம் ', 'C) 1918', 'C) மௌலானா சௌகத் அலி ', 'C)கான்பூர் ', 'C) இரண்டும் மூன்றும் ', 'C) கொலிஜியம்  ', 'C)உரிமையியல் மற்றும் குற்றவியல் வழக்குகளை பரிசீலிக்கிறது', 'C) உண்ணாவிரதப் போராட்டம்', 'C) பாவர்டி லைன் ', 'C) உச்ச நீதிமன்ற தலைமை நீதிபதி & 6 மூத்த நீதிபதிகளின் குழு', 'C)மாவட்ட எல்லைக்குள் எழும் வழக்குகளை கையாளுகிறது', 'C) 25 ', 'C) ஜாலியன் வாலாபாக் படுகொலை', 'C) தனித்துவிடப்பட்டவர்களின் நலனுக்கான அமைப்பு', 'C) மகாத்மா காந்தியடிகள்', 'C)கண்டன ', 'C)அரிஸ்டாட்டில்', 'C)ஒரு ஓய்வு பெற்ற நீதிபதி, ஒரு சமூகப் பணியாளர் & ஒரு வழக்கறிஞர்', 'C)பாரா மாவட்ட விவசாயிகள்', 'C) உலகதிருமகன் ', 'C) எரவாடா ', 'C)எஸ்.ஆர்.பாஸ்கரன் ', 'C) A & B ', 'C)பாலகங்காதர திலகர்', 'C) 3 ஆண்டுகளுக்குள்', 'C)உத்தரப்பிரதேசம்', 'C)  நாடாளுமன்ற குடிமக்கள் மாடம்', 'C) உச்சநீதிமன்ற தலைமை நீதிபதி', 'C) நடமாடும் நீதிமன்றம்', 'C)பிரஜ்கிஷோர் பிரசாத் & மஜாருல  ஹக்', 'C)பட்டியலினத்தவர் கூட்டமைப்பு ', 'C) 5 ', 'C)தேசிய லோக் அதாலத் அதிகாரம்', 'C)குஜராத் ', 'C) பட்டியலினத்தவர் கூட்டமைப்பு ', 'C)அடக்குமுறைகளுக்கு எதிரானவர்களின் தலைவர்', 'C) மோதிலால் நேரு', 'C) ஸ்ரீகாகுளம்', 'C) சமயம் ', 'C) ஃபட்வா-இ-ஆலம்கீர் ', 'C) 2005', 'C) ஆங்கில அதிகாரிகள்', 'C) 6', 'C)கா.சிவசங்கரன் பிள்ளை', 'C)டாக்டர் ராதாகிருஷ்ணன் ', 'C) 1931 செப்டம்பர் 7', 'C) ஷாஜஹான் ', 'C) கல்கத்தா உயர்நீதிமன்றம் ', 'C) 266', 'C)வில்லியம் பெண்டிங்  ', 'C) 1947 ', 'C)சண்டீகர் ', 'C) வருவாய் துறை', 'C)மும்பை & கல்கத்தா உயர் நீதிமன்றங்கள்', 'C)மாநிலத்தின் எல்லைக்குள் உள்ள வழக்குகளை விசாரித்தல், கீழ் நீதிமன்றங்களை கண்காணித்தல் மற்றும் கட்டுப்படுத்துதல்', 'C) பஞ்சாயத்து நீதிமன்றங்கள் ', 'C) 17', 'C) ராஜேந்திர பிரசாத் ', 'C) அம்பேத்கர் ', 'C) 226', 'C)குற்றவியல் நடைமுறைச் சட்டம் 123 ', 'C) 32', 'C)பிளாக்ஸ் ', 'C) பிளாக்ஸ் ', 'C)சூரத் ', 'C) குலாம்கிரி ', 'C)சட்டமறுப்பு இயக்கம் ', 'C) 1933', 'C)நார்த்பொரோ  ', 'C) 1933 அக்டோபர் 10', 'C)வில்லியம் பெண்டிங் ', 'C) சர் எட்வர்ட் ஃயூன்  ', 'C)இந்திய அரசுச் சட்டம் 1935', 'C) அல்லது பதினைந்து ஆண்டுகள் உயர் நீதிமன்ற வழக்கறிஞராக பணியாற்றி இருக்கவேண்டும்', 'C) நீதித்துறை செயல்பாட்டு முறை ', 'C) 31', 'C) இரண்டும்', 'C) தடை நீதிப்பேராணை', 'C) 2ம் 4ம்', 'C) A & B', 'C) சுரேந்திரநாத் பானர்ஜி ', 'C) 1919 மே  6 ', 'C) ஜெனரல் எமரால்டு டயர் ', 'C) சுயராஜ்ய இயக்கம் ', 'C) சுகதேவ் சிங் ', 'C)மேகாலயா', 'C)இந்தியாவின் சூறாவளி மனிதர் ', 'C) பூடான்', 'C)உள்ளாட்சி துறை', 'C) 11.5%', 'C)சவுதி', 'C) விழுப்புரம் ', 'C) 69', 'C)பஞ்சாப் ', 'C)ஜமைக்கா', 'C) லப்பார்ட் ', 'C) 18 ', 'C) இமாச்சலப்பிரதேசம் ', 'C) குன்னூர் ', 'C) இந்தியா', 'C)நாகாலாந்து ', 'C) 1766 ஆம் ஆண்டு சாசன சட்டம்', 'C) வெல்லஸ்ஸி  ', 'C)சாசன சட்டம் 1801', 'C)  44 ஆவது திருத்தம்', 'C) இரு அவைகளிலும்']

d = ['D) இந்திய விவசாய பணியாளர் வாழ்வுரிமை சங்கம்', 'D)ஐந்தில் ஒரு பங்கு', 'D) லிட்டன்', 'D)நடமாடும் நீதிமன்றங்கள்',
     'D) இந்திய அரசுச் சட்டம் 1921', 'D)சுத்தானந்த பாரதி', 'D) மெஹர்சந் மகாஜன்', 'D)ஏதுமில்லை ', 'D) ஜெர்மானிய செயற்கை சாயம்', 'D) மதராஸ்', 'D) காந்தியின் தலைமையை ஏற்போர்,காந்தியின் தலைமையை ஏற்காதோர்', 'D)இவை அனைத்தும்', 'D) மெஹர்சந் மகாஜன்', 'D)ஏதுமில்லை', 'D) நெல்சன் மண்டேலாவின் அழைப்பை ஏற்று', 'D) ஏதும் இல்லை', 'D) இவர் அனைவரும்', 'D)தணிக்கைத்துறை', 'D) A & B', 'D) பிரின்ஸ்டாரிக்பெர்க்', 'D) மதராஸ் மாகாண ஆளுநர் ', 'D)அகில இந்திய சர்வோதய சங்கம் ', 'D) இவை அனைத்தும்', 'D) 14(3)', 'D)இவை அனைத்தும்', 'D)ஆளுநர் ஆட்சி முறை', 'D)  எவரும் இல்லை', 'D)இரண்டும் தவறு', 'D) 9வது ', 'D)இரண்டும் தவறு ', 'D)இரண்டும் தவறு', 'D) இவை அனைத்தும்', 'D) ஏதுமில்லை ', 'D) ஏதுமில்லை', 'D) 1900', 'D) இரண்டும் தவறு', 'D)தவறானது ஏதுமில்லை', 'D)திருக்குறள்', 'D) ஏதுமில்லை', 'D) 1900', 'D) ஏதுமில்லை ', 'D) 1924', 'D)ஏதுமில்லை ', 'D)மக்கள்நலன் மனு', 'D)பெயில்ஸ் - காந்தி', 'D)தன்னிச்சையான இந்திய தேசிய கூட்டமைப்பு', 'D) திராவிட இயக்கம்', 'D) 52', 'D) சர் மெல் கிப்சன்', 'D) 95', 'D) 43', 'D) முற்றுகை ', 'D)ஏதுமில்லை', 'D) 1939', 'D) இந்திய உறுப்பினர்கள் யாரும் இல்லை', 'D)மலபா (அ) மலபாடோ', 'D) குறைந்தபட்ச கூலி வழங்காமை', 'D)உப்பு சத்தியாகிரகம்', 'D)அண்ணல் அம்பேத்கர்', 'D)இவர் அனைவரும்', 'D) 1929 டிசம்பர் 31', 'D) இவர் அனைவரும்', 'D)சத்யாகிரக சபை', 'D) அனந்தா சாரலு ', 'D)இந்திய உயர் நீதிமன்ற சட்டம்1894', 'D)குமாரசிம்ஹா vs இந்திய அரசு', 'D)பிரஞ்கிஷோர் பிரசாத்', 'D) நீல சட்டைகள்', 'D) மணிப்பூர்', 'D)அலெக்ஸ் குக்', 'D) முப்பதில் ஆறு பகுதி', 'D) இந்திய அரசாங்கச் சட்டம் 1935', 'D)மே - ஜூன்', 'D)முல்தான்', 'D)ஏதுமில்லை', 'D)நாடாளுமன்றம் ', 'D)இந்திய தண்டனைச் சட்டம்', 'D) ஜாஹிர் மதாயா', 'D) அகமதாபாத் ', 'D) ராம்சே மெக்டொனால்டு', 'D) பிரதமர் ', 'D)இந்திய கடுங்காவல் சட்டம்', 'D) மஜாருல்  ஹக் ', 'D)ஜெரால்டு டயர் ', 'D) 4', 'D) 4 & 4', 'D) 124  முதல் 167 வரை', 'D) 2006', 'D) மகாதேவ தேசாய்', 'D) 364', 'D) ஏதுமில்லை', 'D)ஏதுமில்லை ', 'D)கவுகாத்தி உயர்நீதிமன்றம்', 'D) ஆகஸ்ட் 15, 1862', 'D)கவுகாத்தி உயர்நீதிமன்றம் ', 'D) 1921', 'D)எம். ஏ.அன்சாரி ', 'D) பூனே', 'D)அனைத்தும் ', 'D)இவை அனைத்துடனும் ', 'D) இவை அனைத்தும்', 'D)முற்றுகை போராட்டம்', 'D) ரிசர்வ் பாங்க் சிஸ்டம்', 'D) உச்ச நீதிமன்ற தலைமை நீதிபதி & 2 மூத்த நீதிபதிகளின் குழு', 'D) இவை அனைத்தும் ', 'D) 20', 'D) இவை அனைத்தும் ', 'D) தாழ்த்தப்பட்டவர்களின் நலனுக்கான அமைப்பு', 'D) ஜவஹர்லால் நேரு', 'D)இவை அனைத்தும்', 'D)ஷீ யங் ', 'D) ஒரு மூத்த நீதிபதி, ஒரு சமூகப் பணியாளர் & ஒரு வழக்கறிஞர்', 'D) கேத்ரி மாவட்ட விவசாயிகள்', 'D)இவை அனைத்தும்', 'D)டெல்லி', 'D)ஏ.எல்.குமரகுருபன்', 'D) B மட்டும் ', 'D) கோபால கிருஷ்ண கோகலே', 'D) 1 ஆண்டுக்குள்', 'D) ஒடிசா', 'D) நாடாளுமன்ற இளவரசர்கள் மாடம் ', 'D) ஏதுமில்லை', 'D) குடும்ப நீதிமன்றம்', 'D)  ஆச்சாரியா கிருபாளினி &  மகாதேவ தேசாய்', 'D)பட்டியலினத்தவர் சுதந்திரக் கூட்டமைப்பு', 'D) 6', 'D) ஏதுமில்லை', 'D)மேற்கு வங்கம்', 'D)பட்டியலினத்தவர் சுதந்திரக் கூட்டமைப்பு ', 'D) வாய்பேச முடியாதவர்களின்  தலைவர்', 'D) கோபால கிருஷ்ண கோகலே ', 'D) சிரலா - பெரலா', 'D)நெறிகள்', 'D)ஏதுமில்லை', 'D) 2009', 'D) அரசு அதிகாரிகள்', 'D) 8', 'D) எஸ். சத்தியமூர்த்தி', 'D)காந்தியடிகள் ', 'D) 1931 நவம்பர் 7', 'D)அவுரங்கசீப் ', 'D)அலகாபாத் உயர்நீதிமன்றம்', 'D) 224', 'D)வெல்லஸ்ஸி ', 'D) 1949', 'D)பீகார்', 'D) வருவாய் நீதிமன்றம்', 'D) சட்டீஸ்கர் உயர்நீதிமன்றம்', 'D) வழக்குகளை ஒரு உயர் நீதிமன்றத்தில் இருந்து மற்றொரு உயர்நீதிமன்றத்திற்கு மாற்றுதல்', 'D)வருவாய் நீதிமன்றங்கள்', 'D) 20', 'D)சுரேந்திரநாத் பானர்ஜி ', 'D)நேரு ', 'D) 43', 'D)குற்றவியல் நடைமுறைச் சட்டம் 114 ', 'D) 24', 'D)ஆர்தர் சன் சிங்கர் ', 'D)ஆர்தர் சன் சிங்கர்', 'D)பூனே ', 'D)மறுக்கப்படும் உரிமை ', 'D)உப்பு சத்தியாகிரகம்', 'D) 1934', 'D)சவுத்பொரோ', 'D) 1933  செப்டம்பர் 20', 'D)வெல்லஸ்ஸி ', 'D)சர் எம்டன் மேத்தீம்ஸ்', 'D) ரவுலட் சட்டம்', 'D) ஏதுமில்லை', 'D)ஏதும் இல்லை', 'D) 41', 'D) ஏதுமில்லை', 'D) இவை அனைத்தும்', 'D) 3ம் 4ம்', 'D)  B மட்டும் ', 'D)மோதிலால் நேரு', 'D) 1919  மே 31', 'D)ஜெனரல் ஜெரால்டு டயர்', 'D)ஒத்துழையாமை இயக்கம்', 'D)தன்வீர் சிங்', 'D) அசாம் ', 'D)இந்தியாவின் வானிலை மனிதர்', 'D) பிரேசில்', 'D) சமூக நலத்துறை', 'D) 10.5%', 'D) ஓமான்', 'D)நாமக்கல்', 'D) 58', 'D)ஜார்கண்ட் ', 'D) இங்கிலாந்து ', 'D)சீட்டா ', 'D) 24', 'D)உத்தரகாண்ட்', 'D)போடி ', 'D) வங்கதேசம் ', 'D)சிக்கிம் ', 'D) 1773 ஆம் ஆண்டு சாசன சட்டம்', 'D)டல்ஹௌசி', 'D) சாசனச் சட்டம் 1824', 'D) 46ஆவது திருத்தம் ', 'D) ஏதுமில்லை']

correct_answer = ['A) இந்திய பணியாளர் சங்கம்', 'A) மூன்றில் ஒரு பங்கு', 'B)வில்லியம்', 'C)லோக் அதாலத்',
                  'C) மாண்டேகு செம்ஸ்போர்டு சீர்திருத்தம்', 'C)காந்தி அடிகள்', 'A) ஹரிலால் ஜே.கனியா', 'C)மாவட்ட மற்றும் அமர்வு நீதி மன்றங்கள்', 'D) ஜெர்மானிய செயற்கை சாயம்', 'C)பம்பாய்', 'A) மாற்றத்தை விரும்புவோர்,மாற்றத்தை விரும்பாதோர்', 'A)சௌரி சௌரா', 'A) ஹரிலால் ஜே.கனியா', 'C) A & B', 'A) தென்னாப்பிரிக்காவில் இருந்த குஜராத்தி நிறுவனம் ஒன்றிற்கு சட்ட உரிமை சம்பந்தமான சேவை வழங்க', 'B) இந்திய கவுன்சில்கள் சட்டம் 1919', 'A) காந்தியடிகள்', 'D)தணிக்கைத்துறை', 'B)வங்கிகள் தேசியமயமாக்க சட்டம்', 'C)பீட்டர்மாரிட்ஸ்பெர்க்', 'A) இந்தியாவிற்கான பிரிட்டிஷ் வெளியுறவு அமைச்சர்', 'C) அகில இந்திய நெசவாளர் அமைப்பு', 'C)நீதித்துறை', 'C) 13(2)', 'D)இவை அனைத்தும்', 'B)இரட்டை ஆட்சிமுறை', 'C) வல்லபாய் படேல் தலைமையிலான காங்கிரசார்', 'C)இரண்டும் சரி', 'D) 9வது', 'B) 2 மட்டும் தவறு', 'D)இரண்டும் தவறு', 'D) இவை அனைத்தும்', 'A) சுதந்திரமான & பாகுபாடற்ற', 'D) ஏதுமில்லை', 'C) 1905', 'C)இரண்டும் சரி', 'C)1920களில் இந்து மகாசபை சாவர்க்கர் தலைமையிலும், முஸ்லிம் லீக் அலி சகோதரர்கள் தலைமையிலும் பிரபலம் அடைந்து கொண்டிருந்தன', 'D)திருக்குறள்', 'B)2 மட்டும்', 'B) 1910', 'B) 1910', 'D) 1924', 'C) உயர்நீதிமன்ற மதுரை கிளை', 'A) பொதுநலன் மனு ', 'C) ஸ்மட்ஸ் - காந்தி', 'A)இந்திய லிபரல் கூட்டமைப்பு', 'A) நாமசூத்ரா இயக்கம்', 'C) 42', 'A) சர் ஜான் சைமன்', 'C) 108', 'B) 32', 'A)சத்யாகிரகம்', 'B)சத்திய சோதக் இயக்கம் - கிழக்கு இந்தியா', 'B) 1935', 'D) இந்திய உறுப்பினர்கள் யாரும் இல்லை', 'A) குலபா (அ) குலபாடோ', 'C)கைவிடப்பட்ட (ஆதரவற்ற) முதியவர்கள்', 'C)சம்பரான் இயக்கம்', 'D)அண்ணல் அம்பேத்கர்', 'D)இவர் அனைவரும்', 'D) 1929 டிசம்பர் 31', 'B) இடது சாரியினர்', 'D)சத்யாகிரக சபை', 'B) சி. ராஜகோபாலச்சாரி', 'C)இந்திய உயர் நீதிமன்ற சட்டம்1861', 'C) பரமானந் கட்டாரா vs இந்திய அரசு', 'C)காந்தியடிகள்', 'C)செஞ்சட்டைகள்', 'B)சத்தீஸ்கர்', 'C)ஐவேர் ஜெண்ணிங்ஸ்', 'C)இருபதில் மூன்று பகுதி', 'D) இந்திய அரசாங்கச் சட்டம் 1935', 'A) மார்ச் - ஏப்ரல்', 'C)லாகூர்', 'C)எரவாடா சிறை', 'A)அரசியல் அமைப்பு', 'D)இந்திய தண்டனைச் சட்டம்', 'A) தீன் காதியா', 'C)அமிர்தசரஸ்', 'D) ராம்சே மெக்டொனால்டு', 'C)குடியரசுத் தலைவர்', 'A) இந்திய தண்டனைச் சட்டம்', 'C)ராஜ்குமார் சுக்லா', 'B)மைக்கேல் ஓ டயர்', 'A) 1', 'B) 5 & 4', 'A) 124 முதல் 147 வரை', 'B) 2000', 'C)காந்தியடிகள்', 'C) 379', 'B) படைத்துறை சட்டம்', 'C)நாடாளுமன்றம்', 'C) மும்பை உயர்நீதிமன்றம்', 'D) ஆகஸ்ட் 15, 1862', 'B) கேரள உயர்நீதிமன்ற', 'C) 1918', 'A)மகாத்மா காந்தி', 'A) காக்கோரி', 'B)இரண்டு', 'C) கொலிஜியம்', 'C)உரிமையியல் மற்றும் குற்றவியல் வழக்குகளை பரிசீலிக்கிறது', 'C) உண்ணாவிரதப் போராட்டம்', 'C) பாவர்டி லைன்', 'B) உச்ச நீதிமன்ற தலைமை நீதிபதி & 4 மூத்த நீதிபதிகளின் குழு', 'D) இவை அனைத்தும் ', 'C) 25 ', 'C) ஜாலியன் வாலாபாக் படுகொலை', 'C) தனித்துவிடப்பட்டவர்களின் நலனுக்கான அமைப்பு', 'C) மகாத்மா காந்தியடிகள்', 'C)கண்டன', 'B)மாண்டெஸ்கியூ', 'C)ஒரு ஓய்வு பெற்ற நீதிபதி, ஒரு சமூகப் பணியாளர் & ஒரு வழக்கறிஞர்', 'B) கேதா மாவட்ட விவசாயிகள்', 'A)வீரத்திருமகன்', 'C) எரவாடா', 'B) கே.ஜி.பாலகிருஷ்ணன் ', 'C) A & B', 'D) கோபால கிருஷ்ண கோகலே', 'D) 1 ஆண்டுக்குள்', 'A) பம்பாய்', 'D) நாடாளுமன்ற இளவரசர்கள் மாடம் ', 'A) மாநில முதலமைச்சர்', 'C) நடமாடும் நீதிமன்றம்', 'A) ராஜேந்திர பிரசாத் & பிரஜ்கிஷோர்  பிரசாத் ', 'C)பட்டியலினத்தவர் கூட்டமைப்பு ', 'C) 5', 'A) தேசிய சட்ட சேவைகள் அதிகாரம்', 'C)குஜராத்', 'A)சுதந்திர தொழிலாளர் கட்சி', 'D) வாய்பேச முடியாதவர்களின்  தலைவர்', 'D) கோபால கிருஷ்ண கோகலே ', 'D) சிரலா - பெரலா', 'C) சமயம்', 'B) ஃபைகா-இ-பெரோஸ்-ஷாகி', 'C) 2005', 'B)கீழ்வகுப்பு மக்கள்', 'C) 6', 'D) எஸ். சத்தியமூர்த்தி', 'D)காந்தியடிகள்', 'C) 1931 செப்டம்பர் 7', 'D)அவுரங்கசீப்', 'C) கல்கத்தா உயர்நீதிமன்றம்', 'C) 266', 'A)வாரன் ஹாஸ்டிங்ஸ்', 'D) 1949', 'D) வருவாய் நீதிமன்றம்', 'D) வருவாய் நீதிமன்றம்', 'D) சட்டீஸ்கர் உயர்நீதிமன்றம்', 'D) வழக்குகளை ஒரு உயர் நீதிமன்றத்தில் இருந்து மற்றொரு உயர்நீதிமன்றத்திற்கு மாற்றுதல்', 'B) மாவட்ட நீதிமன்றங்கள்', 'D) 20', 'D)சுரேந்திரநாத் பானர்ஜி', 'C) அம்பேத்கர்', 'C) 226', 'A) குற்றவியல் நடைமுறைச் சட்டம் 133', 'C) 32', 'D)ஆர்தர் சன் சிங்கர்', 'C) பிளாக்ஸ்', 'A) அகமதாபாத்', 'C) குலாம்கிரி', 'C)சட்டமறுப்பு இயக்கம்', 'B) 1932', 'D)சவுத்பொரோ', 'B) 1932 செப்டம்பர் 20', 'B)காரன்வாலிஸ்', 'A) சர் எலிஜா இம்ஃபே', 'D) ரவுலட் சட்டம்', 'C) அல்லது பதினைந்து ஆண்டுகள் உயர் நீதிமன்ற வழக்கறிஞராக பணியாற்றி இருக்கவேண்டும்', 'C) நீதித்துறை செயல்பாட்டு முறை', 'B) 21', 'C) இரண்டும்', 'A) ஆட்கொணர்வு நீதிப்பேராணை', 'B) 1ம் 3ம்', 'C) A & B', 'A) காந்தியடிகள்', 'B) 1919 ஏப்ரல் 6', 'A) ஜெனரல் ரெஜினால்டு டயர்', 'D)ஒத்துழையாமை இயக்கம்', 'A)உத்தம் சிங்', 'B) ஒடிசா', 'C)இந்தியாவின் சூறாவளி மனிதர்', 'D) பிரேசில்', 'A)தபால் துறை', 'D) 10.5%', 'A) பக்ரைன்', 'C) விழுப்புரம்', 'D) 58', 'C)பஞ்சாப்', 'A) டென்மார்க்', 'A) கோப்ரா', 'D) 24', 'C) இமாச்சலப்பிரதேசம்', 'A) மேட்டுப்பாளையம்', 'A) தென்கொரியா', 'A) உத்தரகாண்ட்', 'A) 1726 ஆம் ஆண்டு சாசன சட்டம் ', 'B) வாரன் ஹேஸ்டிங்ஸ்', 'A) ஒழுங்குமுறை சட்டம் 1773 ', 'B) 42ஆவது திருத்தம்', 'C) இரு அவைகளிலும்']


@app.route("/", methods=["GET", "POST"])
def home():
    warning = request.args.get("warn")

    if current_user.is_authenticated:
        completed = Test18.query.filter_by(examinee_id=current_user.user_id).first()

        if request.args.get("fee"):
            name = request.args.get("name")
            bending = request.args.get("bending")
            logged_in = request.args.get("logged_in")

            return render_template("index.html", fee=True, name=name, bending=bending, logged_in=logged_in,
                                   completed=completed)

        else:
            if completed:
                return render_template("index.html", warning=warning, completed=completed)

            else:
                return render_template("index.html", warning=warning)

    else:
        return render_template("index.html", warning=warning)


@app.route("/register", methods=['GET', 'POST'])
def register():
    form = RegisterForm()
    errors = []

    if form.validate_on_submit():
        hash_and_salted_password = generate_password_hash(
            request.form.get('password'),
            method='pbkdf2:sha256',
            salt_length=8
        )

        new_user = User(
            email=request.form.get('email'),
            username=request.form.get('name'),
            password=hash_and_salted_password,
        )

        if User.query.filter_by(email=request.form.get('email').lower()).first():
            return redirect(url_for('login', msg="You've already been registered. Please Login!"))

        elif User.query.filter_by(username=request.form.get('name')).first():
            errors.append('The username has already been taken')
            return render_template("register.html", errors=errors, form=form)

        else:
            errors.clear()

            if request.form.get('email') in verified_emails:

                db.session.add(new_user)
                db.session.commit()

                login_user(new_user)

                # redirect to the home page with fee details.
                return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                        bending=student_mails[request.form.get('email')][1]))

            else:
                return redirect(url_for('home', warn=True))

    return render_template("register.html", form=form)


@app.route("/login", methods=['GET', 'POST'])
def login():
    form = LoginForm()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        password = request.form.get('password')

        # Find user by email entered.
        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, password):
            login_user(user)
            errors.clear()

            # checking the user's payment details
            # redirect to the home page with fee details.
            return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                    bending=student_mails[request.form.get('email')][1]))

        else:
            errors.append('Incorrect Password! Try Again')
            return render_template("login.html", errors=errors, form=form)

    msg = request.args.get("msg")
    return render_template("login.html", form=form, errors=errors, msg=msg)


@app.route("/exam", methods=["GET", "POST"])
def exam():
    global attended
    test_no = request.args.get("test_no")
    opentime = exam_sites[request.args.get("test_no")][0]
    closetime = exam_sites[request.args.get("test_no")][1]

    if test_no == "15":
        attended = Test15.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "16":
        attended = Test16.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "17":
        attended = Test17.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "18":
        attended = Test18.query.filter_by(examinee_id=current_user.user_id).first()

    if attended is None:
        return render_template("exam.html", opentime=json.dumps(opentime), closetime=json.dumps(closetime),
                               sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d, correct_answer=correct_answer,
                               answers=[], test_no=test_no)
    else:
        return redirect(url_for("home", warn="You have already committed this exam. Check the results instead."))


@app.route('/evaluate', methods=["GET", "POST"])
def evaluate():

    global new_examinee
    answers = []
    final_result = []
    marks = 0

    for i in range(0, 200):
        user_answer = request.form[f'answers{i}']

        if user_answer is None:
            answers.append("None")

        else:
            answers.append(user_answer)

    for j in range(len(correct_answer)):

        if answers[j].strip() == correct_answer[j].strip():
            marks += 1
            final_result.append("Correct")

        else:
            final_result.append("Wrong")

    # return f"{final_result, answers, correct_answer}"

    st_answers = '#||#'.join(answers)
    f_result = "#||#".join(final_result)

    # return f"{correct_answer, answers}"
    # return f"{[s_answers for s_answers in correct_answer]}"
    # return f"{[s_answers for s_answers in answers]}"
    # return f"{final_result}"

    actual_time = datetime.datetime.now()
    s_time = actual_time.strftime('%Y-%m-%d %H:%M:%S.%f')

    new_examinee = Test17(
        test_author=current_user,
        user_answers=st_answers,
        marks=marks,
        final_result=f_result,
        date=s_time[:-7],
        examinee_name=current_user.username
    )

    db.session.add(new_examinee)
    db.session.commit()

    return redirect(url_for('home', warn="You have successfully completed the exam. Click results to see results."))


@app.route("/result", methods=["GET", "POST"])
def result():
    global answers, final_result, time, marks
    test_no = request.args.get("test_no")

    if test_no == "15":
        attended_student = Test15.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "16":
        attended_student = Test16.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "17":
        attended_student = Test17.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "18":
        attended_student = Test18.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    return render_template("results.html", answers=answers, marks=marks, sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d,
                           correct_answer=correct_answer, final_result=final_result, time=time)


@app.route("/dashboard")
def dashboard():
    all_record = Test18.query.all()

    return render_template("dashboard.html", all_record=all_record)


@app.route("/change_details", methods=["GET", "POST"])
def change_password():
    form = ChangeDetails()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        old_password = request.form.get('old_password')
        new_password = request.form.get('new_password')

        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, old_password):

            if User.query.filter_by(email=email).first():
                old = User.query.filter_by(email=email).first()
                pass_to_update = User.query.get(old.user_id)

                hash_and_salted_password = generate_password_hash(
                    new_password,
                    method='pbkdf2:sha256',
                    salt_length=8
                )

                pass_to_update.password = hash_and_salted_password

                db.session.commit()

                logout_user()
                return redirect(url_for('login', msg="Your password has been changed successfully. "
                                                     "Please Login with your new password."))

        else:
            errors.append("Please check your password.")
            return render_template("change_details.html", form=form, errors=errors)

    return render_template("change_details.html", form=form, errors=errors)


@app.route('/logout')
@login_required
def logout():
    logout_user()
    return redirect(url_for('home'))


@app.route("/admission", methods=["GET", "POST"])
def new_admission():
    form = AdmissionForm()

    if form.validate_on_submit():
        new_member = Admission(
            name=form.name.data,
            mobile_number=form.number.data,
            email=form.email.data,
        )

        db.session.add(new_member)
        db.session.commit()

        verification_code = random.randint(2000, 10000)

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=request.form.get('email'),
                                msg=f"Subject:WELCOME TO SENA CAREER INSTITUTE\n\nWelcome {request.form.get('name')}!"
                                    f" Happy to see you with us. Thanks for supporting us! Keep rocking! "
                                    f"Here is our Educators' number: 8610642720".encode('utf-8'))

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=MY_EMAIL,
                                msg=f"Subject:NEW ADMISSION\n\n{request.form.get('name')} has made an "
                                    f"admission sign up on Sena site Here is details {request.form.get('name')},"
                                    f" {request.form.get('number')}, {request.form.get('email')}!")

        return redirect(url_for('home'))

    return render_template("register.html", form=form, admission=True)


if __name__ == '__main__':
    app.run(debug=True)
