import datetime
import random
import smtplib
import pandas
from flask import Flask, render_template, redirect, url_for, flash, request, abort
from flask_bootstrap import Bootstrap
from flask_ckeditor import CKEditor
from werkzeug.security import generate_password_hash, check_password_hash
from flask_sqlalchemy import SQLAlchemy
from flask_login import UserMixin, login_user, LoginManager, login_required, current_user, logout_user
from flask_wtf import FlaskForm
from sqlalchemy.orm import relationship
from wtforms import StringField, SubmitField, PasswordField
from wtforms.fields.html5 import EmailField
from wtforms.validators import DataRequired
from functools import wraps
import os
import json

app = Flask(__name__)
app.config['SECRET_KEY'] = os.environ.get("SECRET_KEY")
ckeditor = CKEditor(app)
Bootstrap(app)

app.config['SQLALCHEMY_DATABASE_URI'] = os.environ.get("DATABASE_URL", "sqlite:///sena-base.db")
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
db = SQLAlchemy(app)

admin = False
login_manager = LoginManager()
login_manager.init_app(app)

MY_EMAIL = os.environ.get("MY_EMAIL")
SENA_EMAIL = 'sivagangainagarajan@gmail.com'
MY_PASSWORD = os.environ.get("MY_PASSWORD")


@login_manager.user_loader
def load_user(user_id):
    return User.query.get(int(user_id))


def admin_only(f):
    @wraps(f)
    def decorated_function(*args, **kwargs):
        # If id is not 1 then return abort with 403 error
        if current_user.user_id != 1:
            return abort(403)
        # Otherwise continue with the route function
        return f(*args, **kwargs)

    return decorated_function


class User(UserMixin, db.Model):
    __tablename__ = "User"
    user_id = db.Column(db.Integer, primary_key=True)
    email = db.Column(db.String(100), unique=True)
    password = db.Column(db.String(100))
    username = db.Column(db.String(100))
    test = relationship("Test15", back_populates="test_author")
    test16 = relationship("Test16", back_populates="test_author")
    test17 = relationship("Test17", back_populates="test_author")

    def get_id(self):
        return self.user_id


class Test15(db.Model):
    __tablename__ = "Test_15"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test")
    marks = db.Column(db.Integer)
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test16(db.Model):
    __tablename__ = "Test_16"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test16")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Test17(db.Model):
    __tablename__ = "Test_17"
    user_id = db.Column(db.Integer, primary_key=True)
    examinee_id = db.Column(db.Integer, db.ForeignKey("User.user_id"))
    test_author = relationship("User", back_populates="test17")
    marks = db.Column(db.Integer)
    examinee_name = db.Column(db.String())
    user_answers = db.Column(db.String())
    final_result = db.Column(db.String())
    date = db.Column(db.String(250), nullable=False)


class Admission(db.Model):
    __tablename__ = "New_Admission"
    user_id = db.Column(db.Integer, primary_key=True)
    name = db.Column(db.String(100))
    mobile_number = db.Column(db.Integer)
    email = db.Column(db.String(100), unique=True)


db.create_all()
db.session.commit()


class RegisterForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Register')


class LoginForm(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    password = PasswordField('Password*', validators=[DataRequired()])
    submit = SubmitField('Login')


class AdmissionForm(FlaskForm):
    name = StringField('Name*', validators=[DataRequired()])
    number = StringField("Phone*", validators=[DataRequired()])
    email = EmailField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    submit = SubmitField('Submit')


class ChangeDetails(FlaskForm):
    email = StringField('Email*', validators=[DataRequired(message='Enter a valid email-id')])
    old_password = PasswordField('Old Password*', validators=[DataRequired()])
    new_password = PasswordField('New Password*', validators=[DataRequired()])
    submit = SubmitField('Submit')


student_mails = {
    "mgopalakrishnan075@gmail.com": ["Gopal", 2000],
    "nivir6558@gmail.com": ["Nivetha", 7000],
    "jaya26jj@gmail.com": ["Christy", 5000],
    "srjamuna1003@gmail.com": ["jamuna", 7000],
    "satheshpandian1997@gmail.com": ["Satheshpandian", 4000],
    "lakshmiraja412@gmail.com": ["Rajalaskhmi", 5000],
    "tamilarasanbe9597@gmail.com": ["Anitha", 1000],
    "rajeshkannan6341@gmail.com": ["Rajesh kannan", 3000],
    "jaishreeramgp@gmail.com": ["Yogapriya", 3000],
    "irudhayasubiksha2001@gmail.com": ["Subiksha", 0],
    "abinayaabi257@gmail.com": ["Abi", 1000],
    "shanthirasu1991@gmail.com": ["Shanthi", 0],
    "pradee1296@gmail.com": ["Pradeepa", 5000],
    "jeniferj0204@gmail.com": ["Janifer", 7000],
    "krish47457@gmail.com": ["Krishna", 0],
    "naveenaryan440@gmail.com": ["Naveen", 0],
    "veerasurya250899@gmail.com": ["Suriya", 3000],
    "amin2svg@gmail.com": ["Amin", 3000],
    "jjprincy06@gmail.com": ["Jeba Josepin Princy", 0],
    "jancybetsia20@gmail.com": ["Jancy", 0],
    "cottonpanju9@gmail.com": ["Panju", 2000],
    "rameswariv1999@gmail.com": ["Rameshwari", 2000],
    "vimaladharmar2002@gmail.com": ["Vimala", 1000],
    "devahi1993@gmail.com": ["Devahi", 0],
    "sarojiniganesan96@gmail.com": ["Sarojini", 0],
    "gangadha91@gmail.com": ["Gangadharan", 0],
    "krishnannk498@gmail.com": ["Kamatchi", 0],
    "indhuindhumathi141@gmail.com": ["Indhumathi", 4000],
    "jamespurysh@gmail.com": ["Purushothaman", 0],
    "sivagangainagarajan@gmail.com": ["Nagarajan", 0],
    "matheshsethu22@gmail.com": ["Mathesh", 4000],
    "nagarajnkarthika@gmail.com": ["Karthika", 2000],
    "keviraj482@gmail.com": ["Yogesh", 2000],
    "christyjeslina98@gmail.com": ["Christy", 3500]
}

verified_emails = [mail.strip() for mail in student_mails.keys()]

exam_sites = {

    "15": ["June 14, 2021 10:00:00", "June 14, 2021 13:30:00"],
    "16": ["June 21, 2021 10:00:00", "June 21, 2021 13:30:00"],
    "17": ["June 27, 2021 9:00:00", "June 27, 2021 09:56:00"],#time

}

sl_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
         31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58,
         59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
         87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
         112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133,
         134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
         156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177,
         178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199,
         200]

ques = ['எதை உருவாக்குவதற்கு, கூட்டாட்சி முறை மக்களாட்சி நாடுகளில் பின்பற்றப்படுகிறது ?',
        'உலகம் முழுவதும் மாநில உரிமைகளின் & நலன்களின் பாதுகாவலனாக செயல்படுவது ?', 'பின்வரும் வாக்கியங்களில் சரியானது எது?\n1.  ஒரு மாநிலத்தின் பெயரையோ, நிலப்பரப்பையோ மாற்றுகிறோம் என மாநிலத்திற்கு தகவல் அனுப்பி அந்த மாநில சட்டமன்றத்தின் கருத்தை அனுப்புமாறு குடியரசுத் தலைவர் கூறுவார்\n2. மாற்றம் சம்பந்தமான மாநில சட்டமன்றத்தின் கருத்து குடியரசுத் தலைவரை கட்டுப்படுத்தும் ', 'மிகப்பெரிய மாநிலமாகிய உத்திரப்பிரதேசத்திற்கு  எத்தனை இடங்கள் மாநிலங்களவையில் உள்ளன?', ' “நிர்வாக வசதிக்காக நமது நாடும் மக்களும் பல்வேறு மாநிலங்களாக பிரிக்கப்பட்டு இருந்தாலும் நமது நாடு ஒருங்கிணைந்த ஒற்றுமையான நாடாகும். ஒரே ஆட்சியின் கீழ் அனைத்து மக்களும் ஒன்றாக ஒற்றுமையாக வசிப்பார்கள்” என்று கூறியவர் யார்?', 'இந்தியாவில் இரட்டை ஆட்சியை அறிமுகப்படுத்திய சட்டம் எது?', 'இந்திய அரசமைப்பின் எப்பகுதியில் அரசமைப்பை மாற்றுவதற்கான சிறப்பு திருத்தச்சட்ட முறைகள் வழங்கப்பட்டுள்ளது?', 'சிறப்பு பெரும்பான்மையின்படி மாநிலங்களவை ஒரு தீர்மானத்தை இயற்றினால் மாநில அதிகாரத்தை மத்திய பட்டியலுக்கு எவ்வளவு காலத்திற்கு மாற்றலாம்?', 'மாநில தேர்தல் ஆணையம், எவ்விரு அரசியல் சாசன திருத்தச் சட்டங்கள் அடிப்படையில் சுயாட்சி அமைப்புகளுக்கு தேர்தலை நடத்துகின்றது ?', 'மைக்ரோபயாலஜி எனும் வார்த்தையில் உள்ள, “மைக்ரோஸ்”, “பையோஸ்” &  "லோகாஸ்" ஆகிய சொற்கள் எம்மொழியை சேர்ந்தவை ?', 'பின்வரும் தாவர வைரஸ்களில் தவறானது எது?', 'பாக்டீரியாக்கள் இரண்டு வகைப்படும். அவை யாவை?', 'மத்திய மாநில அரசாங்கங்களுக்கு இடையே அதிகார பகிர்வு மூன்று தளங்களில் காணப்படுகிறது. அவை யாவை?', 'பொதுவாக, பொதுப் பட்டியலில் உள்ள விஷயங்களில் நிர்வாக அதிகாரத்தை பெற்றிருப்பது ?', 'இந்திய அரசமைப்பு கொண்டிருக்கும் கூட்டாட்சி கொள்கை எது ?', 'வடகிழக்கு மாநிலங்களுக்காக  சிறப்பு மண்டல குழு உருவாக்கப்பட்ட ஆண்டு என்ன ?', 'துவக்கத்தில் எத்தனை மண்டல குழுக்கள் தோற்றுவிக்கப்பட்டன', 'முதலாவது பட்டியலில் உள்ள விஷயங்கள் மீது ஆட்சித்துறை அதிகாரத்தை பெற்றிருப்பது?', 'நிதிக்குழுவின் 4 உறுப்பினர்களில், எத்தனை உறுப்பினர்கள் நிதி நிர்வாகம், பொருளாதாரம், பொது கணக்குகள் மற்றும் அரசு நிதித் துறை ஆகியவற்றில் நிபுணத்துவம் பெற்றிருப்பார்கள்?', 'பின்வரும் வாக்கியங்களில் சரியானது எது?\n 1.ஆளுநரின் ஒப்புதல் இல்லாமல், மத்திய அரசு தனது நிர்வாக கடமைகளை மாநில அரசுகளிடம் ஒப்படைக்க முடியாது.\n2. ஆளுநரின்  இசைவு இல்லாமல் கூட,மத்திய அரசு தனது நிர்வாக கடமைகளை நாடாளுமன்றத்தின் அனுமதியுடன் மாநில அரசுகளிடம் ஒப்படைக்கலாம் ', 'பூஞ்சைகள் எவ்வகையை சேர்ந்தவை?', 'ஈஸ்ட்டினால் உற்பத்தி செய்யப்படும் ______ எனும் நொதியின் உதவியினால் நொதித்தல் நடைபெறுகிறது.', 'ஆல்காக்கள் அதிக அளவில் பின்வரும் எதை பெற்றுள்ளன?', 'வகைப்பாட்டில் புரோட்டோசோவாக்கள் எவ்வுலகத்தில்  இடம்பெற்றுள்ளன?', 'சில வரிகளை மத்திய அரசாங்கம் விதித்து வசூலிக்கிறது. ஆனால் அந்த வருமானம் மாநிலங்களுக்கு வழங்கப்படுகின்றன. இதற்கு எடுத்துக்காட்டான வரி எது?', 'மத்திய மாநில அரசாங்கங்களுக்கு இடையே அதிகாரப் பகிர்வினை வரையறுக்கும் மூன்று பட்டியல்கள் ஆன மத்திய பட்டியல், மாநில பட்டியல் மற்றும் இணைப்பு பட்டியல் ஆகியவை நமது அரசியலமைப்பின் எந்தப் பட்டியலில் வழங்கப்பட்டுள்ளன?', 'பின்வருவனவற்றுள் மாநில அரசிற்கு வருமானம் தரும் வழிகள் எவை ?\n1.தல வரி & வேளாண் நிலங்கள் மீதான வரி \n2.மது மற்றும் போதைப் பொருட்கள் மீதான கலால் வரி 3.பண்ணை வரி (விவசாய நிலங்கள்) & நில வருவாய் 4.நீதிமன்றங்கள் விதிக்காக மாநில பட்டியலில் உள்ள இதர கட்டணங்கள்\n 5.மத்திய பட்டியலில் இல்லாத ஆவணங்களை வில்லை கட்டணம்', 'மத்திய அரசால் விதிக்கப்பட்டு, வசூலிக்கப்பட்டு மாநிலங்கள் மற்றும் யூனியன் பிரதேசங்களுக்கு பகிர்ந்தளிக்ககூடிய வரிகள் பற்றி குறிப்பிடும் அரசமைப்பு உறுப்புகள் எவை ?', 'கூட்டாட்சி நிதி முறையில் ஓர் ஆண்டில் எத்தனை முறைக்கு மேல் ஒருவரும் வரி  விதிப்பிற்குட்படுத்த கூடாது?', ' கூட்டரசு  நிதியில் கீழ்காணும் எந்த கொள்கைகள் பின்பற்றப்படுவது இல்லை?', 'மும்மொழி கொள்கை தேசிய ஒற்றுமையை வளர்க்கும் என்று கூறிய குழு எது?', ' நதி நீர்ப் பிரச்சனையை தீர்ப்பதற்கு மத்திய அரசாங்கம் தீர்ப்பாயங்களை அமைக்கலாம் என்று வழிவகுக்கும் சட்டம் எது?', 'மெட்ராஸ் மாகாணமும், மைசூர் அரசும் காவிரி நதி நீரை பயன்படுத்தும் ஒப்பந்தத்தில் கையெழுத்திட்ட ஆண்டு எது?', ' தமிழகத்தின் முன்னாள் முதல்வர்_____ அவர்களின் காலத்தில் இருந்து ஆளுநர்களின் அதிகாரங்களை குறைக்க வேண்டும் என்ற கருத்து வலியுறுத்தப்பட்டு வருகிறது.', 'தேசத்தின் பாதுகாப்பு, வெளியுறவு ஆகிய இரண்டு அதிகாரங்கள் தவிர, இதர எல்லா அதிகாரங்களையும், பயன்படுத்தும் முன் மத்திய அரசு, யாரை ஆலோசிக்க வேண்டும் என ராஜமன்னார் குழு பரிந்துரைத்தது ?', 'ராஜமன்னார் குழுவின் பரிந்துரைகள் பற்றிய வாக்கியங்களில் தவறானது எது \n1.மூன்று பட்டியல்களில் இல்லாத இதர அதிகாரங்கள் மத்திய அரசிடமிருந்து மாநில அரசுகளுக்கு மாற்றப்படவேண்டும் \n2.வரி விதிக்கும் அதிகாரமும் மாநில அரசுகளுக்கு மாற்றப்படவேண்டும் ', 'பின் வருபவர்களில் யார், ஆர்.எஸ்.சர்க்காரியா குழுவின் உறுப்பினர் அல்ல?', 'அண்ணல் அம்பேத்கர் அரசமைப்பின் உறுப்பு 356 ஐ எவ்வாறு வர்ணித்தார் ?', 'காவிரி நதிநீர் நடுவர் மன்றம் தனது தீர்ப்பை வழங்கிய ஆண்டு எது?', 'சர்க்காரியா குழு எத்தனை பரிந்துரைகளை உள்ளடக்கிய அறிக்கையை அரசிடம் சமர்ப்பித்தது?', 'கூட்டாட்சி முறையில் பெற்றோராக கருதப்படுவது?', 'அமெரிக்காவின் கூட்டாட்சி முறையில் எத்தனை பட்டியல் மூலமாக அதிகாரப்பகிர்வு எடுத்துரைக்கப்பட்டுள்ளது ?', 'குடியரசுத் தலைவரின் பரிந்துரைப்படி, ஒரு மாநிலத்தின் பெயரையோ, நிலப்பரப்பையோ மாற்றுவதற்கு எவ்வாறான பெரும்பான்மையுடன் ஒரு சாதாரண சட்டம் இயற்றப்படும்?', '3 பட்டியலிலும் இல்லாத இதர அதிகாரங்களை நமது அரசமைப்பு யாரிடம் வழங்கியுள்ளது?', '“இந்தியா ஒரு பாதி அளவு கூட்டாட்சி முறையான அரசாங்கம் உள்ள நாடாகும். இந்தியா ஒரு வழுவிலா கூட்டாட்சி தன்மைகள் உள்ள ஒற்றையாட்சி நாடாகும். அது வலுவான கூட்டாட்சி உள்ள ஒற்றையாட்சி நாடு கிடையாது” என்று கூறியவர் யார் ?', 'மாநிலங்களுக்கு சுயாட்சியை வழங்கிய சட்டம் எது?', ' நேரு குழுவின் அறிக்கையும் (1928)______ ன் கருத்துகளும் கூட்டாட்சி அமைப்பை இந்தியாவிற்கு வலியுறுத்தின.', 'நாடாளுமன்றம், எவ்வாறான சட்டங்களின் மூலமாக மாநிலங்களின் பெயர்களையும், நிலப்பரப்புகளையும் மாற்றியமைக்க முடியும் ?', 'தமிழ்நாட்டிற்கு மாநிலங்களவையில் எத்தனை இடங்கள் உள்ளன?', 'பின்வரும் வாக்கியங்களில் தவறானது எது?', 'நமது அரசமைப்பின் 18வது பகுதியில் உறுப்புகள்_____ முதல் ____ வரை மூன்று விதமான அவசர காலங்களில் விவரிக்கப்பட்டுள்ளன', 'மாநில சட்டமன்றத் தேர்தலை நடத்துவது ?', 'நுண்ணுயிரிகளை நாம் எதைக் கொண்டு பார்க்க இயலும்?', 'பின்வரும் எவ்வைரஸில், நியூக்ளிக் அமிலங்கள் டி.என்.ஏ வாக காணப்படுகின்றன?', 'லத்தின் மொழியில் வைரஸ் என்பதன் பொருள் என்ன?', 'பின்வரும் வாக்கியங்களில் சரியானது எது?\n 1.மத்திய அரசாங்கத்தின் அதிகாரம் தேசத்தின் எல்லை முழுவதும் காணப்படுகின்றது. \n2.மாநில அரசாங்கங்களின் அதிகாரம் மாநில எல்லை மீது காணப்படுகின்றது. \n3. மத்திய அரசாங்கத்தின் அதிகாரம் தேசத்தின் எல்லைக்குள் மட்டுமே உள்ளது ', 'மத்திய அரசாங்கம் மாநில ஆளுநரின் இசைவுடன் தனது நிர்வாக பணிகளை நிறைவேற்றுமாறு மாநில அரசாங்கத்திடம் ஒப்படைக்கலாம். இம்முறைக்கு என்ன பெயர் ?', 'இந்திய கூட்டாட்சியை கூட்டுறவு கூட்டாட்சி என வர்ணித்த அமெரிக்காவின் புகழ்பெற்ற அரசமைப்பு நிபுணர் யார்?', 'மாநிலங்கள் இடையில் பரஸ்பர ஒத்துழைப்பை அதிகரிக்க யார் தலைமையில் ஒரு நிலைக் குழு உருவாக்கப்பட்டது?', 'அரசமைப்பின் எவ்வுறுப்பின்படி மாநிலங்களுக்கு இடையேயான நதி நீர் சிக்கல் சட்டம் 1956 உருவாக்கப்பட்டது?', 'நிதிக்குழு ஒரு தலைவரையும் எத்தனை உறுப்பினர்களையும் கொண்டது?', 'நிதிக்குழுவின் நான்காவது உறுப்பினர் எத்தகுதியை பெற்றவராவார்?', 'வாஸ்குலார் தாவரங்களின் வேர்களில் உள்ள பூஞ்சைகள் எவை?', 'பல செல்களால் ஆன பூஞ்சையான காளானில், மண்ணிற்கு மேல் வளரும் குடை போன்ற அமைப்பு எதன் எவ்வுறுப்பு ஆகும்?', 'கிளாமிடோமோனஸ் இல் _____ முறையிலான இனப்பெருக்கம் காணப்படுகிறது .', 'மத்திய மாநில நிதி பகிர்வில் சுங்கவரி போன்ற வரிகள் முற்றிலும் யாருக்கு ஒதுக்கப்பட்டுள்ளன?', 'தற்போது ஒன்றிய,மாநில மற்றும் பொது பட்டியல்களில் உள்ள இனங்கள் முறையே எத்தனை ?', 'பின்வரும் வாக்கியங்களை சரியானவை எவை?\n 1. வருமான வரியில் நிறுவனங்கள் மீதான வரி உள்ளடக்கப்படவில்லை\n 2.வருமான வரி மாநகராட்சி வரியை உள்ளடக்கியது\n 3.நிதிக் குழுவின் பரிந்துரையின் அடிப்படையில் வருமானவரி மத்திய மற்றும் மாநிலங்களிடையே பகிர்ந்தளிக்கப்படுகிறது', 'பின்வரும் வாக்கியங்களில் சரியானது எது?\n 1.கூட்டரசு முறையில்,ஒவ்வொரு மாநிலமும் கூட்டாட்சி நிதிக்கு சம வரி செலுத்தல்களை செய்ய வேண்டும் \n2.ஆனால் வரி செலுத்தும் திறன் ஒவ்வொரு பகுதிக்கும் சமமாக இல்லாததால் இந்த கொள்கையை பின்பற்றப்பட  இயலாது', 'மதக் கலவரங்களால் பாதிக்கப்பட்ட பகுதிகளில் மாநில அரசாங்கத்தின் ஒப்புதல் பெறாமலே மத்திய அரசு தனது காவல் படைகளை அனுப்பி அனுமதியை நிலைநாட்டலாம் என்று பரிந்துரைத்த குழு எது?', 'சட்லஜ் ஆறு பிரச்சனையில் சம்பந்தப்பட்டுள்ள மாநிலங்கள் யாவை?', 'பின்வரும் யார்,நதி நீர் தீர்ப்பாயத்தின் தலைவராகவோ அல்லது உறுப்பினராகவோ நியமிக்கப்பட முடியாது?', 'நதிநீர் ஆணையம் சட்டம் 1956 இன் கீழ் வரும் நதிகளில் மீது நடுவர் நீதிமன்றங்களை அமைக்க முடியுமா?', 'அரசமைப்பின் உறுப்பு _______ வழியாக அனைத்து இந்தியப் பணிகள் உருவாக்கப்படுகின்றன.', 'பி.வி.ராஜமன்னார் குழுவின் பரிந்துரைகள் பற்றிய வாக்கியங்களில் தவறானது எது ?\n1.மாநிலங்களுக்கு இடையேயான குழுவின் தலைவராக குடியரசுத் தலைவர் பணிபுரிய வேண்டும்\n 2.மாநில முதல்வர்கள் அல்லது அவர்களால் நியமிக்கப்பட்டவர்கள் உறுப்பினர்களாக பணியாற்றவேண்டும் 3.மாநிலங்களுக்கு இடையேயான குழுவிடம் அதிக அதிகாரங்கள் இருக்க வேண்டும் ', 'மாநில உரிமைகளை வலுப்படுத்த,  அரசியலமைப்பின் எந்தெந்த உறுப்புகளை நீக்க வேண்டும் என்று ராஜமன்னார் குழு பரிந்துரைத்தது ?', 'எத்தனை வகையான பணிகள் மட்டுமே இருக்க வேண்டும் என ராஜமன்னார் குழு பரிந்துரைத்தது ?', 'உச்சநீதிமன்றம் புகழ்பெற்ற பொம்மை வழக்கு தீர்ப்பை வழங்கிய ஆண்டு என்ன?', 'பின்வரும் எந்த சட்டதிருத்தத்தின் மூலம், கல்வி மாநிலப்பட்டியலில் இருந்து பொதுப்பட்டியலுக்கு மாற்றப்பட்டது?', ' பின்வருவனவற்றுள் மாநில சுயாட்சிக்கான பிரச்சனையாக கருதப்படுவது எது?', 'முதல் நிர்வாகச் சீர்திருத்த குழு அமைக்கப்பட்ட ஆண்டு என்ன?', 'மொரார்ஜி தேசாய்க்கு பிறகு, முதல் நிர்வாக சீர்திருத்தகுழுவின் தலைவராக இருந்தவர் யார்?', ' புன்ச்சி குழு தமது பரிந்துரைகளை அரசிடம் அளித்த ஆண்டு எது ?', 'உலக வரலாற்றில் முதல் கூட்டாட்சி அரசமைப்பு தோன்றிய நாடு எது?', 'இந்தியாவில் கூட்டாட்சி முறையில் தோற்றத்தை உருவாக்கிய சட்டம் எது?', 'இந்திய அரசியலமைப்பின் எந்தப் பகுதி கூட்டாட்சி முறையை வழங்குகிறது?', 'கூட்டாட்சி முறைக்கு எத்தன்மையிலான அரசமைப்பு இன்றியமையாததாகும் ?', 'மாநிலங்களவையில் ஒரே ஒரு இடத்தை மட்டும் பெற்றிருக்கும் மாநிலங்களில் சேராதது எது?', ' ஒரு நாட்டின் பகுதிகள் இனம்,மொழி,மதம் போன்ற காரணங்களால் பல வகை மக்களை பெற்றிருந்தால் ____ முறை அரசாங்கம் பின்பற்றப்பட வேண்டும்.', 'உச்சநீதிமன்றம் \n1. அரசமைப்பை விளக்கும் உரிமையை இது பெற்றுள்ளது 2.மத்திய மாநில உரிமைகளுக்கு இடையே முரண்பாடுகள் அல்லது சிக்கல்கள் இருந்தால் தீர்த்து வைக்கிறது \n3.கூட்டாட்சி வழக்குகளை விசாரித்து தீர்ப்பளிக்கும் அதிகாரத்தை பெற்றுள்ள அமைப்புகளில் இதுவும் ஒன்று', 'மாநிலங்களவை பற்றிய பின்வரும் கூற்றுகளில் தவறானது எது?', 'இன்ஃப்ளூயன்சா வைரஸ்-இன் வடிவம் என்ன?', 'பாக்டீரியாக்களில், புரதச்சேர்க்கையானது  எவ்வகை ரைபோசோம்களால் நடைபெறுகிறது?', 'ஒரு முனை கற்றை கசையிழை, அதாவது ஒரு முனையில் கற்றையாக கசையிழை காணப்படும் பேக்டீரியாவிற்கு எடுத்துக்காட்டு எது?', 'பாக்டீரியாக்களில் புரத உற்பத்தி மையங்களாக விளங்குபவை எவை?', 'பொதுப் பட்டியலில் உள்ள அதிகாரத்தில் மத்திய மாநில அரசுகளுக்கு இடையே முரண்பாடுகள் ஏற்பட்டால் எதனுடைய சட்டமே செல்லுபடியாகும்?', 'மூன்று பட்டியல்களின் மூலம் அதிகாரப்பகிர்வை வழங்குவதில் நமது அரசமைப்பு, எந்த சட்டத்தை பின்பற்றுகிறது?', 'இதுவரை எத்தனை நிதி குழுக்கள் அமைக்கப்பட்டுள்ளன?', ' குடியரசுத் தலைவர் பொதுநலனுக்காக மாநிலங்களுக்கு இடையேயான குழுவை உருவாக்கலாம் என்று கூறும் அரசமைப்பின் உறுப்பு எது?', 'மண்டல குழுக்கள் எந்த சட்டத்தின் மூலம் தோற்றுவிக்கப்பட்டன?', 'திட்டக் குழுவுக்கு மாற்றாக உருவாக்கப்பட்ட நிதி ஆயோக்கின் தலைவர் யார்?\n', 'முதல் நிதி குழு எப்போது அமைக்கப்பட்டது?\n', 'சமவெளி மாநிலங்களுக்கு இடையேயான நதிநீர் குறைகளை ஒழுங்குபடுத்துவது, பின்வரும் எந்த சட்டத்தின் நோக்கம் ஆகும் ?\n', 'ஒரு செல் பூஞ்சைகளுக்கு எடுத்துக்காட்டு எது?\n', 'ஈஸ்ட் ஆனது அனைத்து வகையான_____ ஊடகங்களிலும் வளர்கின்றன.\n', 'வைரஸ்கள் செல்லுக்கு வெளியே காணப்படுமேயானால், அவை_______ என்றழைக்கப்படுகின்றன .\n\n', 'புரோட்டோசோவா என்றால் கிரேக்க மொழியில் என்ன பொருள்?\n', 'பின்வரும் வாக்கியங்களில் தவறானது எது?\n', 'பின்வருவனவற்றுள் மத்திய அரசிற்கு வருமானம் தரும் வழி அல்லாதது எது?\n\n', 'மத்திய அரசால் விதிக்கப்பட்டு, ஆனால் மாநில அரசு வசூலிப்பது மற்றும் பயன்படுத்துவது பற்றி குறிப்பிடும் அரசியலமைப்பு உறுப்பு எது?', 'மகாதயி ஆற்று பிரச்சினையில் சம்பந்தப்பட்டுள்ள மாநிலங்களில் சேராதது எது?\n\n', 'மாநிலங்களுக்கு இடையேயான நதிநீர் பிரச்சினைகள் தீர்ப்பதற்கு வழிமுறையை வழங்கும் அரசமைப்பு உறுப்பு எது?\n', ' நதிநீர் சிக்கல்கள் சட்டம் 1956 இன் படி காவிரி நதிநீர் நடுவர் மன்றம் மத்திய அரசால் அமைக்கப்பட்ட ஆண்டு என்ன?\n', 'காவிரி நடுவர் மன்றம் தனது தீர்ப்பை அமல்படுத்துவதற்கு _______வாரியத்தை உருவாக்க வேண்டும் என்று கூறியது.\nA) காவிரி மேலாண்மை\nB) காவிரி நடுவண்\nC)காவிரி செயலாக்கம்\nD)ஏதுமில்லை', 'நமது நாட்டின் நிர்வாக சீர்திருத்தங்களுக்காக இதுவரையில் எத்தனை நிர்வாக சீர்திருத்தங்கள் குழுக்கள் அமைக்கப்பட்டுள்ளன?\n', 'முதல் நிர்வாக சீர்திருத்த குழு முதலில் யார் தலைமையில் அமைக்கப்பட்டது?\n', 'இரண்டாவது நிர்வாக சீர்திருத்தங்கள் குழு அமைக்கப்பட்ட ஆண்டு எது ?\n', 'அரசமைப்பு உறுப்பு 263 பிரிவு ______ இன் அதிகாரம் மாநிலங்களுக்கு இடையேயான குழுவிடம் வழங்கப்படக் கூடாது என சர்க்காரியா குழு பரிந்துரைத்தது.\n', 'பின்வருவனவற்றுள் நதிநீர் பங்கீட்டு பிரச்சினை ஏதும் இல்லாத மாநிலம் எது ?\n', 'மெட்ராஸ் மாகாணத்திற்கும்,மைசூர் அரசுக்கும் இடையேயான ஒப்பந்தம் காலாவதியான  ஆண்டு எது?\n', 'இந்திய அரசமைப்பின் எந்த உறுப்பில் அரசமைப்பை மாற்றுவதற்கான சிறப்பு திருத்தச் சட்ட முறைகள் வழங்கப்பட்டுள்ளது?\n', 'கூட்டாட்சி முறையின் நடுவணாகவும், அரசமைப்பின் பாதுகாவலனாகவும் விளங்குவது  எது ?\n', 'அரசமைப்பின் ____ - வது உறுப்பின் கீழ் புதிய அனைத்து இந்திய பணிகளை உருவாக்கும் அதிகாரம் மாநிலங்களவைக்கு வழங்கப்பட்டுள்ளது .\n', 'போர், அந்நிய ஆக்கிரமிப்பு, ஆயுதமேந்திய கிளர்ச்சி போன்றவைகள் இந்தியாவின் ஒற்றுமையை பாதித்தால்,அரசமைப்பின் எவ்வுறுப்பை  பயன்படுத்தி குடியரசுத் தலைவர் தேசிய அவசர காலத்தை பிறப்பிக்கலாம்?\n', 'அரசமைப்பின் கருத்துக்களை மாற்றுவதற்கு அரசியல் சாசன திருத்த சட்டம் முறையோ அல்லது தனி அமைப்போ உள்ள அரசமைப்புகளுக்கு என்ன பெயர்?\n', 'தன்னிச்சையான சூழ்நிலையில் வைரஸ்கள் எவ்வாறு காணப்படுகின்றன?\n', 'பூமியில் முதன் முதலில் தோன்றிய வாழும் உயிரினமாக கருதப்படுபவை?\n\n', 'ஒளிச்சேர்க்கையின் மூலம் தனது உணவை தானே தயாரித்துக் கொள்ளும் ஒளிச்சேர்க்கை பாக்டீரியாவுக்கு எடுத்துக்காட்டு எது?\n', 'முதன் முதலில் நுண்ணோக்கியை வடிவமைத்தவர் யார்?\n', 'குடியரசுத் தலைவர் தேசிய அவசரகால சட்டத்தை பிறப்பித்தால், மாநில அதிகாரங்கள்  மீது சட்டமியற்றும் அதிகாரத்தை பெறுவது எது?\n', 'மாநில அரசிடமே இருக்கும் எத்தனை ஆண்டுகளுக்கு ஒருமுறை ,குடியரசுத்தலைவர் ஒரு நீதி குழுவை அமைக்கிறார்?\n\n', 'மாநிலங்களுக்கு இடையேயான குழுவின் தலைவராக இருப்பவர் யார் ?\n\n', 'மண்டல குழுக்களின் நோக்கம் கூட்டுறவு கூட்டாட்சி வழக்கத்தை வளர்ப்பது என்றவர் யார் ?\n', 'இந்தியாவின் மாற்றத்திற்கான தேசிய குழு என்பது பின்வரும் எதன்  பொருள் ஆகும் ?\n', 'இரண்டு அல்லது இரண்டிற்கு மேற்பட்ட மாநிலங்கள் தங்களின் நன்மை கருதி ஒரு குறிப்பிட்ட அதிகாரத்தில் மத்திய அரசு தங்களுக்கான பொதுச் சட்டத்தை நிறைவேற்றி தருக என கோரினால், அச்சட்டத்தை நிறைவேற்றி தருவது எது (அ) யார்?\n', 'பல செல்களால் ஆன பூஞ்சைக்கு எடுத்துக்காட்டு எது?\n', 'பூஞ்சைகளைப் பற்றிய படிப்பு எது?\n', 'பூஞ்சைகளின் உடலம் பொதுவாக எவ்வாறு அழைக்கப்படுகிறது ?\n', 'அரசமைப்பு உறுப்பு 262 இன் நோக்கம் என்ன ?\n', 'நதிநீர் பிரச்சனையில் இரு மாநிலங்களுக்கு இடையேயான பேச்சுவார்த்தை முயற்சிகள் தோல்வி அடைந்தால், குறிப்பிட்ட நதிநீர் பிரச்சனையை  தீர்ப்பதற்கு ஒரு தீர்ப்பாயத்தை அமைப்பது எது?\n\n', 'நதிநீர் தீர்ப்பாயத்தின் தலைவர் மற்றும் உறுப்பினரை நியமிப்பவர் யார்?\n', 'அரசமைப்பின் எவ்வுறுப்பு உடனடியாக அமல்படுத்தப்பட வேண்டும் என ராஜமன்னார் குழு பரிந்துரைத்தது?\n', 'ஆர்.எஸ்.சர்க்காரியா குழு அமைக்கப்பட்ட ஆண்டு என்ன?\n\n', 'பின்வரும் வாக்கியங்களில் சரியானது எது?\n1. சர்க்காரியா குழுவும், மாநிலங்களுக்கு இடையேயான குழு அமைக்கப்பட  வேண்டும் என்று பரிந்துரைத்தது\n2. சர்க்காரியா குழு  உறுப்பு  356 ஐ கவனமாகவும் குறைவாகவும் பயன்படுத்தப்பட வேண்டும் என்று பரிந்துரைத்தது.\n\n', 'பின்வரும் எந்த நாட்டில்,மாநிலங்கள் தங்களுக்கான தனியான அரசமைப்பை பெற்றுள்ளன?\n', 'நெகிழும் அரசமைப்பு காணப்படும் நாடு எது?\n', 'எந்த நாட்டின் உச்சநீதிமன்றம், தனது நாட்டின் கூட்டாட்சியை,“ உடைக்க முடியாத மாநிலங்களால் உருவாக்கப்பட்ட உடைக்க முடியாத நாடு” என்று கூறுகிறது?\n\n', 'சென்னை, கல்கத்தா, மும்பை ஆகிய பிரதேசங்களை ______ இல் உள்ள கவர்னர் ஜெனரலின் ஆளுமையின் கீழ் ஒழுங்குமுறை சட்டம் 1773 கொண்டுவந்தது.\n', 'பின்வரும் வாக்கியங்களில் சரியானது எது ?\n1.கூட்டாட்சி முறையில் ஓரவை நாடாளுமன்றம் காணப்படுகிறது 2.இந்தியாவில் மட்டும் விதிவிலக்காக ஈரவை நாடாளுமன்றம் உள்ளது\n\n', 'அடினோ வைரஸ், ரெட்ரோ வைரஸ், இன்ஃப்ளூயன்சா வைரஸ் ஆகியவை?\n', 'வைரஸிலுள்ள புரத உறையற்ற தீங்களிக்கும் ஆர்.என்.ஏ _____எனப்படும்.\n', 'கோல் அல்லது குச்சி வடிவ பாக்டீரியாக்கள் எவ்வாறு அழைக்கப்படுகின்றன ?\n', 'சுருள்வடிவ /திருகு வடிவ பாக்டீரியாக்கள் எவ்வாறு அழைக்கப்படுகின்றன?\n', 'அரசமைப்பின் 356 உறுப்பின்படி அவசர காலத்தை ஒரு மாநிலத்தில் பிறப்பித்தால் அந்த மாநிலத்திற்கான சட்டங்களை நாடாளுமன்றம் இயற்றலாம் என அதிகாரம் வழங்குபவர் யார்?\n', 'நிதிக்குழுவின் அமைப்பை விவரிக்கும் அரசமைப்பின் உறுப்பு எது ?\n', 'பின்வருவனவற்றுள் தவறான பதம் எது?\n', 'வளிமண்டலத்தில் தன்னிச்சையாக காணப்படும் பூஞ்சை எது ?\n', 'ஸ்டான்லி பி.ப்ரூய்ஸ்னர் என்பவர் 1982ஆம் ஆண்டு _______என்ற பதத்தினை உருவாக்கினார்.\n', 'கிளாமிடோமோனாஸ் நகரும் திறன் உடைய ______ பாசி ஆகும் .\n', 'பின்வருபவைகளில் வழக்கில் இல்லாத வருமானவரி பகிர்வு எது?\n\n', ' பின்வருவனவற்றுள் மத்திய அரசுக்கு வருமானம் தரும் வழி அல்லாதது எது?\n\n', 'ஈஸ்டில் நடைபெறும் சுவாசம் எது?\n\n', 'ஒரு செல்லால் ஆன பூஞ்ஜைகளில் எவ்வாறு இனப்பெருக்கம் நடைபெறுகிறது?\n\n', 'காளான்களின் வளர்ச்சிக்கு தேவையான சத்துக்களை கடத்துவதில் உதவுபவை ?\n', 'விரியானில் உள்ள வெளிப்புற புரத உறை எவ்வாறு அழைக்கப்படுகிறது?\n', 'ஆல்காக்களை பற்றி படிக்கும் பிரிவு எது?\n\n', 'புரோட்டோசோவா எவ்வகையைச் சேர்ந்தது?\n', 'போலி கால்களால் இடம்பெயரும் “சூடோபோடியா” வகை புரோட்டோசோவாவிற்கு எடுத்துக்காட்டு எது?\n', 'அமீபாவின் போலிக்கால்கள் எதன் நீட்சி அடைந்த பகுதி ஆகும்?\n', 'அதிகாரப் பகிர்வுக்கான மத்தியப்பட்டியலில் உள்ள இனங்களில் சேராதது எது?\n', 'மத்திய அரசால் விதிக்கப்பட்டு, வசூலிக்கப்பட்டு மாநிலங்களுக்கு ஒதுக்கக்கூடிய வளங்களை பற்றி குறிப்பிடும் அரசியலமைப்பு உறுப்பு எது ?\n\n\n\n\n\n\n\n\n', 'உச்சநீதிமன்றத் தீர்ப்பின்படி தமிழ்நாடு எத்தனை டி.எம்.சி தண்ணீரை கர்நாடகத்திலிருந்து எல்லைப் பகுதியில் பெறும்?\n', 'மாநில ஆளுநர்கள் கூட்டாட்சி முறைக்கு எதிராக இருப்பதாக விமர்சித்த குழு எது?\n', ' பி.வி.ராஜமன்னார் குழு, தங்களது பரிந்துரைகளை அரசாங்கத்திடம் சமர்பித்த ஆண்டு என்ன?\n', 'புன்ச்சி குழு அமைக்கப்பட்ட ஆண்டு?\n', 'நீதியரசர் நாராயணராவ் வெங்கட செல்லையா தலைமையில் அரசமைப்பு மதிப்பாய்வு தேசிய குழு(NCRWC) அமைக்கப்பட்ட ஆண்டு என்ன?\n\n\n\n\n\n\n\n\n', 'அரசமைப்பின் எவ்வுறுப்புகள் மாநிலங்களை மாற்றவும் புதிய மாநிலங்களை உருவாக்கவும் வழிமுறையை வழங்குகின்றன?\n', 'முன்பு இந்தியாவுடன் ஒரு “இணை மாநிலம்” என்று அழைக்கப்பட்ட மாநிலம் எது?\n', 'அரசமைப்பின் 249 வது உறுப்பின் படி, ஒரு அதிகாரத்தை மாநில பட்டியலில் இருந்து மத்திய பட்டியலுக்கு நாடாளுமன்றத்தின் எந்த அவையால் மாற்றமுடியும்?\n', 'பின்வரும் வாக்கியங்களில் தவறானது எது?\n', 'மாநில அரசாங்கங்கள் ஆல் தோற்றுவிக்கப்பட்ட மட்டுமே நாம் ஒரு அமைப்பை கூட்டாட்சி முறை என்று கூறலாம்?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n', 'நிதிக்குழுவின் நான்கு உறுப்பினர்களில், எத்தனை உறுப்பினர்கள் நிதி நிர்வாகம், பொருளாதாரம்,பொது கணக்குகள் மற்றும் அரசு நிதி துறை ஆகியவற்றில் நிபுணத்துவம் பெற்றிருப்பார்கள்?\n', 'எந்த குழுவின் பரிந்துரையின்படி, 1990-களில் கூட்டாட்சி முறையில் உள்ள அரசாங்கங்கள் இடையே எல்லா துறைகளிலும் பரஸ்பர ஒத்துழைப்பை அதிகரிப்பதற்காக மாநிலங்களுக்கு இடையேயான குழு தோற்றுவிக்கப்பட்டது?\n', 'மாநிலங்களுக்கு இடையேயான நதிகளை மேலாண்மை செய்வதற்கும் மாநிலங்களுக்கு பரிந்துரைகள் வழங்குவதற்கும் நதி ஆணையத்தை உருவாக்கிய சட்டம் எது?\n', 'நாசாவின் இடைக்கால தலைமை பணிக்குழு ஒருங்கிணைப்பு அதிகாரியாக நியமிக்கப்பட்டுள்ள இந்திய வம்சாவளி யார்?\n\n', 'கணக்குத் தணிக்கையாளர் தேர்வில் அகில இந்திய அளவில் முதல் மதிப்பெண் பெற்று சாதனை படைத்துள்ள இசக்கி ராஜா எவ்வூரைச் சேர்ந்தவர் ?\n', '“சிவாலிக் ஆர்போரேட்டம்” என்ற பெயரில் அம்மாநிலத்தின் முதல் தாவரவியல் பூங்காவை திறந்துள்ள மாநிலம் எது?\n', 'நாட்டில் மிகவும் இளம் வயதில் விமானியாக ஆன பெண் என்ற பெருமையை _____ஐ சேர்ந்த ஆயிஷா அஜீஸ் பெற்றுள்ளார்.\n', 'டிஜிட்டல் வடிவில் பட்ஜெட் தாக்கல் செய்யும் முதல் இந்திய மாநிலம் எது ?\n', 'உலக ஈர நிலங்கள் தினம் என்று அனுசரிக்கப்பட்டது?\n', 'ஒரு பள்ளியில் உள்ள மொத்த மாணவர்களின் எண்ணிக்கை 800. அவர்கள் பள்ளிக்குச் செல்லும் பயண முறை கீழ்க்கண்டவாறு வரையறுக்கப்பட்டுள்ளது. அவர்களில் எத்தனைபேர் பள்ளிக்கு நடந்து செல்லவில்லை?\n', 'கொடுக்கப்பட்டுள்ள படத்தில் E-ன் கோண அளவு என்ன?\n', 'ரூ.9000 மாத சம்பளத்தில் ஒருவர் கீழ்க்கண்டவாறு பணத்தை செலவு செய்தால், அவர் மருத்துவ செலவிற்காக பயன்படுத்திய தொகையின் சதவீதம் காண்க?\n', 'Direction: கேள்வி எண்கள் 194 மற்றும் 195 ஆகியவை பின்வரும் விளக்கப்படத்தின்(chart)அடிப்படையில் அமைந்துள்ளன.B1,B2,B3,B4,B5,B6 ஆகிய புத்தக வெளியீட்டு நிறுவனங்களின் 2016 மற்றும் 2017 ஆகிய ஆண்டுகளில் நிறுவனங்களின் விற்பனை செய்யப்பட்ட புத்தகங்களின் விவரங்கள் கொடுக்கப்பட்டுள்ளன\n\nB3- இன் இரண்டு ஆண்டுகள் விற்பனையில் B6-இன் இரண்டு ஆண்டுகள் விற்பனை எத்தனை சதவீதம் ஆகும்?\n\n\n', 'Direction: கேள்வி எண்கள் 194 மற்றும் 195 ஆகியவை பின்வரும் விளக்கப்படத்தின்(chart)அடிப்படையில் அமைந்துள்ளன.B1,B2,B3,B4,B5,B6 ஆகிய புத்தக வெளியீட்டு நிறுவனங்களின் 2016 மற்றும் 2017 ஆகிய ஆண்டுகளில் நிறுவனங்களின் விற்பனை செய்யப்பட்ட புத்தகங்களின் விவரங்கள் கொடுக்கப்பட்டுள்ளன\nB2 மற்றும் B4 ஆகிய நிறுவனங்களில் இரண்டு ஆண்டுகளிலும் விற்பனையான மொத்த புத்தகங்களின் விகிதம் காண்க?\n', 'Direction: கேள்வி எண்கள் 196 ,197 மற்றும் 198 ஆகியவை பின்வரும் விளக்கப்படத்தின்(chart) அடிப்படையில் அமைந்துள்ளன.\n\n8 ஆண்டுகளின் சராசரி உற்பத்தியை விட எத்தனை ஆண்டுகளில் உற்பத்தி அதிகமாக இருந்தது?\n\n\n', '\nDirection: கேள்வி எண்கள் 196 ,197 மற்றும் 198 ஆகியவை பின்வரும் விளக்கப்படத்தின்(chart) அடிப்படையில் அமைந்துள்ளன.\n2007-2008 - இல் உற்பத்தி குறைவின் சதவீதம் எவ்வளவு?\n', 'Direction: கேள்வி எண்கள் 196 ,197 மற்றும் 198 ஆகியவை பின்வரும் விளக்கப்படத்தின்(chart) அடிப்படையில் அமைந்துள்ளனமுந்தைய ஆண்டுடன் ஒப்பிடும்போது உற்பத்தி சதவீதம் எந்த ஆண்டு அதிகரித்துள்ளது ?\n', 'கீழ்கண்ட வரைபடம் ஒரு நகரத்தில் வசிக்கும் கல்வியறிவு உடைய, கல்வியறிவு அற்ற ஆண்கள் மற்றும் பெண்கள் சதவிகிதத்தை குறிக்கிறது. மொத்த எண்ணிக்கை=250000. கல்வி அறிவு உடைய ஆண்களுக்கும் கல்வி அறிவு உடைய பெண்களுக்கும் இடையேயான வேறுபாடு எவ்வளவு ?\n', 'கொடுக்கப்பட்டுள்ள வரைபடம் ஆனது ஒரு கிராமத்தில் ஒரு ஆண்டில் பயிரிடப்பட்ட பல வகையான பயிர்களின் பரப்பளவு விவரங்கள் ஆகும். மொத்த பரப்பளவு = 1080ஏக்கர். நெல் பயிரிட ஒரு ஏக்கருக்கு ரூ.1000 செலவாகிறது. எனில் நெல் பயிரிட ஆகும் மொத்த செலவை காண்க ?\n']

a = ['A)பல மாநிலங்கள் ஒரே இனம் ', 'A)நாடாளுமன்றத்தின் மேலவை', 'A)1 மட்டும்', 'A) 21 ',
     'A) ஜவஹர்லால் நேரு', 'A) ஒழுங்குமுறைச் சட்டம் 1773', 'A) பத்தாவது ', 'A) 3 மாதங்களுக்கு', 'A) 75 & 76 ', 'A)லத்தீன் ', 'A) புகையிலை மொசைக் வைரஸ்', 'A)காற்று சுவாச பாக்டீரியா &  காற்றில்லா சுவாச பாக்டீரியா', 'A) சட்டமன்ற அதிகாரப் பகிர்வு, ஆட்சித்துறை அதிகாரப் பகிர்வு & நிதி  அதிகாரப் பகிர்வு', 'A)மத்திய அரசு ', 'A)கால் அளவு கூட்டாட்சி கொள்கை', 'A) 1962 ', 'A) 3 ', 'A) குடியரசுத் தலைவர் ', 'A) ஒன்று', 'A)1 மட்டும்', 'A) புரோகேரியாட்டிக் ', 'A) சைமேஸ் ', 'A) மைட்டோகாண்ட்ரியா', 'A) பூஞ்சை உலகம் ', 'A) முத்திரை வரி ', 'A) ஆறாவது அட்டவணை', 'A) 1,3 & 5 மட்டும்  ', 'A) 270 & 271', 'A) 1 ', 'A) சுதந்திரம், சமத்துவம் &  ஒரே மாதிரியான தன்மை', 'A) சர்க்காரியா குளு ', 'A) நதிநீர் சிக்கல்கள் சட்டம் 1950 ', 'A) 1919 ', 'A) ராஜகோபாலச்சாரி ', 'A)மாநில முதலமைச்சர்களை', 'A)1 மட்டும் ', 'A)Aபி.சிவராமன்', 'A)சொல்லக்கூடாத வார்த்தை', 'A) 2000 ', 'A) 534 ', 'A) அரசியலமைப்பு', 'A) 1 ', 'A) மூன்றில் ஒரு பங்கு பெரும்பான்மை ', 'A) மாநில அரசுகள் ', 'A) பேராசிரியர் வேர் ', 'A) ஒழுங்குமுறைச் சட்டம் 1773 ', 'A) ஜவஹர்லால் நேரு', 'A)சாதாரண சட்டம்', 'A) 12 ', 'A) நமது அரசமைப்பு சமமற்ற அதிகார பகிர்வை உருவாக்கியுள்ளது என மாநிலங்கள் குற்றம் சுமத்துகின்றன.', 'A) 352 முதல் 360 வரை', 'A)மாநில தேர்தல் ஆணையம் ', 'A) டெலஸ்கோப்', 'A) T4-பேக்டீரியாபேஜ் ', 'A) அலர்ச்சிதன்மை உள்ள திரவம்', 'A)1 மட்டும்', 'A)அதிகார மாற்று முறை', 'A) கிரான்வில் ஆஸ்டின் ', 'A) குடியரசுத் தலைவர் ', 'A) 192 ', 'A) 2 ', 'A)மாநிலங்களவை உறுப்பினர்', 'A) மைக்கோரைசா ', 'A) இலை உறுப்பு ', 'A)பால் ', 'A) மத்திய அரசு ', 'A) 100, 61, 52', 'A) 1 & 2 ', 'A)  1 மட்டும்', 'A) வேங்கட செல்லையா குழு', 'A) கோவா & மகாராஷ்டிரா', 'A) உச்ச நீதிமன்ற நீதிபதிகள் ', 'A) முடியும் ', 'A) 312 ', 'A)1மட்டும்  ', 'A) 256, 257, 356(2) ', 'A) 1 ', 'A) 1994 ', 'A) 41 ', 'A) கல்வி இடமாற்றம் & அனைத்திந்திய பணிகள்', 'A) 1956 ', 'A) கே.அனுமந்தையா ', 'A) 2008 ', 'A) இந்தியா ', 'A) ஒழுங்குமுறைச் சட்டம் 1773 ', 'A) IV ', 'A)எழுதப்பட்ட ', 'A) அசாம் ', 'A) சுயாட்சி ', 'A)1மட்டும் தவறு ', 'A) நாடாளுமன்றத்தின் மேலவை மாநில உரிமைகளின் பாதுகாவலனாக பணியாற்றுகிறது', 'A) கோள வடிவம் ', 'A) 50 S ', 'A) சூடோமோனாஸ் ', 'A) சைட்டோபிளாசம் ', 'A) மத்திய அரசு ', 'A) இந்திய ஒழுங்குமுறை சட்டம் 1773 ', 'A) 12 ', 'A) 193 ', 'A) இந்திய அரசமைப்புச் சட்டம் 1935 ', 'A) நிதி அமைச்சர்', 'A) 1950 நவம்பர் 22 ', 'A)நதி ஆணையங்கள் சட்டம் 1956', 'A) ஈஸ்ட்', 'A) உப்பு', 'A)விரியான்', 'A) முதல் கிருமி', 'A) மத்திய அரசாங்கம் தனக்கான வணிக மற்றும் தொழில் நிறுவனங்களை நடத்தி வருமானத்தை ஈட்ட முடியாது', 'A) தொழில் நிறுவனங்கள் மீதான வரி', 'A) 269 ', 'A) கோவா', 'A) 168', 'A) 1988', 'A) காவிரி மேலாண்மை', 'A)  1', 'A) கே.அனுமந்தையா', 'A) 1987', 'A) 263 (A)', 'A)ஒடிசா', 'A) 1950', 'A) 348', 'A)மக்களவை', 'A) 212', 'A) 352', 'A) நெகிழும் அரசமைப்பு முறை', 'A) தீவிரமாக செயல்படும் நிலையில்', 'A) பூஞ்சைகள்', 'A) சயனோ பாக்டீரியா', 'A) எட்வர்ட் ஜென்னர்', 'A) ராஷ்ட்ரிய பவன்', 'A) ஒவ்வொரு ஆண்டிற்கும்', 'A)குடியரசுத் தலைவர்', 'A)அண்ணல் அம்பேத்கர்', 'A)நிதி ஆயோக்', 'A) குடியரசுத் தலைவர்', 'A) ஈஸ்ட்', 'A) மைகாஸிஸ்', 'A)குச்சி', 'A)நீதிமன்றம் மூலம் நதி நீர்ப் பிரச்சனையை தீர்ப்பது', 'A) உச்சநீதிமன்றம்', 'A) மாநிலங்களவை தலைவர்', 'A) 163', 'A) 1981', 'A) 1 மட்டும்', 'A) இந்தியா', 'A) ரஷ்யா', 'A) இங்கிலாந்து', 'A) சென்னை', 'A) 1 மட்டும்', 'A) தாவர வைரஸ்', 'A) வீராய்டு', 'A)ஸ்பைரில்லா', 'A)ஸ்பைரில்லா', 'A) ஆளுநர்', 'A) 180', 'A) தென்மேற்கு மண்டல குழு', 'A)ஈஸ்ட்', 'A) ஃபங்கி', 'A) உவர்நீர் வாழ்', 'A) மத்திய அரசாங்கத்திற்கு ஒதுக்கப்பட்ட வரிகள்', 'A) புகையிலை மற்றும் இந்தியாவில் உற்பத்தி செய்யப்படும் ஏனைய பொருட்களுக்கான கலால் வரி', 'A) காற்று சுவாசம்', 'A) இரண்டாகப் பிளத்தல்', 'A)மைசீலியம்', 'A) என்கேப்சுலேசன்', 'A) பைகாலஜி', 'A) ஒரு செல் புரோகேரியாட்டிக்', 'A) அமீபா', 'A) உட்கரு', 'A) பாதுகாப்புத்துறை', 'A) 269', 'A) 277.25 டி.எம்.சி அடிகள்', 'A) புன்ச்சி குழு', 'A) 1970', 'A) 2003', 'A) 2010', 'A) 1 & 2', 'A) அசாம்', 'A) மக்களவை', 'A) உச்ச நீதிமன்றத்தின் கீழ் உயர்நீதிமன்றம் மற்றும் கீழமை நீதிமன்றங்கள் இயங்குகின்றன', 'A) மத்திய அரசால்', 'A) ஒன்று', 'A) ராஜமன்னார் குழு', 'A) நதி ஆணையங்கள் சட்டம் 1956', 'A) பவ்யா லால்', 'A)தஞ்சாவூர்', 'A) உத்திரப் பிரதேசம்', 'A) காஷ்மீர்', 'A)கர்நாடகா', 'A) பிப்ரவரி 1', 'A) 120', 'A) 15°', 'A) 10%', 'A) 68.54%', 'A) 2:3', 'A) 1 ஆண்டு', 'A) 33 1/3%', 'A) 2012', 'A) 75000  பேர்', 'A) 215000']

b = ['B)ஒரே நாடு ஒரே இனம் ', 'B)நாடாளுமன்றத்தின் கீழவை ', 'B)2 மட்டும் ', 'B) 31', 'B) சர்தார் பட்டேல் ',
     'B) இந்திய அரசுச் சட்டம் 1909', 'B)பதினைந்தாவது', 'B) 6 மாதங்களுக்கு ', 'B) 76 & 78', 'B)பிரஞ்சு', 'B) முள்ளங்கி மொசைக் வைரஸ்', 'B)சுவாச பாக்டீரியா & சுவாசமில்லா பாக்டீரியா ', 'B) சட்டமன்ற அதிகாரப் பகிர்வு, ஆட்சித்துறை அதிகாரப் பகிர்வு & நீதித்துறை அதிகாரப் பகிர்வு', 'B)மாநிலங்கள் ', 'B)அரை அளவு கூட்டாட்சி கொள்கை', 'B) 1971 ', 'B) 4 ', 'B)மாநிலங்களவை சபாநாயகர் ', 'B) இரண்டு ', 'B) 2 மட்டும்', 'B)யூகரியோடிக் ', 'B)தைமஸ் ', 'B) ரைபோசோம்கள்', 'B)மொனிரா ', 'B)மது கலந்த மருந்து பொருட்களின் மீதான கலால் வரி', 'B) ஏழாவது அட்டவணை ', 'B) 1,2,3 & 4மட்டும்  ', 'B) 269 & 271', 'B) 2 ', 'B) சகோதரத்துவம், தனி ஆளுகை &  வெளிப்படைத்தன்மை', 'B)புஞ்சி குளு ', 'B)நதிநீர் சிக்கல்கள் சட்டம் 1956 ', 'B) 1921 ', 'B)காமராஜர் ', 'B) மாநிலங்களவையை', 'B)2 மட்டும்', 'B)ஆர்.எஸ்.எஸ்.சென்', 'B) அத்தியாவசியமற்ற வார்த்தை ', 'B) 1998 ', 'B) 247 ', 'B) மத்திய அரசாங்கம் ', 'B) 2 ', 'B)ஆறில் ஒரு பங்கு பெரும்பான்மை ', 'B)மத்திய அரசு ', 'B)அலெக்ஸாண்ட்ராவிக்ஸ்  ', 'B)இந்திய அரசுச் சட்டம் 1909 ', 'B) மகாத்மா காந்தி ', 'B) சிறப்புச் சட்டம் ', 'B) 13 ', 'B) மத்திய அரசிற்கு சாதகமாகவும், மாநிலங்களுக்கு எதிராகவும் அதிகாரப்பகிர்வு உள்ளதாக பல மாநிலங்கள் கூறுகின்றன.', 'B) 354 முதல் 360 வரை', 'B)தேசிய தேர்தல் ஆணையம்', 'B) டிஜிட்டல் கேமரா', 'B)கோவிட் -19', 'B) கெடுதல் விளைவிப்பவை ', 'B) 1,3 மட்டும்', 'B) பணி ஒப்படைப்பு முறை ', 'B)மோரிஸ் டி மோரிஸ் ', 'B)குடியரசுத் துணைத் தலைவர் ', 'B) 202 ', 'B) 3 ', 'B) ஆளுநர்', 'B)பக்சீனியா ', 'B)தண்டு உறுப்பு', 'B)பாலிலா', 'B)மாநில அரசு  ', 'B) 98, 59, 52 ', 'B) 2 & 3', 'B) 2 மட்டும்', 'B) புஞ்சி குழு ', 'B) பஞ்சாப் & ஹரியானா ', 'B)உயர்நீதிமன்ற நீதிபதிகள்', 'B)முடியாது', 'B) 314 ', 'B)2 மட்டும்  ', 'B) 256, 287, 339(2)', 'B) 2 ', 'B) 1998 ', 'B) 42 ', 'B) ஆளுநரின் நியமனம் &  உறுப்பு 356', 'B) 1950 ', 'B)பி.சந்திர ரெட்டி ', 'B) 2009 ', 'B)ஆஸ்திரேலியா ', 'B)அரசியலமைப்பு சட்டம் 1935 ', 'B) V ', 'B)பெற்றுக்கொள்ளப்பட்ட', 'B)மணிப்பூர் ', 'B)அதிபர் ', 'B)2 மட்டும் தவறு', 'B) மாநிலங்களவை மாநிலங்களின் பிரதிநிதிகளால் உருவாக்கப்படுகிறது', 'B)உருளை வடிவம்', 'B) 60 S ', 'B)கோரினிபாக்டீரியம் டிப்தீரியா', 'B)நியூக்ளியாய்டு ', 'B)மாநில அரசு ', 'B)இந்திய அரசாங்கச் சட்டம் 1909 ', 'B) 13 ', 'B) 203 ', 'B)இந்திய அரசமைப்புச் சட்டம் 1950 ', 'B) உள்துறை அமைச்சர்', 'B) 1947 நவம்பர் 22 ', 'B) நதி நீர் சிக்கல் சட்டம் 1956', 'B)பென்சிலியம்', 'B)அமிலம்', 'B)பிரியான்', 'B)ஆபத்தான கிருமி', 'B) மாநில அரசாங்கங்கள் தங்களுக்கென ஒதுக்கப்பட்ட வணிக, தொழில் நிறுவனங்கள் மூலமாக வருமானத்தை ஈட்டிக் கொள்ளலாம்', 'B) பணம்,நாணயங்கள் மற்றும் அன்னிய செலவாணி', 'B) 268', 'B)உத்தரப்பிரதேசம்', 'B) 234', 'B) 1991', 'B) காவிரி நடுவண்', 'B) 2', 'B)பி.சந்திர ரெட்டி', 'B) 1996', 'B) 263 (B)', 'B)ஆந்திரப் பிரதேசம்', 'B) 1947', 'B) 368', 'B)மாநிலங்களவை', 'B) 312', 'B) 358', 'B) நெகிழா அரசமைப்பு முறை', 'B)முடுக்கிவிடப்பட்ட செயல்படும் நிலையில்', 'B) அமிபாக்கள்', 'B)எ.கோலை', 'B)டிமிட்ரி ஐவனோவஸ்கி', 'B)பிரதமர்', 'B)ஒவ்வொரு மூன்றாண்டிற்கும்', 'B)குடியரசுத் துணைத் தலைவர்', 'B)ஜவஹர்லால் நேரு', 'B)திட்ட கமிஷன்', 'B)மக்களவை', 'B)பென்சிலியம்', 'B)ஃபங்காசிஸ்', 'B)தாலஸ்', 'B) நாடாளுமன்ற சட்டத்தின் மூலம் நதி நீர்ப் பிரச்சனையை தீர்ப்பது', 'B)மத்திய அரசு', 'B)குடியரசுத் தலைவர்', 'B) 263', 'B) 1983', 'B)2 மட்டும்', 'B)பாகிஸ்தான்', 'B)அமெரிக்கா', 'B)ரஷ்யா', 'B)மும்பை', 'B) 2 மட்டும்', 'B)விலங்கு வைரஸ்', 'B)பேஜ்', 'B)கோக்கை', 'B)கோக்கை', 'B)குடியரசுத்தலைவர்', 'B) 198', 'B)வடகிழக்கு மண்டல குழு', 'B)பென்சிலியம்', 'B)ஆல்கே', 'B)கடல்நீர் வாழ்', 'B) மத்திய அரசால் விதிக்கப்பட்டு மாநில அரசால் வசூலிக்கப்படும் வரிகள்', 'B) வேளாண்மை நிலங்கள் தவிர்த்த பண்ணை வரி', 'B) காற்றில்லா சுவாசம்', 'B)மொட்டு விடுதல்', 'B) ஸ்போர்கள்', 'B) கேப்ஸ்யூல்', 'B)மைடாலஜி', 'B) பல செல் புரோகேரியாட்டிக்', 'B) யூக்ளினா', 'B)சைட்டோபிளாசம்', 'B)ரயில்வே துறை', 'B) 272', 'B) 184.25 டி.எம்.சி அடிகள்', 'B)ராஜமன்னார் குழு', 'B) 1971', 'B) 2007', 'B) 2008', 'B) 2 & 3', 'B)ஒடிசா', 'B)மாநிலங்களவை', 'B) ஒருங்கிணைந்த, படிநிலை அமைப்பு அடிப்படையில் நீதித்துறை உள்ளது', 'B)அரசியலமைப்பால் ', 'B) இரண்டு', 'B)புன்ச்சி குழு', 'B) நதிநீர் சிக்கல் சட்டம் 1956', 'B)சத்யா நாதெல்லா', 'B)கோயம்புத்தூர்', 'B)உத்தர்காண்ட்', 'B)அகமதாபாத்', 'B)ஆந்திரப்பிரதேசம்', 'B) பிப்ரவரி 2', 'B) 704', 'B) 24°', 'B) 20%', 'B) 71.11%', 'B) 3:5', 'B) 2 ஆண்டுகள்', 'B) 30%', 'B) 2011', 'B) 15000 பேர்', 'B) 216000']

c = ['C)வேற்றுமையில் ஒற்றுமை', 'C)மக்களவை', 'C)1 & 2', 'C) 29 ', 'C)அண்ணல் அம்பேத்கர்', 'C) இந்திய அரசுச் சட்டம் 1919 ',
     'C)இருபதாவது  ', 'C)1 வருடத்திற்கு ', 'C) 73 & 74 ', 'C)கிரேக்கம் ', 'C) காலிஃப்ளவர் மொசைக் வைரஸ்', 'C)உட்கரு உள்ள பாக்டீரியா & உட்கரு இல்லாத பாக்டீரியா', 'C) சட்டமன்ற அதிகாரப் பகிர்வு,நிதி  அதிகாரப் பகிர்வு & நீதித்துறை அதிகாரப் பகிர்வு', 'C)குடியரசுத் தலைவர்', 'C)முக்கால் அளவு கூட்டாட்சி கொள்கை ', 'C) 1964 ', 'C) 5 ', 'C)மத்திய அரசு', 'C)மூன்று ', 'C) இரண்டும்', 'C)மைக்ரோடிக் ', 'C)சைரஸ்', 'C) பசுங்கணிகம் ', 'C)தாவர உலகம் ', 'C)  செய்தித்தாள்களில் வரும் விளம்பரங்கள் மீதான வரி', 'C)ஒன்பதாவது அட்டவணை ', 'C) 2,4 & 5மட்டும் ', 'C) 270 & 272', 'C) 3 ', 'C) போதுமான வளங்களை பெற்றிருத்தல், நிதிவசதி & செயல்திறன்', 'C)ராஜமன்னார் குழு', 'C)நதிநீர் தீர்ப்பாயங்கள் சட்டம் 1950 ', 'C) 1924 ', 'C)அண்ணாதுரை', 'C) மாநிலங்களுக்கிடையேயான குழுவை', 'C) இரண்டும் ', 'C) மதன் மோகன் புன்ச்சி', 'C)தேவையற்ற வார்த்தை', 'C) 2003 ', 'C) 354 ', 'C)மாநில அரசாங்கம்', 'C) 3 ', 'C)அறுதிப் பெரும்பான்மை', 'C)குடியரசுத் தலைவர் ', 'C)பேராசிரியர் கல்யாணி ', 'C)இந்திய அரசுச் சட்டம் 1919', 'C)அண்ணல் அம்பேத்கர் ', 'C)தனிச் சட்டம்', 'C) 18 ', 'C) மாநில அரசாங்கம் மத்திய அரசை விட எண்ணிக்கையில் அதிக அதிகாரங்களை பெற்றுள்ளது ', 'C) 352 முதல் 362 வரை ', 'C) தனித் தேர்தல் ஆணையம் ', 'C) கலைடாஸ்கோப் ', 'C) புகையிலை பல வண்ண வைரஸ்-TMV ', 'C)விஷத்தன்மை உள்ள திரவம்', 'C) 1 ,2 மட்டும் ', 'C)பணி மாற்று முறை ', 'C)அலெக்சாண்டர் கிங்ஸ்லே', 'C)பிரதமர் ', 'C) 232 ', 'C) 4 ', 'C) உயர்நீதிமன்ற நீதிபதி', 'C)அல்புகோ ', 'C) கனி உறுப்பு', 'C) பால் மற்றும் பாலிலா ', 'C)A & B', 'C) 99, 60, 52 ', 'C) 1 & 3', 'C) 1 & 2', 'C)சர்க்காரியா குழு', 'C)மகாராஷ்டிரா & கர்நாடகம் ', 'C) உச்சநீதிமன்ற அல்லது உயர்நீதிமன்ற ஓய்வுபெற்ற நீதிபதிகள் ', 'C) குடியரசுத்தலைவர் பரிந்துரைத்தால் முடியும் ', 'C) 316 ', 'C)3 மட்டும் ', 'C) 256, 257, 339(2) ', 'C) 3 ', 'C) 1999 ', 'C) 44 ', 'C) சட்ட முன்வரைவு தேக்கிவைப்பு', 'C) 1960 ', 'C)ஏ.லட்சுமண சுவாமி', 'C) 2010 ', 'C)அமெரிக்கா ', 'C)இந்திய சுதந்திர சட்டம் 1947', 'C) VI ', 'C) மாற்றியமைக்கப்பட்ட ', 'C)நாகலாந்து', 'C)தன்னாட்சி ', 'C) 3 மட்டும் தவறு', 'C) மூன்று முக்கிய தலங்களில் மாநில உரிமைகளுக்கு எதிராக மாநிலங்களவை செயல்படுகிறது ', 'C) சிக்கலான வடிவம் ', 'C) 70 S ', 'C) எ.கோலை ', 'C)ரைபோசோம்கள்', 'C)நீதிமன்றமே  முடிவு செய்யும் ', 'C)இந்திய அரசாங்கச் சட்டம் 1919 ', 'C) 14 ', 'C) 263 ', 'C)மாநிலங்கள் மறுசீரமைப்பு குழு சட்டம் 1956', 'C) பிரதமர்', 'C) 1951 நவம்பர் 22 ', 'C)நதிநீர் சமரச சட்டம் 1956', 'C)காளான்', 'C)காரம்', 'C)கரியான்', 'C)முதல் விலங்கு', 'C)மின்சாரம், நீர்ப்பாசனம், வனங்கள், தரைவழிப் போக்குவரத்து போன்ற துறைகளில் மாநில அரசாங்கங்கள் வருமானத்தை ஈட்டலாம்', 'C) சுங்கவரி & ஏற்றுமதி வரி', 'C) 265', 'C)மகாராஷ்டிரா', 'C) 262', 'C) 1996', 'C)காவிரி செயலாக்கம்', 'C) 3', 'C)ஏ.லட்சுமன சுவாமி', 'C) 2005', 'C) 263 (C)', 'C)கோவா', 'C) 1974', 'C) 388', 'C)உச்சநீதிமன்றம்', 'C) 262', 'C) 356', 'C)தகவமையா முறை ', 'C)செயலற்ற நிலையில்', 'C)பாக்டீரியாக்கள்', 'C)ரோடோஸ்பைரில்லம் ரூபரம்', 'C)ஆண்டன் வன் லியுவென்ஹூக்', 'C)அலுவலகம்', 'C) ஒவ்வொரு ஐந்தாண்டிற்கும்', 'C) பிரதமர்', 'C) சர்தார் பட்டேல்', 'C)நிதிக்குழு', 'C)மாநிலங்களவை', 'C) இவை இரண்டும்', 'C)மைகாலஜி', 'C)மால்டோஸ்', 'C)சுமூக  பேச்சுவார்த்தையின் மூலம் பிரச்சினையைத் தீர்ப்பது', 'C)ஏதேனும் ஒரு மாநில அரசு', 'C) பிரதமர்', 'C) 363', 'C) 1987', 'C)இரண்டும்', 'C) அமெரிக்கா', 'C)இங்கிலாந்து', 'C)ஸ்பெயின்', 'C)கொல்கத்தா', 'C) இரண்டும்', 'C)பூஞ்சை வைரஸ்', 'C)வீரியான்', 'C)விப்ரியே', 'C)விப்ரியே', 'C)மாநிலங்களவை தலைவர்', 'C) 298', 'C)தெற்கு மண்டல குழு', 'C) பென்சீன்', 'C)பிரீயான்', 'C)நன்னீர் வாழ்', 'C) மாநில அரசால் விதிக்கப்பட்ட மத்திய அரசால் வசூலிக்கப்படும் வரிகள்', 'C) கனிமவளங்கள் எடுப்பதற்கான உரிம வரி', 'C) ஆக்ஸிஜன் மூலமாக சுவாசம்', 'C)பலவாறாக பிளத்தல்', 'C)ஹைபாக்கள்', 'C)கேப்ஸிட்', 'C)மைகாலஜி', 'C) ஒரு செல் யூகேரியாட்டிக்', 'C)பாராமீசியம்', 'C) செல் சவ்வு', 'C)அஞ்சல் துறை', 'C) 282', 'C) 284.25 டி.எம்.சி அடிகள்', 'C)சர்க்காரியா குழு', 'C) 1972', 'C) 2009', 'C) 2000', 'C) 3 & 4', 'C)மிசோரம்', 'C)  A அல்லது B', 'C)அமெரிக்காவிலும் நீதித்துறையில் கூட்டாட்சி முறை பின்பற்றப்படுவதில்லை', 'C)நாடாளுமன்றத்தால்', 'C) மூன்று', 'C) வெங்கட செல்லையா குழு', 'C)நதி நீர் சமரச சட்டம்  1956', 'C)ஆல்ஸ்டன் நாடார்', 'C) நாமக்கல்', 'C)மேகாலயா', 'C) அலகாபாத்', 'C) உத்திரப்பிரதேசம்', 'C) பிப்ரவரி 3', 'C) 680', 'C) 48°', 'C) 30%', 'C) 73.17%', 'C) 4:5', 'C) 3 ஆண்டுகள்', 'C) 25%', 'C) 2006', 'C) 500  பேர்', 'C) 224000']

d = ['D)ஒற்றுமையில் வேற்றுமை ', 'D)இவை அனைத்தும்', 'D)ஏதும் இல்லை', 'D) 39', 'D) ராஜகோபாலாச்சாரி  ',
     'D)இந்திய அரசுச் சட்டம் 1935', 'D)இருபத்து ஆறாவது ', 'D) 5 வருடங்களுக்கு ', 'D) 74 & 75', 'D)ஆங்கிலம்', 'D) உருளைக்கிழங்கு வைரஸ்', 'D)இவை அனைத்தும்', 'D)ஆட்சித்துறை அதிகாரப் பகிர்வு,நிதி  அதிகாரப் பகிர்வு & நீதித்துறை அதிகாரப் பகிர்வு', 'D) மாநிலங்களவை ', 'D)முழுமையான கூட்டாட்சி கொள்கை', 'D) 1969', 'D) 6', 'D) மாநில அரசு ', 'D) நால்வரும் ', 'D) ஏதுமில்லை', 'D)மியூகாட்டிக்', 'D) சீரம்', 'D)வாக்கியோல்கள்', 'D)புரோட்டிஸ்டா', 'D) A & B', 'D)பத்தாவது அட்டவணை ', 'D) மேற்கண்ட அனைத்தும் ', 'D) 271 & 273', 'D) 4', 'D) ஒருங்கிணைத்தல் மற்றும் ஒன்றுபடுதல், நிர்வாக சிக்கனம் & பொறுப்பேற்பு', 'D) இவை அனைத்தும்', 'D)நதிநீர் தீர்ப்பாயங்கள் சட்டம் 1956', 'D) 1935', 'D) ராமச்சந்திரன்', 'D) மாநில ஆளுநர்களை', 'D)ஏதுமில்லை', 'D) ஏதுமில்லை', 'D) வரம்பற்ற வார்த்தை', 'D) 2007', 'D) 427', 'D) குடியரசு தலைவர் ', 'D) 4', 'D) நான்கில் ஒரு பங்கு பெரும்பான்மை', 'D)குடியரசுத் தலைவர் மாளிகை ', 'D)இளங்கோ கல்லானை ', 'D) இந்திய அரசுச் சட்டம் 1935', 'D)சர்தார் பட்டேல்', 'D) ஏதும் இல்லை ', 'D) 21', 'D)ஏதுமில்லை', 'D)356 முதல் 362 வரை', 'D)மாநிலங்களவை ', 'D) மைக்ரோஸ்கோப் ', 'D)இவை அனைத்திலும் ', 'D) மட்கவைக்கும் பொருள்', 'D)அனைத்தும்', 'D)திரும்ப ஒப்படைப்பு முறை ', 'D) வில்லியம் கிங்ஸ்லே ', 'D)மத்திய உள்துறை அமைச்சர்', 'D) 262', 'D) 6', 'D) மக்களவை உறுப்பினர்', 'D) உஸ்டிலோகோ', 'D) இவை அனைத்தும்', 'D)ஏதும் இல்லை', 'D)  A or B', 'D) 100, 60, 51', 'D)மேற்கண்ட அனைத்தும்', 'D) ஏதும் இல்லை ', 'D) ராஜமன்னார் குழு ', 'D)ஆந்திரா & தெலுங்கானா', 'D)மாநில தலைமை வழக்கறிஞர்கள்', 'D)பிரதமர் பரிந்துரைத்தால் முடியும்', 'D) 318', 'D)ஏதும் இல்லை', 'D) 256, 287, 356(2)', 'D) 4', 'D) 2001', 'D) 46', 'D) இவை அனைத்தும் ', 'D) 1966', 'D) பி.வி.ராஜமன்னார்', 'D) 2011', 'D)கனடா ', 'D) இந்திய அரசுச் சட்டம் 1919', 'D) VII', 'D)தருவிக்கப்பட்ட ', 'D) சிக்கிம்', 'D)கூட்டாட்சி', 'D) அனைத்தும் சரி ', 'D)மாநிலங்களவையின் அமைப்பு முறையில் சமத்துவம் பின்பற்றப்படுகிறது', 'D)கோல் வடிவம் ', 'D) 80 S', 'D)ரோடோஸ்பைரில்லம் ரூபரம்', 'D) இவை அனைத்தும் ', 'D)குடியரசுத் தலைவர் முடிவு செய்வார் ', 'D)இந்திய அரசாங்கச் சட்டம் 1935', 'D) 15', 'D) 293', 'D) ஏதுமில்லை ', 'D) துணை குடியரசுத் தலைவர்', 'D) 1952 நவம்பர் 22 ', 'D)A & B', 'D)மோல்ட்', 'D)சர்க்கரை', 'D) மரியான்', 'D)ஆபத்தான விலங்கு', 'D) தவறானது ஏதுமில்லை', 'D)மது மற்றும் போதைப் பொருட்கள் மீதான கலால் வரி', 'D) 267', 'D)கர்நாடகா', 'D) 297', 'D) 2004', 'D)ஏதுமில்லை', 'D) 4', 'D)மொரார்ஜி தேசாய்', 'D) 2010', 'D) ஏதுமில்லை', 'D)டெல்லி', 'D) 1986', 'D) 398', 'D)ராஷ்டிரபதிபவன்', 'D) 362', 'D) 360', 'D)தகவமையும் அரசமைப்பு முறை', 'D)இவை அனைத்தும்', 'D)வைரஸ்கள்', 'D)சூடோமோனாஸ்', 'D)ஜோன்ஸ் சால்க்', 'D)நாடாளுமன்றம்', 'D) ஒவ்வொரு ஆறாண்டிற்கும் ', 'D)மத்திய உள்துறை அமைச்சர்', 'D)டாக்டர் ராஜேந்திர பிரசாத்', 'D) மண்டல குழு', 'D) நாடாளுமன்றம்', 'D)ஏதுமில்லை', 'D)ஃபங்காலஜி', 'D)சிரம்', 'D) இவை அனைத்தும்', 'D)குடியரசுத் தலைவர் மாளிகை', 'D)உச்சநீதிமன்ற தலைமை நீதிபதி', 'D) 397', 'D) 1989', 'D)ஏதுமில்லை', 'D) இவை அனைத்தும்', 'D)இந்தியா', 'D)அமெரிக்கா', 'D)பஞ்சாப்', 'D)ஏதுமில்லை', 'D)புரோடோசோவா வைரஸ்', 'D) ஏதுமில்லை', 'D)பேசில்லை', 'D)பேசில்லை', 'D) பிரதமர்', 'D) 280', 'D)மத்திய மண்டல குழு', 'D)பெனிலியம்', 'D) வீரியான்', 'D) இவை அனைத்தும்', 'D)மத்திய அரசால் விதிக்கப்பட்டு,வசூலிக்கப்பட்டு அந்தந்த மாநிலங்களுக்கு வழங்கப்படும் வரிகள்', 'D) செய்தித்தாள் மீதான வரி (அதில் வெளியிடும் விளம்பரம் உட்பட)', 'D)ஏதும் இல்லை', 'D)துண்டாதல்', 'D)இவை அனைத்தும்', 'D) அப்ஸ்ட்ராக்ட்', 'D)சைட்டாலஜி', 'D) பல செல் யூகேரியாட்டிக்', 'D)பிளாஸ்மோடியம்', 'D) இவை அனைத்தும்', 'D)கல்வித் துறை', 'D) 279', 'D) 177.25 டி.எம்.சி அடிகள்', 'D)வெங்கட செல்லையா குழு', 'D) 1973', 'D) 2006', 'D) 1999', 'D) 4 & 5', 'D)சிக்கிம்', 'D) A மற்றும் B', 'D) இந்தியாவில் சட்டமன்றம், ஆட்சித்துறை, நிதி தலங்களில் மட்டுமே கூட்டாட்சியில் இயங்குகிறது', 'D)மாநிலங்களவையால்', 'D)நால்வரும்', 'D)சர்க்காரியா குழு', 'D) A & B', 'D) குரேஷி ஐயர்', 'D) சேலம்', 'D) நாகாலாந்து', 'D)ஹைதராபாத்', 'D)அசாம்', 'D) பிப்ரவரி 4', 'D) 584', 'D) 54°', 'D) 40%', 'D) 75.55%', 'D) 7:9', 'D)4 ஆண்டுகள்', 'D) 21%', 'D) 2009', 'D) 5,000 பேர்', 'D) 226000 ']

correct_answer = ['C)வேற்றுமையில் ஒற்றுமை', 'A)நாடாளுமன்றத்தின் மேலவை', 'A)1 மட்டும்', 'B) 31', 'C)அண்ணல் அம்பேத்கர்',
                  'C) இந்திய அரசுச் சட்டம் 1919', 'C)இருபதாவது', 'C)1 வருடத்திற்கு', 'C) 73 & 74', 'C)கிரேக்கம்', 'B) முள்ளங்கி மொசைக் வைரஸ்', 'A)காற்று சுவாச பாக்டீரியா & காற்றில்லா சுவாச பாக்டீரியா', 'A) சட்டமன்ற அதிகாரப் பகிர்வு, ஆட்சித்துறை அதிகாரப் பகிர்வு & நிதி அதிகாரப் பகிர்வு', 'B)மாநிலங்கள்', 'B)அரை அளவு கூட்டாட்சி கொள்கை', 'B) 1971', 'C) 5', 'C)மத்திய அரசு', 'C)மூன்று', 'B) 2 மட்டும்', 'B)யூகரியோடிக்', 'A) சைமேஸ்', 'C) பசுங்கணிகம்', 'D)புரோட்டிஸ்டா', 'C) செய்தித்தாள்களில் வரும் விளம்பரங்கள் மீதான வரி', 'B) ஏழாவது அட்டவணை', 'D) மேற்கண்ட அனைத்தும்', 'C) 270 & 272', 'A) 1', 'B) சகோதரத்துவம், தனி ஆளுகை & வெளிப்படைத்தன்மை', 'A) சர்க்காரியா குளு', 'B)நதிநீர் சிக்கல்கள் சட்டம் 1956', 'C) 1924', 'C)அண்ணாதுரை', 'C) மாநிலங்களுக்கிடையேயான குழுவை', 'D)ஏதுமில்லை', 'C) மதன் மோகன் புன்ச்சி', 'C)தேவையற்ற வார்த்தை', 'D) 2007', 'B) 247', 'A) அரசியலமைப்பு', 'A) 1', 'C)அறுதிப் பெரும்பான்மை', 'B)மத்திய அரசு', 'A) பேராசிரியர் வேர்', 'D) இந்திய அரசுச் சட்டம் 1935', 'A) ஜவஹர்லால் நேரு', 'A)சாதாரண சட்டம்', 'C) 18', 'C) மாநில அரசாங்கம் மத்திய அரசை விட எண்ணிக்கையில் அதிக அதிகாரங்களை', 'A) 352 முதல் 360 வரை', 'B)தேசிய தேர்தல் ஆணையம்', 'D) மைக்ரோஸ்கோப்', 'A) T4-பேக்டீரியாபேஜ்', 'C)விஷத்தன்மை உள்ள திரவம்', 'C) 1 ,2 மட்டும்', 'B) பணி ஒப்படைப்பு முறை', 'A) கிரான்வில் ஆஸ்டின்', 'D)மத்திய உள்துறை அமைச்சர்', 'D) 262', 'C) 4', 'C) உயர்நீதிமன்ற நீதிபதி', 'A) மைக்கோரைசா', 'C) கனி உறுப்பு', 'C) பால் மற்றும் பாலிலா', 'A) மத்திய அரசு', 'B) 98, 59, 52', 'C) 1 & 3', 'C) 1 & 2', 'B) புஞ்சி குழு', 'B) பஞ்சாப் & ஹரியானா', 'D)மாநில தலைமை வழக்கறிஞர்கள்', 'B)முடியாது', 'A) 312', 'A)1மட்டும்', 'C) 256, 257, 339(2)', 'B) 2', 'A) 1994', 'B) 42', 'D) இவை அனைத்தும்', 'D) 1966', 'A) கே.அனுமந்தையா', 'C) 2010', 'C)அமெரிக்கா', 'A) ஒழுங்குமுறைச் சட்டம் 1773', 'C) VI', 'A)எழுதப்பட்ட', 'A) அசாம்', 'D)கூட்டாட்சி', 'C) 3 மட்டும் தவறு', 'B) மாநிலங்களவை மாநிலங்களின் பிரதிநிதிகளால் உருவாக்கப்படுகிறது', 'A) கோள வடிவம்', 'C) 70 S', 'A) சூடோமோனாஸ்', 'C)ரைபோசோம்கள்', 'A) மத்திய அரசு', 'D)இந்திய அரசாங்கச் சட்டம் 1935', 'D) 15', 'C) 263', 'C)மாநிலங்கள் மறுசீரமைப்பு குழு சட்டம் 1956', 'C) பிரதமர்', 'C) 1951 நவம்பர் 22 ', 'B) நதி நீர் சிக்கல் சட்டம் 1956', 'A) ஈஸ்ட்\n', 'D)சர்க்கரை', 'A)விரியான்', 'C)முதல் விலங்கு', 'A) மத்திய அரசாங்கம் தனக்கான வணிக மற்றும் தொழில் நிறுவனங்களை நடத்தி வருமானத்தை ஈட்ட முடியாது', 'D)மது மற்றும் போதைப் பொருட்கள் மீதான கலால் வரி', 'B) 268', 'B)உத்தரப்பிரதேசம்', 'C) 262', 'B) 1991', 'A) காவிரி மேலாண்மை', 'B) 2\n', 'D)மொரார்ஜி தேசாய்', 'C) 2005', 'A) 263 (A)', 'D)டெல்லி', 'C) 1974', 'B) 368', 'C)உச்சநீதிமன்றம்', 'B) 312', 'A) 352 ', 'B) நெகிழா அரசமைப்பு முறை', 'C)செயலற்ற நிலையில்', 'C)பாக்டீரியாக்கள்', 'A) சயனோ பாக்டீரியா\n', 'C)ஆண்டன் வன் லியுவென்ஹூக்', 'D)நாடாளுமன்றம்', 'C) ஒவ்வொரு ஐந்தாண்டிற்கும்', 'C) பிரதமர்', 'B)ஜவஹர்லால் நேரு', 'A)நிதி ஆயோக்', 'D) நாடாளுமன்றம்', 'B)பென்சிலியம்', 'C)மைகாலஜி', 'B)தாலஸ்', 'C)சுமூக  பேச்சுவார்த்தையின் மூலம் பிரச்சினையைத் தீர்ப்பது', 'B)மத்திய அரசு', 'D)உச்சநீதிமன்ற தலைமை நீதிபதி', 'B) 263', 'B) 1983', 'C)இரண்டும்', 'C) அமெரிக்கா', 'C)இங்கிலாந்து', 'D)அமெரிக்கா', 'C)கொல்கத்தா', 'D)ஏதுமில்லை', 'B)விலங்கு வைரஸ்', 'A) வீராய்டு', 'D)பேசில்லை', 'A)ஸ்பைரில்லா', 'B)குடியரசுத்தலைவர்', 'D) 280', 'A) தென்மேற்கு மண்டல குழு', 'A)ஈஸ்ட்', 'C)பிரீயான்', 'C)நன்னீர் வாழ்', 'C) மாநில அரசால் விதிக்கப்பட்ட மத்திய அரசால் வசூலிக்கப்படும் வரிகள்\n', 'C) கனிமவளங்கள் எடுப்பதற்கான உரிம வரி', 'B) காற்றில்லா சுவாசம்', 'B)மொட்டு விடுதல்', 'C)ஹைபாக்கள்', 'C)கேப்ஸிட்', 'A) பைகாலஜி', 'C) ஒரு செல் யூகேரியாட்டிக்', 'A) அமீபா', 'C) செல் சவ்வு', 'D)கல்வித் துறை', 'A) 269', 'D) 177.25 டி.எம்.சி அடிகள்', 'B)ராஜமன்னார் குழு\n', 'B) 1971', 'B) 2007', 'C) 2000\n', 'C) 3 & 4', 'D)சிக்கிம்', 'B)மாநிலங்களவை', 'C)அமெரிக்காவிலும் நீதித்துறையில் கூட்டாட்சி முறை பின்பற்றப்படுவதில்லை', 'B)அரசியலமைப்பால் ', 'C) மூன்று', 'D)சர்க்காரியா குழு', 'A) நதி ஆணையங்கள் சட்டம் 1956', 'A) பவ்யா லால்', 'D) சேலம்', 'B)உத்தர்காண்ட்', 'A) காஷ்மீர்', 'C) உத்திரப்பிரதேசம்', 'C) பிப்ரவரி 3', 'C) 680', 'D) 54°', 'B) 20%', 'C) 73.17%', 'D) 7:9', 'D)4 ஆண்டுகள்', 'C) 25%', 'C) 2006', 'D) 5,000 பேர்', 'B) 216000']


@app.route("/", methods=["GET", "POST"])
def home():
    warning = request.args.get("warn")

    if current_user.is_authenticated:
        completed = Test17.query.filter_by(examinee_id=current_user.user_id).first()

        if request.args.get("fee"):
            name = request.args.get("name")
            bending = request.args.get("bending")
            logged_in = request.args.get("logged_in")

            return render_template("index.html", fee=True, name=name, bending=bending, logged_in=logged_in,
                                   completed=completed)

        else:
            if completed:
                completed = Test17.query.filter_by(examinee_id=current_user.user_id).first()
                return render_template("index.html", warning=warning, completed=completed)

            else:
                return render_template("index.html", warning=warning)

    else:
        return render_template("index.html", warning=warning)


@app.route("/register", methods=['GET', 'POST'])
def register():
    form = RegisterForm()
    errors = []

    if form.validate_on_submit():
        hash_and_salted_password = generate_password_hash(
            request.form.get('password'),
            method='pbkdf2:sha256',
            salt_length=8
        )

        new_user = User(
            email=request.form.get('email'),
            username=request.form.get('name'),
            password=hash_and_salted_password,
        )

        if User.query.filter_by(email=request.form.get('email').lower()).first():
            return redirect(url_for('login', msg="You've already been registered. Please Login!"))

        elif User.query.filter_by(username=request.form.get('name')).first():
            errors.append('The username has already been taken')
            return render_template("register.html", errors=errors, form=form)

        else:
            errors.clear()

            if request.form.get('email') in verified_emails:

                db.session.add(new_user)
                db.session.commit()

                login_user(new_user)

                # redirect to the home page with fee details.
                return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                        bending=student_mails[request.form.get('email')][1]))

            else:
                return redirect(url_for('home', warn=True))

    return render_template("register.html", form=form)


@app.route("/login", methods=['GET', 'POST'])
def login():
    form = LoginForm()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        password = request.form.get('password')

        # Find user by email entered.
        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, password):
            login_user(user)
            errors.clear()

            # checking the user's payment details
            # redirect to the home page with fee details.
            return redirect(url_for('home', fee=True, name=student_mails[request.form.get('email')][0],
                                    bending=student_mails[request.form.get('email')][1]))

        else:
            errors.append('Incorrect Password! Try Again')
            return render_template("login.html", errors=errors, form=form)

    msg = request.args.get("msg")
    return render_template("login.html", form=form, errors=errors, msg=msg)


@app.route("/exam", methods=["GET", "POST"])
def exam():
    global attended
    test_no = request.args.get("test_no")
    opentime = exam_sites[request.args.get("test_no")][0]
    closetime = exam_sites[request.args.get("test_no")][1]

    if test_no == "15":
        attended = Test15.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "16":
        attended = Test16.query.filter_by(examinee_id=current_user.user_id).first()

    elif test_no == "17":
        attended = Test17.query.filter_by(examinee_id=current_user.user_id).first()

    if attended is None:
        return render_template("exam.html", opentime=json.dumps(opentime), closetime=json.dumps(closetime),
                               sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d, correct_answer=correct_answer,
                               answers=[], test_no=test_no)
    else:
        return redirect(url_for("home", warn="You have already committed this exam. Check the results instead."))


@app.route('/evaluate', methods=["GET", "POST"])
def evaluate():

    global new_examinee
    answers = []
    final_result = []
    marks = 0

    for i in range(0, 200):
        user_answer = request.form[f'answers{i}']

        if user_answer is None:
            answers.append("None")

        else:
            answers.append(user_answer)

    for j in range(len(correct_answer)):

        if answers[j] == correct_answer[j]:
            marks += 1
            final_result.append("Correct")

        else:
            final_result.append("Wrong")

    # return f"{final_result, answers, correct_answer}"

    st_answers = '#||#'.join(answers)
    f_result = "#||#".join(final_result)

    actual_time = datetime.datetime.now()
    s_time = actual_time.strftime('%Y-%m-%d %H:%M:%S.%f')

    new_examinee = Test17(
        test_author=current_user,
        user_answers=st_answers,
        marks=marks,
        final_result=f_result,
        date=s_time[:-7],
        examinee_name=current_user.username
    )

    db.session.add(new_examinee)
    db.session.commit()

    return redirect(url_for('home', warn="You have successfully completed the exam. Click results to see results."))


@app.route("/result", methods=["GET", "POST"])
def result():
    global answers, final_result, time, marks
    test_no = request.args.get("test_no")

    if test_no == "15":
        attended_student = Test15.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "16":
        attended_student = Test16.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    elif test_no == "17":
        attended_student = Test17.query.filter_by(examinee_id=current_user.user_id).first()

        answers = attended_student.user_answers.split('#||#')
        final_result = attended_student.final_result.split('#||#')
        marks = attended_student.marks
        time = attended_student.date

    return render_template("results.html", answers=answers, marks=marks, sl_no=sl_no, ques=ques, a=a, b=b, c=c, d=d,
                           correct_answer=correct_answer, final_result=final_result, time=time)


@app.route("/dashboard")
def dashboard():
    all_record = Test17.query.all()

    return render_template("dashboard.html", all_record=all_record)


@app.route("/change_details", methods=["GET", "POST"])
def change_password():
    form = ChangeDetails()
    errors = []

    if form.validate_on_submit():
        email = request.form.get('email')
        old_password = request.form.get('old_password')
        new_password = request.form.get('new_password')

        user = User.query.filter_by(email=email).first()

        if not user:
            errors.append("That email does not exist, please Register and then come back.")
            return render_template("login.html", errors=errors, form=form)

        # Check stored password hash against entered password hashed.
        if check_password_hash(user.password, old_password):

            if User.query.filter_by(email=email).first():
                old = User.query.filter_by(email=email).first()
                pass_to_update = User.query.get(old.user_id)

                hash_and_salted_password = generate_password_hash(
                    new_password,
                    method='pbkdf2:sha256',
                    salt_length=8
                )

                pass_to_update.password = hash_and_salted_password

                db.session.commit()

                logout_user()
                return redirect(url_for('login', msg="Your password has been changed successfully. "
                                                     "Please Login with your new password."))

        else:
            errors.append("Please check your password.")
            return render_template("change_details.html", form=form, errors=errors)

    return render_template("change_details.html", form=form, errors=errors)


@app.route('/logout')
@login_required
def logout():
    logout_user()
    return redirect(url_for('home'))


@app.route("/admission", methods=["GET", "POST"])
def new_admission():
    form = AdmissionForm()

    if form.validate_on_submit():
        new_member = Admission(
            name=form.name.data,
            mobile_number=form.number.data,
            email=form.email.data,
        )

        db.session.add(new_member)
        db.session.commit()

        verification_code = random.randint(2000, 10000)

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=request.form.get('email'),
                                msg=f"Subject:WELCOME TO SENA CAREER INSTITUTE\n\nWelcome {request.form.get('name')}!"
                                    f" Happy to see you with us. Thanks for supporting us! Keep rocking! "
                                    f"Here is our Educators' number: 8610642720".encode('utf-8'))

        with smtplib.SMTP('smtp.gmail.com', 587) as connection:
            connection.starttls()
            connection.login(MY_EMAIL, MY_PASSWORD)
            connection.sendmail(from_addr=MY_EMAIL,
                                to_addrs=MY_EMAIL,
                                msg=f"Subject:NEW ADMISSION\n\n{request.form.get('name')} has made an "
                                    f"admission sign up on Sena site Here is details {request.form.get('name')},"
                                    f" {request.form.get('number')}, {request.form.get('email')}!")

        return redirect(url_for('home'))

    return render_template("register.html", form=form, admission=True)


if __name__ == '__main__':
    app.run(debug=True)
